Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: ATSADDNZ: only positive time pointer values are allowed, setting to zero
french: ATSADDNZ : seules les valeurs de pointeur temporel positives sont admises, fixée à zéro

source: ATSADDNZ: time pointer out of range, truncating to last frame
french: ATSADDNZ : pointeur temporel hors limites, tronqué à la dernière trame

source: ATSSINNOI: Partial(s) out of range, max partial allowed is %i
french: ATSSINNOI : partiel(s) hors limites, le partiel max autorisé est %i

source: ATSSINNOI: Type not implemented
french: ATSSINNOI : type non implémenté

source: ATSSINNOI: only positive time pointer values are allowed, setting to zero
french: ATSSINNOI : seules les valeurs de pointeur temporel positives sont admises, fixée à zéro

source: ATSSINNOI: time pointer out of range, truncating to last frame
french: ATSSINNOI : pointeur temporel hors limites, tronqué à la dernière trame

source: ATSBUFREAD: Partial out of range, max partial is %i
french: ATSBUFREAD : partiel hors limites, le partiel max est %i

source: ATSBUFREAD: Type not implemented
french: ATSBUFREAD : type non implémenté

source: ATSBUFREAD: only positive time pointer values are allowed, setting to zero
french: ATSBUFREAD : seules les valeurs de pointeur temporel positives sont admises, fixée à zéro

source: ATSBUFREAD: time pointer out of range, truncating to last frame
french: ATSBUFREAD : pointeur temporel hors limites, tronqué à la dernière trame

source: ATSBUFREAD: not initialised
french: ATSBUFREAD : non initialisé
italian: ATSBUFREAD: non inizializzato

source: ATSPARTIALTAP: you must have an atsbufread before an atspartialtap
french: ATSPARTIALTAP : il faut avoir un atsbufread avant un atspartialtap

source: ATSPARTIALTAP: exceeded max partial %i
french: ATSPARTIALTAP : le partiel max %i a été dépassé

source: ATSPARTIALTAP: partial must be positive and nonzero
french: ATSPARTIALTAP : un partiel doit être strictement positif

source: ATSINTERPREAD: you must have an atsbufread before an atsinterpread
french: ATSINTERPREAD : il faut avoir un atsbufread avant un atsinterpread

source: ATSINTERPREAD: frequency must be greater than 20 and less than 20000 Hz
french: ATSINTERPREAD : la fréquence doit être supérieure à 20 Hz et inférieureà 20000 Hz

source: ATSCROSS: Function table number for synthesis waveform not valid
french: ATSCROSS : le numéro de table de fonction pour la forme d'onde de la synthèse n'est pas valide

source: ATSCROSS: Partial(s) out of range, max partial allowed is %i
french: ATSCROSS : partiel(s) hors limites, le partiel max autorisé est %i

source: ATSCROSS: Type not implemented
french: ATSCROSS : type non implémenté

source: ATSCROSS: only positive time pointer values are allowed, setting to zero
french: ATSCROSS : seules les valeurs de pointeur temporel positives sont admises, fixée à zéro

source: ATSCROSS: time pointer out of range, truncating to last frame
french: ATSCROSS : pointeur temporel hors limites, tronqué à la dernière trame

source: ATSCROSS: you must have an atsbufread before an atsinterpread
french: ATSCROSS : il faut avoir un atsbufread avant un atsinterpread

source: Phaser mode must be either 1 or 2
french: Le mode du phaser doit valoir 1 ou 2

source: Out of range in vaget (%d)
french: Hors limites dans vaget (%d)

source: Out of range in vaset (%d)
french: Hors limites dans vaset (%d)

source: vbap: error allocating loudspeaker table
french: vbap : erreur lors de l'allocation de la table de haut-parleurs

source: Number of loudspeakers is zero Exiting
french: Le nombre de haut-parleurs est zéro Fin du traitement

source: Error in loudspeaker dimension. %d not permitted
french: Erreur dans la dimension de haut-parleur, %d est interdit.

source: Too few loudspeakers
french: Trop peu de haut-parleurs

source: Too little data speakers (%d)
french: Trop peu de données de haut-parleurs (%d)

source: Not valid 3-D configuration
french: Non valide en configuration 3-D

source: Configured loudspeakers
french: Haut-parleurs configurés

source: Triplet %d Loudspeakers:
french: Haut-parleurs triplet %d :

source: Pair of speakers at %f and %f ignored
french: La paire de haut-parleurs en %f et %f est ignorée

source: insufficient valid speakers
french: nombre de haut-parleurs insuffisant
italian: speakers validi insufficienti

source: Pair %d Loudspeakers:
french: Haut-parleurs Paire %d :

source: Warning: truncating elevation to 2-D plane
french: Avertissement : l'élévation est tronquée vers un plan 2-D

source: could not find layout table no.%d
french: la table de disposition no.%d est introuvable
italian: non riesco a trovare la tavola di layout no.%d

source: vbap system NOT configured. Missing vbaplsinit opcode in orchestra?
french: vbap : système NON configuré. L'opcode vbaplsinit manque-t-il dans l'orchestre ?

source: Missing fields in vbapmove
french: Il manque des champs dans vbapmove
italian: Mancano dei campi in vbapmove

source: Warning: Ambiguous transition 180 degrees.
french: Avertissement : transition ambiguë de 180 degrés.

source: Have to have at least %d directions in vbapmove
french: Il faut au moins %d directions dans vbapmove

source: Wrong dimension
french: Dimension incorrecte

source: Output array not initialised
french: Tableau de sortie non initialisé
italian: Array d'output non inizializzato

source: could not find layout table no.0
french: la table de disposition nO.0 est introuvable
italian: non riesco a trovare la tavola di layout no.0

source: Output array in vpabmove not initalised
french: Tableau de sortie de vpabmove non initialisé

source: Missing fields in vbapzmove
french: Il manque des champs dans vbapzmove

source: Have to have at least %d directions in vbapzmove
french: Il faut au moins %d directions dans vbapzmove

source: vpvoc: Could not find ifnmagctrl table
french: vpvoc : la table ifnmagctrl n'a pas été trouvée
italian: vpvoc: Non trovo la tavola ifnmagctrl

source: vpvoc: associated tableseg not found
french: vpvoc : tableseg associé non trouvé

source: VPVOC cannot load %s
french: VPVOC ne peut pas charger %s

source: vpvoc: not initialised
french: vpvoc : non initialisé
italian: vpvoc: non inizializzato

source: wterrain: ftable not found
french: wterrain : ftable non trouvée

source: Source table must be same size or smaller than dest table
french: La table source doit avoir la même taille ou être plus petite que la table dest

source: Scantable: point table not found
french: Scantable : la table de points n'a pas été trouvée

source: Scantable: mass table not found
french: Scantable : la table de masse n'a pas été trouvée

source: Scantable: stiffness table not found
french: Scantable : la table de raideur n'a pas été trouvée

source: Scantable: damping table not found
french: Scantable : la table d'atténuation n'a pas été trouvée

source: Scantable: velocity table not found
french: Scantable : la table de vélocité n'a pas été trouvée

source: Table lengths do not agree!!
french: Les longueurs des tables ne concordent pas !!

source: websocket: variable %s data not sent, buffer overrrun
french: websocket : données de la variable %s non envoyées, tampon saturé

source: websocket: this opcode does not send strings, only receiving them is supported Exiting
french: websocket : cet opcode n'envoie pas de chaînes de caractères, seule leur réception est supportée Sortie

source: websocket: error output string variable %s must not be initialised Exiting
french: websocket : erreur, la chaîne de caractères %s en sortie ne doit pas être initialisée Sortie

source: websocket: error array variable %s has not been initialised Exiting
french: websocket : erreur, la variable tableau %s n'a pas été initialisée Sortie

source: websocket: error, incompatible argument detected Exiting
french: websocket : erreur, argument incompatible détecté Sortie

source: websocket: received message from is not correct size for variable %s, message dumped
french: websocket : le message reçu a une taille incorrecte pour la variable %s, message éliminé

source: websocket: received string message from %s is too large, message dumped
french: websocket : la chaîne de caractères reçue de %s est trop grande, message supprimé

source: websocket: received message from %s dumped, buffer overrrun
french: websocket : élimination du message reçu de %s, tampon saturé

source: websocket: connection established for %s
french: websocket : connexion établie pour %s

source: websocket: could not initialise websocket, Exiting
french: websocket : impossible d'initialiser websocket. Sortie

source: unable to open wiimote
french: impossible d'ouvrir la wiimote

source: wiimote %i disconnected
french: la wiimote %i est déconnectée

source: Nunchuk inserted.
french: Nunchuk inséré.

source: Nunchuk for wiimote %i was removed.
french: Le nunchuk de la wiimote %i a été enlevé.

source: No wii open
french: Pas de wii ouverte

source: wiimote %d does not exist
french: La wiimote %d n'existe pas

source: Not open
french: Pas ouvert

source: No wii range
french: Pas d'intervalle wii

source: zakinit should only be called once.
french: zakinit ne doit être appelé qu'une seule fois.
italian: zakinit dovrebbe essere chiamato una sola volta.

source: zakinit: both isizea and isizek should be > 0.
french: zakinit : isizea et isizek doivent tous les deux être > 0.
italian: zakinit: sia isizea che isizek devono essere > 0.

source: zakinit: failed to allocate globals
french: zakinit : échec de l'allocation des variables globales

source: No zk space: zakinit has not been called yet.
french: Pas d'espace zk : zakinit n'a pas encore été appelé.
italian: Nessuno spazio zk: zakinit non ?? stato ancora chiamato.

source: zkr index > isizek. Returning 0.
french: index zkr > isizek. 0 est retourné.
italian: zkr index > isizek. Restituisce 0.

source: zkr index < 0. Returning 0.
french: index zkr < 0. 0 est retourné.
italian: zkr index < 0. Restituisce 0.

source: zir index > isizek. Returning 0.
french: index zir > isizek. 0 est retourné.
italian: zir index > isizek. Restituisce 0.

source: zir index < 0. Returning 0.
french: index zir < 0. 0 est retourné.
italian: zir index < 0. Restituisce 0.

source: zkw index > isizek. Not writing.
french: index zkw > isizek. Pas d'écriture.
italian: zkw index > isizek. Nessuna scrittura.

source: zkw index < 0. Not writing.
french: index zkw < 0. Pas d'écriture.
italian: zkw index < 0. Nessuna scrittura.

source: ziw index > isizek. Not writing.
french: index ziw > isizek. Pas d'écriture.
italian: ziw index > isizek. Nessuna scrittura.

source: ziw index < 0. Not writing.
french: index ziw < 0. Pas d'écriture.
italian: ziw index < 0. Nessuna scrittura.

source: zkwm index > isizek. Not writing.
french: index zkwm > isizek. Pas d'écriture.
italian: zkwm index > isizek. Nessuna scrittura.

source: zkwm index < 0. Not writing.
french: index zkwm < 0. Pas d'écriture.
italian: zkwm index < 0. Nessuna scrittura.

source: ziwm index > isizek. Not writing.
french: index ziwm > isizek. Pas d'écriture.
italian: ziwm index > isizek. Nessuna scrittura.

source: ziwm index < 0. Not writing.
french: index ziwm < 0. Pas d'écriture.
italian: ziwm index < 0. Nessuna scrittura.

source: zkmod kzkmod > isizek. Not writing.
french: zkmod : kzkmod > isizek. Pas d'écriture.
italian: zkmod kzkmod > isizek. Nessuna scrittura.

source: zkcl first or last > isizek. Not clearing.
french: zkcl : first ou last > isizek. Pas d'effacement.
italian: primo o ultimo zkcl > isizek. Non posso liberare.

source: zkcl first or last < 0. Not clearing.
french: zkcl : first ou last < 0. Pas d'effacement.
italian: primo o ultimo zkcl < 0. Non cancello.

source: zkcl first > last. Not clearing.
french: zkcl : first > last. Pas d'effacement.
italian: primo > ultimo zkcl. Non cancello.

source: No za space: zakinit has not been called yet.
french: Pas d'espace za : zakinit n'a pas encore été appelé.
italian: Nessuno spazio za: zakinit non ?? stato ancora chiamato.

source: zar index > isizea. Returning 0.
french: zar : index > isizea. 0 est retourné.
italian: zar index > isizea. Restituisce 0.

source: zar index < 0. Returning 0.
french: zar : index < 0. 0 est retourné.
italian: zar index < 0. Restituisce 0.

source: zarg index > isizea. Returning 0.
french: zarg : index > isizea. 0 est retourné.
italian: zarg index > isizea. Restituisce 0.

source: zarg index < 0. Returning 0.
french: zarg : index < 0. 0 est retourné.
italian: zarg index < 0. Restituisce 0.

source: zaw index > isizea. Not writing.
french: zaw : index > isizea. Pas d'écriture.
italian: zaw index > isizea. Nessuna scrittura.

source: zaw index < 0. Not writing.
french: zaw : index < 0. Pas d'écriture.
italian: zaw index < 0. Nessuna scrittura.

source: zamod kzamod > isizea. Not writing.
french: zamod : kzamod > isizea. Pas d'écriture.
italian: zamod kzamod > isizea. Nessuna scrittura.

source: zacl first or last > isizea. Not clearing.
french: zacl : first ou last > isizea. Pas d'effacement.
italian: primo o ultimo zkcl > isizea. Non cancello.

source: zacl first or last < 0. Not clearing.
french: zacl : first ou last < 0. Pas d'effacement.
italian: primo o ultimo zacl < 0. Non cancello.

source: zacl first > last. Not clearing.
french: zacl : first > last. Pas d'effacement.
italian: primo > ultimo zacl. Non cancello.

source: Error opening log file '%s': %s
french: Erreur en ouvrant le fichier journal '%s' : %s
italian: Errore in apertura del file di log '%s': %s

source: --help print long usage options
french: --help affiche les noms d'option longs

source: --version print version details
french: --version affiche les détails de version
italian: --version stampa i dettagli della versione

source: -U unam run utility program unam
french: -U unam lance l'utilitaire unam
italian: -U unam avvia il programma di utilit?? unam

source: -C use Cscore processing of scorefile
french: -C utilisation du traitement de partition Cscore
italian: -C usa il processamento di Cscore del scorefile

source: -j N use N threads in performance
french: -j N utiliser N threads pendant l'exécution
italian: -j N usa N threads per la perfomance

source: -I I-time only orch run
french: -I n'exécuter que la passe de temps-I de l'orchestre
italian: -I esecuzione dell'orchestra solo a I-time

source: -n no sound onto disk
french: -n pas de son vers le disque
italian: -n nessun audio su disco

source: -i fnam sound input filename
french: -i fnam nom du fichier son en entrée
italian: -i fnam nome del file audio in input

source: -o fnam sound output filename
french: -o fnam nom du fichier son en sortie
italian: -o fnam nome del file audio d'output

source: -b N sample frames (or -kprds) per software sound I/O buffer
french: -b N nombre de trames d'échantillonnage (ou -kprds) par tampon logiciel d'E/S

source: -B N samples per hardware sound I/O buffer
french: -B N nombre d'échantillons par tampon physique d'E/S

source: -A create an AIFF format output soundfile
french: -A création d'un fichier de sortie au format AIFF
italian: -A crea un formato AIFF per il file audio d'output

source: -W create a WAV format output soundfile
french: -W création d'un fichier de sortie au format WAV
italian: -W crea un formato WAV per il file audio d'output

source: -J create an IRCAM format output soundfile
french: -J création d'un fichier de sortie au format IRCAM
italian: -J crea un formato IRCAM per il file audio d'output

source: -h no header on output soundfile
french: -h pas d'en-tête dans le fichier de sortie
italian: -h nessun header sul file audio d'output

source: -c 8-bit signed_char sound samples
french: -c échantillons en caractères signés sur 8 bit

source: -a alaw sound samples
french: -a échantillons alaw

source: -8 8-bit unsigned_char sound samples
french: -8 échantillons en caractères non signés sur 8 bit

source: -u ulaw sound samples
french: -u échantillons ulaw

source: -s short_int sound samples
french: -s échantillons en entiers courts

source: -l long_int sound samples
french: -l échantillons en entiers longs

source: -f float sound samples
french: -f échantillons en nombres flottants

source: -3 24bit sound samples
french: -3 échantillons sur 24 bit

source: -r N orchestra srate override
french: -r N redéfinition du srate de l'orchestre
italian: -r N sovrascrive la srate dell'orchestra

source: -k N orchestra krate override
french: -k N redéfinition du krate de l'orchestre
italian: -k N sovrascrive la krate dell'orchestra

source: -K do not generate PEAK chunks
french: -K ne générer aucun bloc PEAK
italian: -K non generare i chunks PEAK

source: -v verbose orch translation
french: -v traduction détaillée de l'orchestre

source: -m N tty message level. Sum of:
french: -m N niveau de message du tty. Somme de :

source: 1=note amps, 2=out-of-range msg, 4=warnings
french: 1=amp des notes, 2=msg dépassement limites, 4=avertissements

source: 0/32/64/96=note amp format (raw,dB,colors)
french: 0/32/64/96=format d'amp de note (brut, dB, couleurs)

source: 128=print benchmark information
french: 128=affichage de tests de performance

source: -d suppress all displays
french: -d aucun affichage

source: -g suppress graphics, use ascii displays
french: -g pas de graphiques, affichage ascii

source: -G suppress graphics, use Postscript displays
french: -G pas de graphiques, affichage PostScript

source: -x fnam extract from score.srt using extract file 'fnam'
french: -x nomfic extraire les données de score.srt dans le fichier 'nomfic'

source: -t N use uninterpreted beats of the score, initially at tempo N
french: -t N utiliser les pulsations non interprétées de la partition, au tempo initial N

source: -t 0 use score.srt for sorted score rather than a temporary
french: -t 0 utiliser score.srt pour la partition triée au lieu d'un fichier temporaire

source: -L dnam read Line-oriented realtime score events from device 'dnam'
french: -L dnam Lire des évènements de partition en temps-réel à partir du périphérique d'entrée en ligne 'dnam'

source: -M dnam read MIDI realtime events from device 'dnam'
french: -M dnam lire des évènements MIDI en temps-réel à partir du périphérique 'dnam'

source: -F fnam read MIDIfile event stream from file 'fnam'
french: -F nomfic lire un flux d'évènements MIDI à partir du fichier 'nomfic'

source: -R continually rewrite header while writing soundfile (WAV/AIFF)
french: -R réécrire l'en-tête continuellement lors de l'écriture d'un fichier son (WAV/AIFF)

source: -H# print heartbeat style 1, 2 or 3 at each soundfile write
french: -H# affiche une pulsation de style 1, 2 ou 3 à chaque écriture dans le fichier son

source: -N notify (ring the bell) when score or miditrack is done
french: -N avertir (par un beep) quand la partition ou la piste MIDI est terminée

source: -T terminate the performance when miditrack is done
french: -T terminer l'exécution quand la fin du fichier MIDI est atteinte

source: -D defer GEN01 soundfile loads until performance time
french: -D différer le chargement de fichier son par GEN01 jusqu'au moment de l'exécution

source: -Q dnam select MIDI output device
french: -Q dnam sélectionner le périphérique de sortie MIDI
italian: -Q dnam seleziona il dispositivo MIDI d'output

source: -z list opcodes in this version
french: -z lister les opcodes de cette version

source: -Z dither output
french: -Z sortie avec dithering

source: --sched set real-time priority and lock memory
french: --sched fixer la priorité au temps-réel et verrouiller la mémoire

source: (requires -d and real time audio (-iadc/-odac))
french: (nécessite -d et l'audio en temps-réel (-iadc/-odac))

source: --sched=N set specified scheduling priority, and lock memory
french: --sched=N fixer une priorité spécifique, et verrouiller la mémoire

source: Set output file format
french: Fixer le format du fichier de sortie

source: --aiff set AIFF format
french: --aiff fixer le format AIFF

source: --au set AU format
french: --au fixer le format AU

source: --wave set WAV format
french: --wave fixer le format WAV

source: --ircam set IRCAM format
french: --ircam fixer le format IRCAM

source: --ogg set OGG/VORBIS format
french: --ogg fixer le format OGG/VORBIS

source: --noheader raw format
french: --noheader format brut

source: --nopeaks do not write peak information
french: --nopeaks ne pas écrire d'information de crête

source: --displays use graphic displays
french: --displays utilisation des affichages graphiques

source: --nodisplays suppress all displays
french: --nodisplays suppression de tout affichage

source: --asciidisplay suppress graphics, use ascii displays
french: --asciidisplay pas de graphiques, affichage ascii

source: --postscriptdisplay suppress graphics, use Postscript displays
french: --postscriptdisplay pas de graphiques, affichage PostScript

source: --defer-gen1 defer GEN01 soundfile loads until performance time
french: --defer-gen1 différer le chargement de fichier son par GEN01 jusqu'au moment de l'exécution

source: --iobufsamps=N sample frames (or -kprds) per software sound I/O buffer
french: --iobufsamps=N nombre de trames d'échantillon (ou -kprds) par tampon logiciel d'E/S

source: --hardwarebufsamps=N samples per hardware sound I/O buffer
french: --hardwarebufsamps=N nombre d'échantillons par tampon physique d'E/S

source: --cscore use Cscore processing of scorefile
french: --cscore traitement du fichier de partition par Cscore

source: --orc use orchfile without scorefile
french: --orc Utilisation d'un fichier orchestre sans partition

source: --midifile=FNAME read MIDIfile event stream from file
french: --midifile=FNAME lire un flot d'évènements MIDI depuis un fichier

source: --midioutfile=FNAME write MIDI output to file FNAME
french: --midioutfile=NOMFIC écrire la sortie MIDI dans le fichier NOMFIC

source: --midi-device=FNAME read MIDI realtime events from device
french: --midi-device=DNAME lire les évènements MIDI temps-réel depuis le périphérique

source: --terminate-on-midi terminate the performance when miditrack is done
french: --terminate-on-midi terminer l'exécution lorsque la fin de la piste MIDI est atteinte

source: --heartbeat=N print a heartbeat style 1, 2 or 3 at each soundfile write
french: --heartbeat=N affiche un battement de coeur de style 1, 2 ou 3 à chaque écriture dans le fichier son

source: --notify notify (ring the bell) when score or miditrack is done
french: --notify avertir (par un beep) quand la partition ou la piste MIDI est terminée

source: --rewrite continually rewrite header while writing soundfile (WAV/AIFF)
french: --rewrite réécrire l'en-tête continuellement lors de l'écriture d'un fichier son (WAV/AIFF)

source: --input=FNAME sound input filename
french: --input=FNAME nom du fichier son en entrée

source: --output=FNAME sound output filename
french: --output=FNAME nom du fichier son en sortie

source: --logfile=FNAME log output to file
french: --logfile=FNAME compte-rendu en sortie dans un fichier

source: --nosound no sound onto disk or device
french: --nosound pas de son en sortie disque ou périphérique

source: --tempo=N use uninterpreted beats of the score, initially at tempo N
french: --tempo=N utiliser les pulsations non interprétées de la partition, au tempo initial N

source: --i-only I-time only orch run
french: --i-only n'exécute que la passe de temps-I de l'orchestre

source: --syntax-check-only stop after checking orchestra and score syntax
french: --syntax-check-only arrêt après vérification de la syntaxe de l'orchestre et de la partition

source: --control-rate=N orchestra krate override
french: --control-rate=N redéfinition du krate de l'orchestre

source: --sample-rate=N orchestra srate override
french: --sample-rate=N redéfinition du srate de l'orchestre

source: --score-in=FNAME read line-oriented realtime score events from device
french: --score-in=DNAME lire des évènements de partition en temps-réel à partir du périphérique d'entrée en ligne
