Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: *** no callback for opening MIDI input
french: *** pas de fonction de rappel pour ouvrir l'entrée MIDI
italian: *** nessun callback per apertura dell'input MIDI

source: *** no callback for reading MIDI data
french: *** pas de fonction de rappel pour lire des données MIDI
italian: *** nessun callback per leggere i dati MIDI

source: *** error opening MIDI in device: %d (%s)
french: *** erreur d'ouverture MIDI dans le périphérique : %d (%s)
italian: *** errore in apertura del dispositivo MIDI in: %d (%s)

source: sustain count still %d
french: compte de sustain toujours à %d
italian: sustain conta ancora %d

source: midi channel %d now using instr %d
french: le canal midi %d utilise maintenant l'instr %d
italian: il canale midi %d ora usa lo strumento %d

source: unknown NPRN lsb %d
french: NPRN inconnu, lsb %d
italian: sconosciuto NPRN lsb %d

source: unknown drum param nos, msb %d lsb %d
french: numéro de param drum inconnu, msb %d, lsb %d
italian: parametri drum sconosciuti nos, msb %d lsb %d

source: CHAN %d DRUMKEY %d not in keylst, PARAM %d NOT UPDATED
french: CHAN %d DRUMKEY %d n'est pas dans la keylist, PARAM %d NON MIS A JOUR
italian: CHAN %d DRUMKEY %d non nella keylst, PARAM %d NON AGGIORNATO

source: ctrl %d has no exclus list
french: ctrl %d n'a pas de liste d'exclusion
italian: ctrl %d non ha nessuna lista d'esclusione

source: chnl mode msg %d not implemented
french: chnl mode msg %d non implémenté
italian: chnl mode msg %d non implementato

source: unrecognised sys_common type %d
french: type sys_common %d non reconnu
italian: tipo di sys_common non riconosciuto %d

source: unrecognised message type %d
french: type de message %d non reconnu
italian: tipo di messaggio non riconosciuto %d

source: midi channel %d using instr %d
french: le canal midi %d utilise l'instr %d

source: midi channel %d is muted
french: le canal midi %d est muet
italian: il canale midi %d ?? silenziato

source: MIDI channel %d muted
french: le canal MIDI %d est muet
italian: canale MIDI %d silenziato

source: unknown instr
french: instr inconnu
italian: strumento sconosciuto

source: chnl %d using instr %d
french: chnl %d utilisant l'instr %d
italian: il canale %d usa lo strumento %d

source: *** error reading MIDI device: %d (%s)
french: *** erreur de lecture MIDI sur le périphérique : %d (%s)
italian: *** errore in lettura del dispositivo MIDI: %d (%s)

source: undefined sys-realtime msg %x
french: msg sys temps réel %x non défini
italian: messaggio sys-realtime non definito %x

source: undefined sys_common msg %x
french: msg sys_common %x non défini
italian: messaggio sys_common non definito %x

source: port: %d exceeds max number of ports %d, mapping to port 0
french: port : %d dépasse le nombre max de ports %d, mappé au port 0

source: No MIDI
french: Pas de MIDI

source: Error closing MIDI in device: %d (%s)
french: Erreur en fermant le périphérique d'entrée MIDI : %d (%s)
italian: Errore in chiusura del dispositivo MIDI in: %d (%s)

source: Error closing MIDI out device: %d (%s)
french: Erreur en fermant le périphérique de sortie MIDI : %d (%s)
italian: Errore in chiusura del dispositivo MIDI out: %d (%s)

source: *** no callback for opening MIDI output
french: *** pas de fonction de rappel pour ouvrir la sortie MIDI
italian: *** nessun callback per apertura dell'output MIDI

source: *** no callback for writing MIDI data
french: *** pas de fonction de rappel pour écrire des données MIDI
italian: *** nessun callback per la scrittura dei dati MIDI

source: *** error opening MIDI out device: %d (%s)
french: *** erreur en ouvrant le périphérique de sortie MIDI : %d (%s)
italian: *** errore in apertura del dispositivo MIDI out: %d (%s)

source: *** error opening MIDI out file '%s'
french: *** erreur en ouvrant le fichier de sortie MIDI '%s'
italian: *** errore in apertura del file MIDI out '%s'

source: Short write in MIDI
french: Ecriture d'entiers courts sur le MIDI
italian: Breve scrittura in MIDI

source: error closing MIDI output file
french: erreur en fermant le fichier de sortie MIDI
italian: errore chiusura file MIDI di output

source: *** error initialising PortMIDI
french: *** erreur à l'initialisation de PortMIDI
italian: *** errore in inizializzazione PortMIDI

source: *** error initialising PortTime
french: *** erreur à l'initialisation de PortTime
italian: *** errore in inizializzazione PortTime

source: error: must specify a device number (>=0), 'a' for all (merged), or 'm' for port mapped, not a name
french: erreur : il faut un numéro de périphérique (>=0) ou 'a' pour tous (fusion), ou 'm' pour un port mappé, pas un nom

source: error: device number is out of range
french: erreur : numéro de périphérique hors limites
italian: errore: numero del dispositivo fuori range

source: no input devices are available
french: aucun périphérique d'entrée n'est disponible
italian: nessun dispositivo di input disponibile

source: PortMIDI: Activated input device %d: '%s' (%s)
french: PortMIDI : périphérique d'entrée sélectionné %d : '%s' (%s)
italian: PortMIDI: attivato il dispositivo di input %d: '%s' (%s)

source: Device mapped to channels %d to %d
french: Périphérique mappé aux canaux %d à %d

source: PortMIDI: Activated input device %d: '%s'
french: PortMIDI : périphérique d'entrée sélectionné %d: '%s'
italian: PortMIDI: attivato il dispositivo di input %d: '%s'

source: error opening input device %d: %s
french: erreur en ouvrant le périphérique %d : %s
italian: errore in apertura del dispositivo di input %d: %s

source: no output devices are available
french: aucun périphérique de sortie n'est disponible
italian: nessun dispositivo di output disponibile

source: error: must specify a device number (>=0), not a name
french: erreur : il faut spécifier un numéro de périphérique (>=0), pas un nom
italian: errore: si deve specificare un numero di dispositivo (>=0), non un nome

source: PortMIDI: selected output device %d: '%s' (%s)
french: PortMIDI : périphérique de sortie sélectionné %d : '%s' (%s)
italian: PortMIDI: selezionato il dispositivo di output %d: '%s' (%s)

source: PortMIDI: selected output device %d: '%s'
french: PortMIDI : périphérique de sortie sélectionné %d : '%s'
italian: PortMIDI: selezionato il dispositivo di output %d: '%s'

source: error opening output device %d: %s
french: erreur en ouvrant le périphérique de sortie %d : %s
italian: errore in apertura del dispositivo di output %d: %s

source: error polling input device
french: erreur lors de l'élection du périphérique d'entrée
italian: errore nella raccolta di informazioni sul dispositivo di input

source: buffer overflow in MIDI input
french: dépassement de tampon dans l'entrée MIDI
italian: buffer overflow nell'input MIDI

source: read error %d
french: erreur de lecture %d
italian: errore di lettura %d

source: invalid MIDI out data
french: données de sortie MIDI non valides
italian: dati MIDI out non validi

source: MIDI out: system message 0x%02X is not supported
french: MIDI out : le message système 0x%02X n'est pas supporté
italian: MIDI out: messaggio di sistema 0x%02X non ?? supportato

source: MIDI out: truncated message
french: MIDI out : message tronqué
italian: MIDI out: messaggio troncato

source: MIDI out: error writing message
french: MIDI out : erreur en écrivant un message
italian: MIDI out: errore scrittura messaggio

source: error closing input device
french: erreur en fermant le périphérique d'entrée
italian: errore chiusura disositivo di input

source: error closing output device
french: erreur en fermant le périphérique de sortie
italian: errore chiusura disositivo di output

source: rtmidi: PortMIDI module enabled
french: rtmidi : module PortMIDI activé
italian: rtmidi: PortMIDI modulo abilitato

source: --scheduler: invalid priority value; the allowed range is:
french: --scheduler: valeur de priorité non valide ; l'intervalle autorisé est :
italian: --scheduler: valore di priorit?? non valido; il range permesso ??:

source: -20 to -1: set nice level
french: -20 à -1 : fixe le 'nice level'
italian: -20 to -1: imposta un buon livello

source: 0: normal scheduling, but lock memory
french: 0 : ordonnancement normal, mais verrouillage mémoire
italian: 0: scheduling normale, ma blocca la memoria

source: 1 to %d: SCHED_RR with the specified priority (DANGEROUS)
french: 1 to %d : SCHED_RR avec la priorité spécifiée (DANGEREUX)
italian: 1 to %d: SCHED_RR con la specificata priorit?? (PERICOLOSO)

source: csound: cannot set scheduling policy to SCHED_RR
french: csound : impossible de fixer la politique de partage à SCHED_RR
italian: csound: non posso impostare la linea di condotta della pianificazione (scheduling) in SCHED_RR

source: csound: setting scheduling policy to SCHED_RR
french: csound : politique de partage fixée à SCHED_RR
italian: csound: impostazione la linea di condotta della pianificazione (scheduling) in SCHED_RR

source: csound: cannot set nice level to %d
french: csound : impossible de fixer le niveau de nice à %d
italian: csound: non riesco ad impostare un buon livello a %d

source: *** Cannot open device '%s' for audio output: %s
french: *** Impossible d'ouvrir le périphérique '%s' pour la sortie audio : %s
italian: *** Impossibile aprire il dispositivo '%s' per output audio: %s

source: *** Cannot open device '%s' for audio input: %s
french: *** Impossible d'ouvrir le périphérique '%s' pour l'entrée audio : %s
italian: *** Impossibile aprire il dispositivo '%s' per input audio: %s

source: No real-time audio configurations found
french: Configuration audio temps réel introuvable
italian: Nessuna configurazione trovata per audio in tempo reale

source: Could not retrieve max number of channels
french: Impossible de retrouver le nombre max de canaux
italian: Non posso recuperare il numero massimo di canali

source: Error setting access type for soundcard
french: Erreur lors du réglage du type d'accès à la carte son
italian: Errore nell'impostazione del tipo di accesso alla soundcard

source: Unknown sample format. *** Only 16-bit and 32-bit integers, and 32-bit floats are supported.
french: Format d'échantillon inconnu. *** Seuls les entiers sur 16 et 32 bit et les flottants sur 32 bit sont supportés.
italian: Formato campione sconosciuto. *** Sono supportati solo 16-bit e 32-bit interi, e 32-bit floats.

source: Unable to set requested sample format on soundcard
french: Impossible de fixer le format d'échantillon demandé sur la carte son
italian: Non posso impostare il formato campione richiesto sulla soundcard

source: Unable to set number of channels on soundcard
french: Impossible de fixer le nombre de canaux sur la carte son
italian: Non posso impostare il numero di canali sulla soundcard

source: Unable to set sample rate on soundcard
french: Impossible de fixer le taux d'échantillonnage sur la carte son
italian: Non posso impostare la frequenza di campionamento sulla soundcard

source: *** rate set to %d
french: *** taux fixé à %d
italian: *** frequenza impostata a %d

source: ALSA: -B %d not allowed on this device; using %d instead
french: ALSA : -B %d interdit sur ce périphérique ; utiliser plutôt %d
italian: ALSA: -B %d non ?? permesso su questo dispositivo; usare %d invece

source: ALSA: -b %d not allowed on this device; using %d instead
french: ALSA : -b %d interdit sur ce périphérique ; utiliser plutôt %d
italian: ALSA: -b %d non ?? permesso su questo dispositivo; usare %d invece

source: Error setting hardware parameters for real-time audio
french: Erreur de réglage des paramètres logiciels pour l'audio en temps réel
italian: Errore nell'impostazione dei parametri hardware per audio in tempo reale

source: ALSA %s: total buffer size: %d, period size: %d
french: ALSA %s : taille de tampon totale : %d, taille de la période : %d
italian: ALSA %s: dimensione totale del buffer: %d, dimensione del periodo: %d

source: Error setting software parameters for real-time audio
french: Erreur de réglage des paramètres logiciels pour l'audio en temps réel
italian: Errore nell'impostazione dei parametri software per audio in tempo reale

source: Memory allocation failure
french: Echec de l'allocation mémoire
italian: Allocazione di memoria fallita

source: *** ALSA: must specify a device name, not a number (e.g. -odac:hw:0,0)
french: *** ALSA : il faut spécifier un nom de périphérique, pas un numéro (ex. -odac:hw:0,0)
italian: *** ALSA: si deve specificare un nome di dispositivo, non un numero (es. -odac:hw:0,0)

source: *** ALSA: %s: memory allocation failure
french: *** ALSA : %s : échec de l'allocation mémoire
italian: *** ALSA: %s: allocazione di memoria fallita

source: Buffer overrun in real-time audio input
french: Saturation du tampon dans l'entrée audio en temps réel
italian: Buffer overrun nell'input audio in tempo reale

source: Real-time audio input suspended
french: Entrée audio en temps réel suspendue
italian: Input audio in tempo reale sospeso

source: Error reading data from audio input device
french: Erreur en lisant des données sur le périphérique d'entrée audio
italian: Errore in lettura dati dal dispositivo di input audio

source: Buffer underrun in real-time audio output
french: Déficit de remplissage du tampon sur la sortie audio en temps réel
italian: Buffer underrun nell'output audio in tempo reale

source: Real-time audio output suspended
french: Sortie audio en temps réel suspendue
italian: Output audio in tempo reale sospeso

source: Error writing data to audio output device
french: Erreur en écrivant des données sur la sortie audio
italian: Errore in scrittura dati sul dispositivo di output audio

source: ALSA MIDI: memory allocation failure
french: ALSA MIDI : échec de l'allocation mémoire
italian: ALSA MIDI: allocazione di memoria fallita

source: ALSA: error opening MIDI input device: '%s'
french: ALSA : erreur en ouvrant le périphérique d'entrée MIDI : '%s'
italian: ALSA: errore in apertura del dispositivo di input MIDI: '%s'

source: ALSA: opened MIDI input device '%s'
french: ALSA : périphérique d'entrée MIDI '%s' ouvert
italian: ALSA: aperto il dispositivo di input MIDI '%s'

source: ALSA midi: no string
french: ALSA midi : aucune chaîne de caractères
italian: ALSA midi: nessuna stringa

source: ALSA midi: Using all devices.
french: ALSA midi : utilisation de tous les périphériques.
italian: ALSA midi: uso di tutti i dispositivi.

source: ALSA midi: Error opening device: %s
french: ALSA midi : erreur en ouvrant le périphérique : %s
italian: ALSA midi: errore in apertura del dispositivo: %s

source: ALSA midi: No devices found.
french: ALSA midi : aucun périphérique trouvé.
italian: ALSA midi: nessun dispositivo trovato.

source: ALSA: error opening MIDI output device '%s'
french: ALSA : erreur en ouvrant le périphérique de sortie MIDI : '%s'
italian: ALSA: errore in apertura del dispositivo di output MIDI: '%s'

source: ALSA: opened MIDI output device '%s'
french: ALSA : périphérique de sortie MIDI '%s' ouvert
italian: ALSA: aperto il dispositivo di output MIDI '%s'

source: -M stdin fcntl failed
french: -M stdin fcntl a échoué
italian: -M stdin fcntl fallito

source: cannot open %s
french: impossible d'ouvrir %s
italian: Impossibile aprire %s

source: MIDI receive: cannot get termios info.
french: MIDI receive : impossible d'obtenir l'information de termios
italian: MIDI receive: impossibile ottenere termios info.

source: MIDI receive: cannot set input baud rate.
french: MIDI receive : impossible de règler le taux d'entrée en baud
italian: MIDI receive: impossibile impostare input baud rate.

source: MIDI receive: cannot set termios.
french: MIDI receive : impossible de règler termios.
italian: MIDI receive: impossibile settare termios.

source: Opened MIDI input device file '%s'
french: Le fichier '%s' est ouvert comme source d'entrée MIDI
italian: Apertura del file del dispositivo di input MIDI '%s'

source: sensMIDI: retval errno %d
french: sensMIDI : retval erreur numéro %d

source: Error opening MIDI output device file '%s'
french: Erreur en ouvrant le fichier '%s' comme destination de la sortie MIDI
italian: Errore in apertura del file del dispositivo di output MIDI '%s'

source: Opened MIDI output device file '%s'
french: Le fichier '%s' est ouvert comme destination de la sortie MIDI
italian: Apertura del file del dispositivo di output MIDI '%s'

source: ALSASEQ: connection failed %s %s (%s)
french: ALSASEQ : la connexion %s %s (%s) a échoué
italian: ALSASEQ: fallita connessione %s %s (%s)

source: ALSASEQ: connected %s %d:%d
french: ALSASEQ : connecté %s %d:%d
italian: ALSASEQ: connesso %s %d:%d

source: ALSASEQ: connection failed %s %s, port %d (%s)
french: ALSASEQ : connexion échouée %s %s, port %d (%s)
italian: ALSASEQ: connessione fallita %s %s, porta %d (%s)

source: ALSASEQ input: memory allocation failure
french: entrée ALSASEQ : échec de l'allocation mémoire
italian: ALSASEQ input: allocazione di memoria fallita

source: ALSASEQ: error opening sequencer (%s)
french: ALSASEQ : erreur en ouvrant le périphérique (%s)
italian: ALSASEQ: errore in apertura del sequencer (%s)

source: ALSASEQ: opened MIDI input sequencer
french: ALSASEQ : entrée MIDI du séquenceur ouverte
italian: ALSASEQ: aperto l'input del sequencer MIDI

source: ALSASEQ: cannot set client name '%s' (%s)
french: ALSASEQ : impossible de fixer le nom du client '%s' (%s)
italian: ALSASEQ: non riesco a impostare il nome del cliente '%s' (%s)

source: ALSASEQ: cannot create input port (%s)
french: ALSASEQ : impossible de créer le port d'entrée (%s)
italian: ALSASEQ: non riesco a creare la porta di input (%s)

source: ALSASEQ: created input port '%s' %d:%d
french: ALSASEQ : impossible de créer le port d'entrée '%s' %d:%d
italian: ALSASEQ: non riesco a creare la porta di input '%s' %d:%d

source: ALSASEQ: cannot create midi event (%s)
french: ALSASEQ : impossible de créer l'évènement midi (%s)
italian: ALSASEQ: non riesco a creare l'evento midi (%s)

source: ALSASEQ output: memory allocation failure
french: sortie ALSASEQ : échec de l'allocation mémoire
italian: ALSASEQ output: allocazione di memoria fallita

source: ALSASEQ: opened MIDI output sequencer
french: ALSASEQ : sortie MIDI du séquenceur ouverte
italian: ALSASEQ: aperto l'output del sequencer MIDI

source: ALSASEQ: cannot create output port (%s)
french: ALSASEQ : impossible de créer le port de sortie (%s)
italian: ALSASEQ: non riesco a creare la porta d'output (%s)

source: ALSASEQ: created output port '%s' %d:%d
french: ALSASEQ : port de sortie '%s' %d:%d créé
italian: ALSASEQ: creata la porta d'output '%s' %d:%d

source: warning... could not create global var
french: avertissement... impossible de créer une variable globale
italian: attenzione... non riesco a creare global var

source: RT scheduler priority, alsa module
french: priorité de l'organisation TR, module alsa
italian: priorit?? RT scheduler, modulo alsa

source: ALSASEQ client name (default: Csound)
french: nom de client ALSASEQ (Csound par défaut)
italian: ALSASEQ nome del cliente (default: Csound)

source: ALSA real-time audio and MIDI module for Csound by Istvan Varga
french: Modules ALSA audio en temps réel et MIDI pour Csound par Istvan Varga
italian: ALSA real-time audio e modulo MIDI per Csound di Istvan Varga

source: cannot determine card number: %s
french: Impossible de déterminer le numéro de carte : %s
italian: non riesco a determinare il numero della card: %s

source: no sound card found
french: aucune carte son
italian: nessuna sound card trovata

source: cannot open control for card %d: %s
french: impossible d'ouvrir un contrôle pour la carte %d: %s
italian: non riesco ad aprire il controllo della card %d: %s

source: cannot determine device number: %s
french: impossible de déterminer le numéro de périphérique : %s
italian: riesco a determinare il numero del dispositivo: %s

source: cannot get rawmidi information %d:%d:%d: %s
french: impossible de lire l'information rawmidi %d:%d:%d %s
italian: riesco a ottenere le informazioni rawmidi %d:%d:%d: %s

source: cannot open sequencer
french: impossible d'ouvrir le séquenceur

source: rtalsa: Wrong callback.
french: rtalsa : mauvaise fonction de rappel
italian: rtalsa: Callback sbagliato.

source: rtaudio: ALSA module enabled
french: rtaudio : module ALSA activé
italian: rtaudio: modulo ALSA abilitato

source: rtmidi: ALSA Raw MIDI module enabled
french: rtmiDi : module ALSA Raw MIDI activé
italian: rtmidi: modulo ALSA Raw MIDI abilitato

source: rtmidi: ALSASEQ module enabled
french: rtmidi : module ALSASEQ activé
italian: rtmidi: modulo ALSASEQ abilitato

source: rtmidi: devfile module enabled
french: rtmidi : module devfile activé
italian: rtmidi: modulo devfile abilitato

source: AuHAL Module: found %d input device(s):
french: Module AuHAL : %d périphérique(s) d'entrée trouvé(s) :
italian: Modulo AuHAL: trovato %d dispositivo/i di input:

source: AuHAL Module: found %d output device(s):
french: Module AuHAL : %d périphérique(s) de sortie trouvé(s) :
italian: Modulo AuHAL: trovato %d dispositivo/i di output:

source: %d: %s (%d channels)
french: %d: %s (%d canaux)
italian: %d: %s (%d canali)

source: requested device %d out of range
french: Le périphérique requis %d est hors limites
italian: dispositivo richiesto %d fuori range

source: requested device %d (%s) out of range
french: Le périphérique requis %d (%s) est hors limites
italian: dispositivo richiesto %d (%s) fuori intervallo

source: *** CoreAudio: Device has not enough inputs (%d, requested %d)
french: *** CoreAudio : le périphérique n'a pas assez d'entrées (%d, %d requises)

source: *** CoreAudio: Device has not enough outputs (%d, requested %d)
french: *** CoreAudio : le périphérique n'a pas assez de sorties (%d, %d requises)

source: selected input device: %s
french: périphérique d'entrée sélectionné : %s
italian: dispositivo d'input selezionato: %s

source: selected output device: %s
french: périphérique de sortie sélectionné : %s
italian: dispositivo d'output selezionato: %s

source: Attempted to set device SR, tried %.1f, got %.1f
french: Réglage du SR du périphérique, %.1f essayé, %.1f obtenu
italian: Tentativo di impostare la SR del dispositivo, provato %.1f, ottenuto %.1f

source: ***** AuHAL module: output device open with %d buffer frames
french: ***** module AuHAL : périphérique de sortie ouvert avec %d trames de tampon
italian: ***** modulo AuHAL: dispositivo d'output aperto con %d buffer frames

source: ***** AuHAL module: input device open with %d buffer frames
french: ***** module AuHAL : périphérique d'entrée ouvert avec %d trames de tampon
italian: ***** modulo AuHAL: dispositivo d'input aperto con %d buffer frames

source: AuHAL module: device closed
french: Module AuHAL : périphérique fermé
italian: modulo AuHAL: dispositivo chiuso

source: rtaudio: coreaaudio-AuHAL module enabled
french: rtaudio : module AuHAL activé
italian: rtaudio: modulo coreaaudio-AuHAL abilitato

source: buffer mismatch! source %d <> dest %ld
french: tampons non assortis ! source %d <> dest %ld

source: Haiku real-time audio and MIDI module for Csound by Pete Goodeve
french: Module Haiku audio en temps réel et MIDI pour Csound par Pete Goodeve

source: rtaudio: Haiku module enabled
french: rtaudio : module Haiku activé

source: rtmidi: Haiku module enabled
french: rtmidi : module Haiku activé

source: *** WARNING: disabling --sched in freewheel mode
french: *** AVERTISSEMENT : désactivation de --sched dans le mode freewheel

source: memory allocation failure
french: échec de l'allocation mémoire
italian: allocazione di memoria fallita

source: error registering input ports
french: erreur à l'enregistrement des ports d'entrée
italian: errore registrazione delle porte di input

source: error registering output ports
french: erreur à l'enregistrement des ports de sortie
italian: errore registrazione delle porte di output
