Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: ** Warning ** PostScript file %s cannot be opened
french: ** Avertissement ** Impossible d'ouvrir le fichier PostScript %s
italian: ** Attenzione ** il file PostScript %s non pu?? essere aperto

source: PostScript graphs written to file %s
french: Graphiques PostScript écrits dans le fichier %s
italian: PostScript graphs scritto sul file %s

source: %s: widget opcodes have been disabled by the host application
french: %s : les opcodes de widget ont été désactivés par l'application hôte

source: widgets.cpp: error allocating FLTK flags
french: widgets.cpp : erreur lors de l'allocation des options de FLTK

source: %s %ld points, scalemax %5.3f
french: %s %ld points, échelle max %5.3f
italian: %s %ld punti, scalemax %5.3f

source: xyin opcode has been deprecated in Csound6.
french: l'opcode xyin est devenu obsolète dans Csound6
italian: l'opcode xyin ?? obsoleto in Csound6.

source: displays suppressed
french: les affichages ont été supprimés
italian: displays soppressi

source: graphics %s, ascii substituted
french: graphiques %s, remplacés par une sortie ascii
italian: grafica %s, sostituzione ascii

source: suppressed
french: supprimé
italian: soppresso

source: not supported on this terminal
french: pas supporté sur ce terminal
italian: non supportato su questo terminale

source: Cannot be more In arguments than Out in init (%d,%d)
french: Il ne peut y avoir plus d'arguments In que Out dans init (%d,%d)
italian: Non possono esserci pi?? argomenti In che Out in init (%d,%d)

source: Division by zero
french: Division par zéro
italian: Divisione per zero

source: non-looping sample
french: son échantillonné sans boucle
italian: il campione non ha loop

source: No tuning table %d
french: Pas de table d'accordage %d
italian: Nessuna tavola per intonazione %d

source: cpstun: invalid table
french: cpstun : table non valide
italian: cpstun: tavola non valida

source: Input channel %d too large; ignored
french: Canal d'entrée %d trop grand ; ignoré

source: Input channel %d is invalid; ignored
french: Canal d'entrée %d non valide ; ignoré
italian: canale d'input %d non valido; ignorato

source: Input and output argument count differs in inch
french: Les nombres d'arguments d'entrée et de sortie différent dans inch
italian: Il conto degli argomenti di input e output sono differenti in inch

source: Input channel %d too large; ignored
french: Canal d'entrée %d trop grand ; ignoré
italian: canale d'input %d troppo grande; ignorato

source: Channel greater than nchnls
french: Canal supérieur à nchnls
italian: Canale maggiore di nchnls

source: Excess channels ignored
french: Canaux en excès ignorés
italian: Canali in eccesso ignorati

source: out: number of channels truncated from %d to %d
french: out: nombre de canaux tronqué de %d à %d
italian: out: numero di canali troncato da %d a %d

source: outch must have an even number of arguments
french: outch doit avoir un nombre pair d'arguments

source: Unknown function called
french: Appel de fonction inconnue
italian: Chiamata una funzione sconosciuta

source: number of arguments != nchnls
french: nombre d'arguments != nchnls
italian: numero di argomenti != nchnls

source: outrg: channel number cannot be < 1 (1 is the first channel)
french: outrg : le numéro de canal ne peut pas être < 1 (1 est le premier canal)
italian: outrg: il numero di canale non pu?? essere < 1 (1 ?? il primo canale)

source: number of hardware output channels not currently available
french: nombre de canaux matériels en sortie non disponible
italian: il numero di canali hardware d'output non ?? attualmente disponibile

source: number of hardware input channels not currently available
french: nombre de canaux matériels en entrée non disponible
italian: il numero di canali hardware d'input non ?? attualmente disponibile

source: chani: invalid index
french: chani : index non valide
italian: chani: indice non valido

source: chani error %d:channel not found or not right type
french: chani erreur %d : canal introuvable ou type non conforme
italian: errore chani %d:canale non trovato o del tipo sbagliato

source: chano error %d:channel not found or not right type
french: chano erreur %d : canal introuvable ou type non conforme
italian: errore chano %d:canale non trovato o del tipo sbagliato

source: pvsin: invalid index
french: pvsin : index non valide
italian: pvsin: indice non valido

source: pvsin error %d:channel not found or not right type
french: pvsin erreur %d : canal introuvable ou type non conforme
italian: errore pvsin %d:canale non trovato o del tipo sbagliato

source: pvsout: invalid index
french: pvsout : index non valide
italian: pvsout: indice non valido

source: pvsout error %d:channel not found or not right type
french: pvsout erreur %d : canal intouvable ou type non conforme
italian: errore pvsout %d:canale non trovato o del tipo sbagliato

source: invalid channel name:
french: nom de canal non valide : %d

source: "empty"
french: "vide"

source: invalid mode parameter
french: paramètre de mode non valide
italian: parametro mode non valido

source: invalid channel parameters
french: paramètres de canal non valides
italian: parametro channel non valido

source: invalid mode, should be r, w, rw
french: mode non valide, doit être r, w, rw

source: channel already exists
french: le canal existe déjà
italian: il canale ?? gia esistente

source: invalid export variable
french: variable d'export non valide
italian: variabile esportata non valida

source: read failure in sensekey
french: échec de la lecture dans sensekey
italian: lettura fallita in sensekey

source: sensekey error:
french: erreur de sensekey :
italian: errore sensekey:

source: InputChannelCallback not set.
french: InputChannelCallback non défini
italian: InputChannelCallback non impostato.

source: OutputChannelCallback not set.
french: OutputChannelCallback non défini
italian: OutputChannelCallback non impostato.

source: NaN in pow
french: NaN dans pow

source: Seeding from current time %u
french: Graine à partir de l'horloge %u
italian: Seme dal tempo attuale %u

source: Seeding with %u
french: Graine à partir de %u
italian: Seme da %u

source: compileorc: could not open %s
french: compileorc : impossible d'ouvrir %s
italian: compileorc: non riesco ad aprire %s

source: compileorc: could not read %s
french: compileorc : impossible de lire %s
italian: compileorc: non riesco a leggere %s

source: diskin2: invalid number of channels
french: diskin2 : nombre de canaux non valide
italian: diskin2: numero di canali non valido

source: diskin2: unknown sample format
french: diskin2 : format d'échantillon inconnu
italian: diskin2: formato campione sconosciuto

source: diskin2: %s: failed to open file (%s)
french: diskin2 : %s : l'ouverture du fichier (%s) a échoué
italian: diskin2: %s: fallita apertura del file (%s)

source: diskin2: number of output args inconsistent with number of file channels
french: diskin2 : le nombre d'arguments en sortie est en contradiction avec le nombre de canaux du fichier
italian: diskin2: numero di argomenti d'output inconsistente con il numero di canali del file

source: diskin2: warning: file sample rate (%d) != orchestra sr (%d)
french: diskin2 : avertissement: taux d'échantillonnage (%d) du fichier != sr (%d) de l'orchestre
italian: diskin2: attenzione: sample rate del file (%d) != orchestra sr (%d)

source: diskin2: opened (asynchronously)
french: diskin2 : ouvert (en asynchrone)
italian: diskin2: aperto (asincronicamente)

source: sample frames
french: trames d'échantillons

source: diskin2: opened
french: diskin2 : ouvert
italian: diskin2: aperto

source: diskin2: not initialised
french: diskin2 : non initialisé
italian: diskin2: non inizializzato

source: diskin2: file descriptor closed or invalid
french: diskin2 : descripteur de fichier fermé ou non valide
italian: diskin2: descrittore del file chiuso o non valido

source: %s is deprecated; use fout instead
french: %s est obsolète ; utiliser plutôt fout
italian: %s ?? obsoleto; usate fout invece

source: %s: invalid sample format: %d
french: %s : format d'échantillon non valide : %d
italian: %s: formato campione non valido: %d

source: %s cannot open %s
french: %s ne peut pas ouvrir %s
italian: %s non riesco ad aprire %s

source: %s: opening RAW outfile %s
french: %s : ouverture du fichier RAW %s en sortie
italian: %s: apertura RAW outfile %s

source: soundout: not initialised
french: soundout : non initialisé
italian: soundout: non inizializzato

source: soundouts: not initialised
french: soundouts : non initialisé
italian: soundouts: non inizializzato

source: diskin2: %s: failed to open file: %s
french: diskin2 : %s : échec de l'ouverture du fichier : %s
italian: diskin2: %s: fallita apertura del file: %s

source: soundin: invalid number of channels
french: soundin : nombre de canaux non valide
italian: soundin: numero di canali non valido

source: soundin: unknown sample format
french: soundin : format d'échantillon inconnu
italian: soundin: formato campione sconosciuto

source: soundin: %s: failed to open file: %s
french: soundin : %s : échec de l'ouverture du fichier : %s
italian: soundin: %s: fallita apertura del file: %s

source: soundin: %s: failed to open file
french: soundin : %s : l'ouverture du fichier a échoué
italian: soundin: %s: fallita apertura del file

source: soundin: opened '%s': %d Hz, %d channel(s), %ld sample frames
french: soundin: '%s' ouvert : %d Hz, %d voix, %ld trames d'échantillons
italian: soundin: aperto '%s': %d Hz, %d canale/i, %ld sample frames

source: soundin: number of output args inconsistent with number of file channels
french: soundin : le nombre d'arguments en sortie est en contradiction avec le nombre de canaux du fichier
italian: soundin: numero di argomenti d'output inconsistente con il numero di canali del file

source: soundin: file sample rate (%d) != orchestra sr (%d)
french: soundin : taux d'échantillonnage (%d) != sr (%d) de l'orchestre

source: soundin: not initialised
french: soundin : non initialisé
italian: soundin: non inizializzato

source: instr %d, pvs-signal %s:
french: instr %d, signal pvs %s :

source: display
french: affichage

source: illegal iprd in display
french: iprd illégal dans l'affichage
italian: illegale iprd in display

source: display: not initialised
french: affichage : non initialisé
italian: display: non inizializzato

source: too many points requested (%d)
french: trop de points demandés (%d)

source: too few points requested (%d), minimum is %d
french: pas assez de points demandés (%d), le minimum est %d

source: window size must be power of two
french: la taille de la fenêtre doit être une puissance de deux
italian: la dimensione della window deve essere una potenza di due

source: illegal iprd in ffy display
french: iprd illégal dans l'affichage de ffy
italian: illegale iprd in ffy display

source: fft
french: tfr

source: dispfft: not initialised
french: dispfft : non initialisé
italian: dispfft: non inizializzato

source: illegal iperiod
french: iperiod illégal
italian: illegale iperiod

source: illegal idisprd
french: idisprd illégal
italian: illegale idisprd

source: illegal itweek
french: itweek illégal
italian: illegale itweek

source: illegal imindur
french: imindur illégal
italian: illegale imindur

source: illegal imemdur
french: imemdur illégal
italian: illegale imemdur

source: illegal ihtim
french: ihtim illégal
italian: illegale ihtim

source: illegal startempo
french: startempo illégal
italian: illegale startempo

source: ifn table begins with zero
french: la table ifn commence par zéro
italian: tavola ifn inizia con zero

source: tempest: not initialised
french: tempest : non initialisé
italian: tempest: non inizializzato

source: unknown format request
french: le format demandé est inconnu
italian: formato richiesto sconosciuto

source: alaw and ulaw not implemented here
french: alaw et ulaw ne sont pas implémentés
italian: alaw e ulaw qui non sono implementati

source: unknown kdump format
french: format kdump inconnu
italian: formato kdump sconosciuto

source: write failure in dumpk
french: erreur d'écriture dans dumpk
italian: scrittura fallita in dumpk

source: Read failure in readks
french: Echec de la lecture dans readks
italian: Lettura fallita in readks

source: *** fftlib.c: internal error: invalid FFT size: %d
french: *** fftlib.x : erreur interne : taille de TFR non valide : %d
italian: *** fftlib.c: errore interno: dimensione FFT non valida: %d

source: negative time period
french: durée négative
italian: time period negativo

source: turnoff2: invalid instrument number
french: turnoff2 : numéro d'instrument non valide
italian: turnoff2: numero di strumento non valido

source: turnoff2: invalid mode parameter
french: turnoff2 : paramètre de mode non valide
italian: turnoff2: parametro mode non valido

source: turnoff3: invalid instrument number
french: turnoff3 : numéro d'instrument non valide

source: function table %d not found
french: table de fonction %d non trouvée

source: illegal reson iscl value, %f
french: valeur illégale de iscl dans reson, %f
italian: valore di iscl di reson illegale , %f

source: uneven ctrl pairs
french: paires de ctrl en nombre impair
italian: coppie dei ctrl spaiate

source: illegal ctrl no
french: no de ctrl illégal
italian: ctrl no illegale

source: Value out of range [0,127]
french: valeur hors limites [0..127]

source: cpstabm: invalid modulator table
french: cpstabm : table de modulateur non valide
italian: cpstabm: tavola del modulatore non valida

source: illegal controller number
french: numéro de contrôleur illégal
italian: numero controller illegale

source: pgmassign: invalid program number
french: pgmassign : numéro de programme non valide
italian: pgmassign: numero programma non valido

source: Invalid arp mode selected: %d. Valid modes are 0, 1, 2, and 3
french: Mode arp sélectionné non valide: %d. Les modes autorisés sont 0, 1, 2 et 3
italian: selezionato modo arp non valido: %d. Modi validi sono 0, 1, 2, e 3

source: ctrlpreset: failed to allocate globals
french: ctrlpreset : échec de l'allocation des variables globales

source: Failed to allocate presets
french: L'allocation des préréglages a échoué

source: No presets stored
french: Aucun préréglage stocké

source: No such preset %d
french: Pas de préréglage %d

source: illegal mrtmsg argument
french: argument de mrtmsg illégal
italian: argomento mrtmsg illegale

source: error - fft parameter n has more than 15 factors : %d
french: erreur - le paramètre n de tfr a plus de 15 facteurs : %d
italian: errore - fft parametro n ha pi?? di 15 fattori : %d

source: csoundRealFFTnp2(): invalid FFT size, %d
french: csoundRealFFTnp2() : taille de TFR non valide, %d
italian: csoundRealFFTnp2(): dimensione FFT non valida, %d

source: csoundInverseRealFFTnp2(): invalid FFT size
french: csoundInverseRealFFTnp2() : taille de TFR non valide
italian: csoundInverseRealFFTnp2(): dimensione FFT non valida

source: csoundRealFFTnp2(): invalid FFT size
french: csoundRealFFTnp2() : taille de TFR non valide
italian: csoundRealFFTnp2(): dimensione FFT non valida

source: tablexkt: not initialised
french: tablexkt : non initialisé
italian: tablexkt: non inizializzato

source: Sliding version not yet available
french: La version glissante n'est pas encore disponible
italian: Versione sliding non ancora disponibile

source: pvadsyn: bad value for inoscs
french: pvadsyn : mauvaise valeur de inoscs
italian: pvadsyn: pessimo valore per inoscs

source: pvadsyn: format must be amp-freq (0).
french: pvadsyn : le format doit être amp-fréq (0).
italian: pvadsyn: il formato deve essere amp-freq (0).

source: pvsadsyn: ibin parameter out of range.
french: pvsadsyn : le paramètre ibin est hors limites.
italian: pvsadsyn: parametro ibin fuori intervallo.

source: pvsadsyn: ibin + inoscs too large.
french: pvsadsyn : la somme ibin + inoscs est trop grande.
italian: pvsadsyn: ibin + inoscs troppo grande.

source: pvsadsyn: ibin + (inoscs * ibinoffset) too large.
french: pvsadsyn : l'expression ibin + (inoscs * ibinoffset) est trop grande
italian: pvsadsyn: ibin + (inoscs * ibinoffset) troppo grande.

source: pvsynth: Not initialised.
french: pvsynth : non initialisé.
italian: pvsynth: non inizializzato.

source: pvscross: source and dest signals must have same format
french: pvscross : les signaux source et destination doivent avoir le même format
italian: pvscross: i segnali di source e dest devono avere lo stesso formato

source: pvscross: not initialised
french: pvscross : non initialisé
italian: pvscross: non inizializzato

source: pvscross: mismatch in fsrc format
french: pvscross : disparités dans le format de fsrc
italian: pvscross: discrepanza nel formato fsrc

source: pvscross: mismatch in fdest format
french: pvscross : disparités dans le format de fdest
italian: pvscross: discrepanza nel formato fdest

source: pvsfread: file is empty!
french: pvsfread : le fichier est vide !
italian: pvsfread: file vuoto!

source: pvsfread: file has only one frame (= impulse response).
french: pvsfread : le fichier n'a qu'une trame (= réponse impulsionnelle).
italian: pvsfread: il file ha solo un frame (= impulse response).

source: pvsfread: analysis frame overlap must be >= ksmps
french: pvsfread : le chevauchement des trames d'analyse doit être >= ksmps
italian: pvsfread: analysis frame overlap deve essere >= ksmps

source: pvsfread: ichan value exceeds file channel count.
french: pvsfread : la valeur de ichan dépasse le nombre de canaux.
italian: pvsfread: il valore di ichan eccede il conto dei canali del file.

source: pvsfread: ichan cannot be negative.
french: pvsfread : ichan ne peut pas être négatif.
italian: pvsfread: ichan non pu?? essere negativo.

source: pvsfread: not initialised.
french: pvsfread : non initialisé.
italian: pvsfread: non inizializzato.

source: pvsmaska: signal format must be amp-phase or amp-freq.
french: pvsmaska : le format du signal doit être amp-phase ou amp-fréq.
italian: pvsmaska: il formato del segnale deve essere amp-phase o amp-freq.

source: pvsmaska: ftable too small.
french: pvsmaska : ftable trop petite.
italian: pvsmaska: ftable troppo piccola.

source: pvsmaska: not initialised
french: pvsmaska : non initialisé
italian: pvsmaska: non inizializzato

source: pvsmaska: negative value for kdepth; clipped to zero.
french: pvsmaska : valeur de kdepth négative ; ramenée à zéro.
italian: pvsmaska: valore negativo per kdepth; troncato a zero.

source: pvsmaska: kdepth > 1: clipped.
french: pvsmaska : kdepth > 1 : limité.
italian: pvsmaska: kdepth > 1: troncato.

source: pvsftw: signal format must be amp-phase or amp-freq.
french: pvsftw : le format du signal doit être amp-phase ou amp-fréq.
italian: pvsftw: il formato del segnale deve essere amp-phase o amp-freq.

source: pvsftw: bad value for ifna.
french: pvsftw : mauvaise valeur de ifna.
italian: pvsftw: pessimo valore per ifna.

source: pvsftw: bad value for ifnf.
french: pvsftw : mauvaise valeur de ifnf.
italian: pvsftw: pessimo valore per ifnf.

source: pvsftw: amps ftable too small.
french: pvsftw : la ftable des amps est trop petite.
italian: pvsftw: amps ftable troppo piccola.

source: pvsftw: freqs ftable too small.
french: pvsftw : la ftable des fréqs est trop petite.
italian: pvsftw: freqs ftable troppo piccola.

source: pvsftw: not initialised
french: pvsftw : non initialisé
italian: pvsftw: non inizializzato

source: pvsftw: no amps ftable!
french: pvsftw : pas de ftable d'amps !
italian: pvsftw: nessuna amps ftable!

source: pvsftw: no freqs ftable!
french: pvsftw : pas de ftable de fréqs !
italian: pvsftw: nessuna freqs ftable!

source: pvsftr: signal format must be amp-phase or amp-freq.
french: pvsftr : le format du signal doit être amp-phase ou amp-fréq.
italian: pvsftr: il formato del segnale deve essere amp-phase o amp-freq.

source: pvsftr: bad value for ifna.
french: pvsftr : mauvaise valeur de ifna.
italian: pvsftr: pessimo valore per ifna.

source: pvsftr: bad value for ifnf.
french: pvsftr : mauvaise valeur de ifnf.
italian: pvsftr: pessimo valore per ifnf.

source: pvsftr: amps ftable too small.
french: pvsftr : ftable d'amps trop petite.
italian: pvsftr: amps ftable troppo piccola.

source: pvsftr: freqs ftable too small.
french: pvsftr : ftable des fréqs trop petite.
italian: pvsftr: freqs ftable troppo piccola.

source: pvsftr: not initialised
french: pvsftr : non initialisé
italian: pvsftr: non inizializzato

source: pvsys: (no error)
french: pvsys : (pas d'erreur)
italian: pvsys: (nessun errore)

source: pvsys: unknown error
french: pvsys : erreur inconnue
italian: pvsys: errore sconosciuto

source: pvsys: already initialised
french: pvsys : déjà initialisé
italian: pvsys: gi?? inizializzato

source: pvsys: bad arguments
french: pvsys : mauvais arguments
italian: pvsys: pessimi argomenti

source: pvsys: bad format parameter
french: pvsys : mauvais paramètre de format
italian: pvsys: pessimo parametro del formato

source: pvsys: bad window type
french: pvsys : type de fenêtre non valide
italian: pvsys: pessimo tipo di finestra (window)

source: pvsys: too many files open
french: pvsys : trop de fichiers ouverts
italian: pvsys: troppi files aperti

source: pvsys: unable to create file
french: pvsys : impossible de créer le fichier
italian: pvsys: non riesco a creare il file

source: pvsys: Internal error: NULL data arrays
french: pvsys : erreur interne : tableaux de données NULL
italian: pvsys: errore interno: array dati NULLO

source: pvsys: unable to open file
french: pvsys : impossible d'ouvrir le fichier
italian: pvsys: non riesco ad aprire il file

source: pvsys: error reading Source format data
french: pvsys : erreur en lisant les données du format Source
italian: pvsys: errore lettura formato dati Source

source: pvsys: not a WAVE_EX file
french: pvsys : ce n'est pas un fichier WAVE_EX
italian: pvsys: non ?? un file WAVE_EX

source: pvsys: bad size for fmt chunk
french: pvsys : mauvaise taille pour le bloc fmt
italian: pvsys: pessima dimensione di fmt chunk

source: pvsys: error reading Extended format data
french: pvsys : erreur en lisant les données du format Etendu
italian: pvsys: errore lettura formato dati Extended

source: pvsys: not a PVOC-EX file
french: pvsys : ce n'est pas un fichier PVOC-EX
italian: pvsys: non ?? un file PVOC-EX

source: pvsys: error reading Extended pvoc format data
french: pvsys : erreur en lisant les données du format pvoc Etendu
italian: pvsys: errore lettura formato dati Extended pvoc

source: pvsys: unknown pvocex Version
french: pvsys : Version de pvocex inconnue
italian: pvsys: versione pvocex sconosciuta

source: pvsys: error reading header
french: pvsys : erreur en lisant l'en-tête
italian: pvsys: errore lettura header

source: pvsys: not a RIFF file
french: pvsys : ce n'est pas un fichier RIFF
italian: pvsys: non ?? un file RIFF

source: pvsys: file too small
french: pvsys : fichier trop petit
italian: pvsys: file troppo piccolo

source: pvsys: not a WAVE file
french: pvsys : ce n'est pas un fichier WAV
italian: pvsys: non ?? un file WAVE

source: pvsys: error reading format chunk
french: pvsys : erreur en lisant le bloc de format
italian: pvsys: errore lettura formato chunk

source: pvsys: PVXW chunk found before fmt chunk.
french: pvsys : le bloc PVXW a été trouvé avant le bloc fmt
italian: pvsys: trovato PVXW chunk prima del fmt chunk.

source: pvsys: PVXW chunk found but custom window not specified
french: pvsys : le bloc PVXW a été trouvé mais la fenêtre personnalisée n'a pas été spécifiée
italian: pvsys: chunk PVXW trovato ma non ?? specificata la window custom

source: pvsys: error reading window data.
french: pvsys : erreur en lisant les données de la fenêtre
italian: pvsys: errore lettura dati window.

source: pvsys: bad RIFF file
french: pvsys : mauvais fichier RIFF
italian: pvsys: pessimo RIFF file
