Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: csound_fd_close: no record of fd %p
french: fdclose : pas d'enregistrement de fd %p

source: auxlist for instr %s [%d] (%p):
french: auxlist pour l'instr %s [%d] (%p) :
italian: auxlist per strumento %s [%d] (%p):

source: auxlist for instr %d (%p):
french: auxlist pour l'instr %d (%p) :
italian: auxlist per strumento %d (%p):

source: auxch at %p: size %zu, auxp %p, endp %p
french: auxch à %p : taille %zu, auxp %p, endp %p
italian: auxch a %p: dimensione %zu, auxp %p, endp %p

source: fdlist for instr %s [%d] (%p):
french: fdlist pour l'instr %s [%d] (%p) :
italian: fdlist per strumento %s [%d] (%p):

source: fdlist for instr %d (%p):
french: fdlist pour l'instr %d (%p) :
italian: fdlist per strumento %d (%p):

source: fd %p in %p
french: fd %p dans %p

source: (no error)
french: (Pas d'erreur)
italian: (nessun errore)

source: invalid variable name
french: nom de variable non valide
italian: nome di variabile non valido

source: invalid variable type
french: type de variable non valide
italian: tipo di variabile non valido

source: invalid flags specified
french: options non valides spécifiées
italian: opzione (flag) non valida

source: NULL pointer argument
french: argument pointeur NULL
italian: argomento del puntatore NULL

source: the specified value is too high
french: la valeur spécifiée est trop haute
italian: il valore specificato ?? troppo alto

source: the specified value is too low
french: la valeur spécifiée est trop basse
italian: il valore specificato ?? troppo basso

source: the specified value is not an integer power of two
french: la valeur spécifiée n'est pas une puissance entirère de deux
italian: il valore specificato non ?? un intero potenza di due

source: invalid boolean value; must be 0 or 1
french: valeur booléenne non valide : doit être 0 ou 1
italian: valore booleano non valido; deve essere 0 oppure 1

source: memory allocation failed
french: échec de l'allocation mémoire
italian: allocazione di memoria fallita

source: string exceeds maximum allowed length
french: la chaîne dépasse la longueur maximale autorisée
italian: la lunghezza della stringa supera il valore permesso

source: (unknown error)
french: (erreur inconnue)
italian: (errore sconosciuto)

source: Out of Memory
french: Pas assez de mémoire
italian: memoria insufficiente

source: Null file name in copy_to_corefile
french: Nom de fichier nul dans copy_to_corefile
italian: Nome di file nullo in copy_to_corefile

source: not enough memory (realloc returned NULL)
french: pas assez de mémoire (realloc a retourné NULL)
italian: memoria insufficiente (realloc restituisce NULL)

source: curl_easy_perform() failed: %s
french: échec de curl_easy_perform() : %s
italian: curl_easy_perform() fallita: %s

source: Failed to find semantic information for instrument '%i'
french: Impossible de trouver l'information sémantique pour l'instrument '%i'
italian: Fallita ricerca dell'informazione semantica per lo strumento '%i'

source: Invalid NULL Parameter barrier
french: Paramètre barrier NULL non valide
italian: Barriera con parametro NULL non valido

source: Invalid Parameter thread_count must be > 0
french: Paramètre non valide, thread_count doit être > 0
italian: Parametro non valido thread_count deve essere > 0

source: Failed to allocate barrier
french: L'allocation de barrier a échoué
italian: fallita allocazione della barriera

source: Failed to allocate set
french: L'allocation de set a échoué
italian: fallita allocazione set

source: Invalid NULL Parameter set
french: Paramètre set NULL non valide
italian: Parametro set NULL non valido

source: Invalid Parameter set not a set
french: Paramètre non valide, set n'est pas un ensemble
italian: Invalido Parameter set non e' un set

source: Invalid NULL Parameter data
french: Paramètre data NULL non valide
italian: Parametro data NULL non valido

source: Failed to allocate set element
french: Echec de l'allocation d'un élément de set.
italian: Fallita allocazione dell'elemento del set

source: Invalid NULL Parameter set_element
french: Paramètre set_element NULL non valide
italian: Parametro set_element NULL non valido

source: Invalid NULL parameter set to add to global read, write lists
french: Paramètre NULL non valide pour ajouter à une liste de lecture, écriture globale
italian: Impostato parametro NULL non valido da aggiungere alle liste di lettura, scrittura

source: Add a global write_list without any instruments
french: Ajout d'une liste d'écriture globale sans instruments
italian: Aggiunta una write_list globale senza nessun strumento

source: Invalid NULL parameter set to add to a global write_list
french: Paramètre NULL non valide pour ajouter à une liste de lecture globale
italian: impostato parametro NULL non valido da aggiungere alla write_list globale

source: Invalid NULL parameter set to add to a global read_list
french: Paramètre NULL non valide pour ajouter à une liste de lecture globale
italian: impostato parametro NULL non valido da aggiungere alla read_list globale

source: opcode %s deprecated
french: l'opcode %s est obsolète

source: Not a proper list of ints
french: N'est pas une liste d'ints correcte

source: unterminated string found on line %d >>%s<<
french: chaîne de caractères non close trouvée ligne %d >>%s<<
italian: stringa non terminata trovata alla linea %d >>%s<<

source: No number following instr
french: Aucun numéro ne suit instr
italian: instr non ?? seguito da nessun numero

source: ERROR: Unmatched bracket found in arrayargument type specification
french: ERREUR : crochet non apparié dans la spécification du type d'argument de tableau
italian: ERRORE: Parentesi non bilanciate nel tipo specificato di arrayargument

source: create_opcode: No rule to handle statement of type %d
french: create_opcode : aucune règle pour traiter une instruction de type %d
italian: create_opcode: Non c'?? regola d'uso per dichiarazione di tipo %d

source: %s invalid sample rate
french: %s taux d'échantillonnage non valide
italian: %s frequenza di campionamento (sr) non valida

source: %s invalid control rate
french: %s taux de contrôle non valide
italian: %s frequenza dei segnali di controllo (kr) non valida

source: %s invalid number of samples
french: %s nombre d'échantillons non valide
italian: %s numero di campioni non valido

source: %s invalid ksmps value, needs to be integral.
french: %s valeur de ksmps non valide, doit être entière.

source: %s inconsistent sr, kr, ksmps
french: %s sr, kr, ksmps contradictoires
italian: %s sr, kr e ksmps sono incongruenti

source: bad value for 0dbfs: must be positive. Setting default value.
french: mauvaise valeur pour 0dbfs : elle doit être positive. Valeur par défaut.

source: resetting orc parameters to: sr = %.7g, kr = %.7g, ksmps = %u
french: réinitialiasation des paramètres d'orc à : sr = %.7g, kr = %.7g, ksmps = %u

source: %s inconsistent sr, kr, ksmps
french: %s sr, kr, ksmps contradictoires
italian: %s sr, kr e ksmps sono incongruenti

source: sample rate overrides: esr = %7.4f, ekr = %7.4f, ksmps = %d
french: redéfinition des taux d'échantillonnage : esr = %7.4f, ekr = %7.4f, ksmps = %d
italian: frequenza di campionamento (sr) ridefinita: esr = %7.4f, ekr = %7.4f, ksmps = %d

source: system constants can only be set once
french: les constantes du système ne peuvent être fixées qu'une fois
italian: le costanti di sistema possono essere impostate una sola volta

source: create_instrument: instr num %<PRIi32>
french: create_instrument : numéro d'instrument %<PRIi32>
italian: create_instrument: strumento num %<PRIi32>

source: -- deleted instr from deadpool
french: -- instr supprimé de deadpool
italian: -- strumento cancellato da deadpool

source: -- free instr def %p %p
french: -- déf libre d'instr %p %p
italian: -- libero instr def %p %p

source: -- added to deadpool slot %d
french: -- ajout du slot %d au deadpool
italian: -- aggiunto allo slot di deadpool %d

source: named instr %<PRIi32> redefined, replacing previous definition
french: instr nommé %<PRIi32> redéfini, précédente définition remplacée

source: no active instances
french: pas d'instances actives
italian: nessuna istanza attiva

source: instr %s uses instrument number %d
french: l'instr %s utilise le numéro d'instrument %d
italian: lo strumento %s usa il numero di strumento %d

source: instr %d redefined
french: instr %d redéfini
italian: strumento %d ridefinito

source: instr %<PRIi32> redefined, replacing previous definition
french: instr %<PRIi32> redéfini, précédente définition remplacée
italian: strumento %<PRIi32> ridefinito, rimpiazzo la precedente definizione

source: no active instances of instr %d
french: aucune instance active de l'instr %d
italian: nessuna istanza attiva dello strumento %d

source: !!! csound->opcodeInfo is NULL !!!
french: !!! csound->opcodeInfo est NULL !!!
italian: !!! csound->opcodeInfo e' NULL !!!

source: merging %p %d) %s:%s
french: fusion de %p %d) %s : %s
italian: unione di %p %d) %s:%s

source: adding %p %d) %s:%s
french: ajout de %p %d) %s : %s
italian: aggiungo %p %d) %s:%s

source: merging instr %d
french: fusion de l'instr %d
italian: unione instr %d

source: merging named instr %s
french: fusion de l'instr nommé %s

source: invalid name for instrument
french: nom d'instrument non valide
italian: nome dello strumento non valido

source: ERROR: Could not find OPCODINFO for opname: %s
french: ERREUR : impossible de trouver l'OPCODINFO pour : %s
italian: ERRORE: non trovo OPCODINFO per l'opname: %s

source: Unknown TREE node of type %d (%s) found in root.
french: Noeud inconnu de type %d (%s) trouvé à la racine.
italian: Nodo sconosciuto di tipo %d (%s) trovato in root.

source: %d syntax errors in orchestra. compilation invalid
french: %d erreurs de syntaxe dans l'orchestre. Compilation non valide
italian: %d errori di sintassi nell'orchestra. Compilazione non valida

source: %s: perf-time code in global space, ignored
french: %s : code d'exécution dans l'espace global, ignoré
italian: %s: codice perf-time nello spazio globale, ignorato

source: Missing local arg: %s
french: Argument local manquant : %s
italian: manca un argomento locale: %s

source: **unrecorded**
french: **non enregistré**
italian: **non registrato**

source: Opcode "%s" is deprecated
french: L'opcode "%s" est obsolète
italian: L'opcode "%s" e' deprecato

source: Unbanced rates in conditional expression
french: Taux discordants dans l'expression conditionnelle

source: error: function %s not found, line %d
french: erreur : fonction %s introuvable, ligne %d
italian: errore: non trovo la funzione %s alla linea %d

source: error: opcode %s with output type %s not found, line %d
french: erreur : opcode %s sans type de retour %s introuvable, ligne %d
italian: errore: opcode %s con tipo output %s non trovato, alla linea %d

source: ERROR: Neither if-goto or if-then found on line %d!!!
french: ERREUR : ni if-goto ni if-then n'ont été trouvés ligne %d !!!
italian: ERRORE: Non trovo if-goto o if-then alla linea %d!!!

source: Unknown function type found: %d [%c]
french: Type de fonction inconnue détecté : %d [%c]
italian: trovato tipo di funzione sconosciuto: %d [%c]

source: Unknown boolean expression type found: %d
french: Type d'expression booléenne inconnue détecté : %d
italian: Tipo di espressione booleana sconosciuta: %d

source: unable to find array operator for types %s line %d
french: impossible de trouver un opérateur de tableau pour les types '%s ligne %d

source: non-boolean expression found for ternary operator, line %d
french: expression non-booléenne détectée dans un opérateur ternaire, ligne %d
italian: trovata espressione non booleana per l'operatore ternario, alla linea %d

source: unable to find ternary operator for types '%s ? %s : %s' line %d
french: impossible de trouver un opérateur ternaire pour les types '%s ? %s : %s' ligne %d
italian: non trovo l'operatore ternario per i tipi '%s ? %s : %s' alla linea %d

source: Use of i() with array element ill formed
french: Mauvaise utilisation de i() avec un élément de tableau

source: Use of i() with expression not permitted on line %d
french: L'utilisation de i() dans une expression est interdite, ligne %d
italian: Uso di i() in espressione non permesso alla linea %d

source: error: opcode '%s' for expression with arg types %s not found, line %d
french: erreur : opcode '%s' dans l'expression avec types d'arg %s introuvable, ligne %d
italian: errore: opcode '%s' per l'espressione con tipi di argomento %s non trovata, alla linea %d

source: Unable to verify arg types for expression '%s' Line %d
french: Vérification des types d'arg impossible pour l'expression '%s' Ligne %d
italian: Non riesco a verificare i tipi di arg per l'espressione '%s' Alla linea %d

source: Unable to verify arg types for boolean expression '%s' Line %d
french: Impossible de vérifier les types d'arg dans l'expression booléenne'%s' Ligne %d
italian: Non sono in grado di verificare i tipi di arg per l'espressione booleana '%s' Linea %d

source: error: boolean expression '%s' with arg types %s not found, line %d
french: erreur : expression booléenne '%s' avec types d'arg %s introuvable, ligne %d
italian: errore: espressione booleana '%s' con tipi di arg %s non trovata, alla linea %d

source: Variable '%s' used before defined Line %d
french: Variable '%s' utilisée avant d'être définie Lige %d
italian: Variabile '%s' usata prima di essere definita Alla linea %d

source: Array of unknown type
french: Tableau de type inconnu

source: Line: %d
french: Ligne : %d
italian: Linea: %d

source: Unknown arg type: %d
french: Type d'arg inconnu : %d
italian: tipo di argomento sconosciuto: %d

source: Found %d inputs for %s which is more than the %d allowed
french: %d entrées trouvées pour %s ce qui dépasse les %d autorisées

source: Variable type for %s could not be determined.
french: Impossible de déterminer le type de la variable %s.
italian: Tipo di variabile per %s non pu?? essere determinata.

source: Variable '%s' used before defined line %d
french: Variable '%s' utilisée avant d'être définie Ligne %d
italian: Variabile '%s' usata prima di essere definita all linea %d

source: Unable to find opcode with name: %s
french: Opcode nommé %s introuvable
italian: Non trovo l'opcode con nome: %s

source: Unable to find opcode entry for '%s' with matching argument types:
french: Aucune entrée pour l'opcode '%s' avec les types d'argument correspondants :
italian: Non trovo l'opcode per '%s' che combaci con il tipo di argomenti:

source: Found: %s %s %s
french: Trouvé : %s %s %s

source: expression for until/while statement not a boolean expression, line %d
french: l'expression de l'instruction until/while n'est pas booléenne, ligne %d
italian: l'espressione per dichiarazione until/while non ?? un'espressione booleana, alla linea %d

source: Multiple xin statements found. Only one is allowed.
french: Plusieurs instructions xin trouvées. Une seule est permise.
italian: Trovate pi?? dichiarazioni xin. Ne ?? permessa solo una.

source: Multiple xout statements found. Only one is allowed.
french: Plusieurs instructions xout trouvées. Une seule est permise.
italian: Trovate pi?? dichiarazioni xout. Ne ?? permessa solo una.

source: invalid xin statement for UDO: defined '%s', found '%s'
french: instruction xin non valide pour un UDO : '%s' défini, '%s' trouvé
italian: dichiarazione xin nell'UDO non valida: definita '%s', trovo '%s'

source: invalid xout statement for UDO: defined '%s', found '%s'
french: instruction xout non valide pour un UDO : '%s' défini, '%s' trouvé
italian: dichiarazione xout nell'UDO non valida: definita '%s', trovo '%s'

source: error: %s (token "%s")
french: erreur : %s (symbole "%s")

source: line %d: >>>
french: ligne %d : >>>

source: from file %s (%d)
french: depuis le fichier %s (%d)

source: insufficient required arguments for opcode %s on line %d:
french: arguments requis manquants pour l'opcode %s ligne %d :
italian: gli argomenti richiesti sono insufficienti per opcode %s alla linea %d:

source: Undefined macro: '%s'
french: Macro non définie : '%s'
italian: macro non definita: '%s'

source: Memory exhausted
french: Plus de mémoire
italian: Memoria finita

source: macros/include nested too deep:
french: Imbrication des macros/include trop profonde
italian: macros/include innestate troppo in profondit??:

source: Too few arguments to macro
french: Trop peu d'arguments pour la macro
italian: Pochi argomenti alla macro

source: Missing argument terminator %.98s
french: Le terminateur d'argument est manquant %.98s
italian: Manca argomento conclusivo %.98s

source: unexpected EOF!
french: EOF inattendu !
italian: inaspettato EOF!

source: Unexpected character %c(%.2x) line %d
french: Caractère %c(%.2x) inattendu, ligne %d
italian: Carattere inatteso %c(%.2x) alla linea %d

source: #else without #if
french: #else sans #if
italian: #else senza #if

source: #else after #else
french: #else après un #else
italian: #else dopo #else

source: Unmatched #end
french: #end non apparié
italian: #end senza corrispondenza

source: Ill formed #include ignored
french: #include incorrect ignoré
italian: Ignorato #include non conforme

source: Includes nested too deeply
french: Imbrication des boucles trop profonde
italian: inclusioni (include) innestate troppo in profondit??

source: %s is a directory; not including
french: %s est un répertoire ; pas inclus
italian: %s ?? una directory; non la includo

source: Cannot open #include'd file %s
french: Impossible d'ouvrir le fichier inclus (#include) %s
italian: Impossibile aprire il file #include %s

source: macro error
french: erreur de macro
italian: errore macro

source: define macro runaway
french: define de macro disparu
italian: definizione macro fuori controllo

source: define macro unexpected character %c(0x%.2x) awaiting #
french: caractère %c(0x%.2x) inattendu dans define de macro à la place de #
italian: carattere inaspettato %c(0x%.2x) nella definizione macro, in attesa #

source: define macro with args: unexpected EOF
french: define de macro avec args : EOF inattendu
italian: definizione della macro con argomenti: inaspettato EOF

source: define macro: unexpected EOF
french: define de macro : EOF inattendu
italian: definizione macro: inaspettato EOF

source: macro %s undefined
french: la macro %s n'est pas définie
italian: macro %s non definita

source: Undefining undefined macro
french: Libération de la macro non définie
italian: Libero la macro non definita

source: Unmatched #if%sdef
french: #if%sdef non apparié
italian: #if%sdef senza corrispondenza

source: Macro definition for %*s
french: Définition de macro pour %*s
italian: Definizione di macro per %*s

source: Invalid macro name for --omacro
french: Nom de macro non valide pour --omacro
italian: Nome di macro non valido per --omacro

source: Loops are nested too deeply
french: Imbrication des boucles trop profonde
italian: Loops eccessivamente innestati

source: {: invalid repeat count
french: {: nombre de répétitions non valide
italian: {: conteggio delle ripetizioni non valido

source: %s Nested LOOP=%d Level:%d
french: %s BOUCLE imbriquée=%d, Niveau : %d
italian: %s LOOP innestato=%d Livello:%d

source: External LOOP=%d Level:%d
french: BOUCLE externe=%d, Niveau : %d
italian: LOOP esterno=%d Livello:%d

source: unmatched } in score
french: } non apparié dans la partition
italian: } senza corrispondenza nella score

source: r: invalid repeat count %d
french: r : nombre de répétitions non valide %d
italian: r: conteggio delle ripetizioni non valido %d

source: define macro unexpected character %c(0x%.2x)awaiting #
french: caractère %c(0x%.2x) inattendu dans define de macro à la place de #
italian: definizione macro carattere inaspettato %c(0x%.2x)in attesa #

source: Invalid macro name for --smacro
french: Nom de macro non valide pour --smacro
italian: Nome di macro non valido per --smacro

source: illegal placement of operator %c in [] expression
french: placement illégal de l'opérateur %c dans l'expression []
italian: piazzamento illecito dell'operatore %c in espressione []

source: illegal placement of '(' in [] expression
french: placement illégal de '(' dans l'expression []
italian: piazzamento illecito di '(' in espressione []

source: missing operand before ')' in [] expression
french: il manque un opérande avant ')' dans l'expression []
italian: manca l'operando dopo ')' in espressione []

source: illegal placement of '[' in [] expression
french: placement illégal de '[' dans l'expression []
italian: piazzamento illecito di '[' in espressione []

source: missing operand before closing bracket in []
french: il manque un opérande avant le crochet fermant dans []
italian: manca l'operando dopo la chiusura della parentesi in []

source: illegal character %c(%.2x) in [] expression
french: caractère %c(%.2x) illégal dans l'expression []
italian: carattere illecito %c(%.2x) in espressione []

source: unexpected EOF!!
french: EOF inattendu !!
italian: inatteso EOF!!

source: cannot create variable %s: NULL type
french: impossible de créer la variable %s : type NULL
italian: non posso creare la variabile %s: tipo NULL

source: Environment variable '%s' has been set to
french: La variable d'environnement '%s' a été fixée à
italian: La variabile d'ambiente '%s' ?? stata fissata a

source: *** invalid format for --env
french: *** format invalide pour --env
italian: *** formato non valido per --env

source: *** invalid environment variable name
french: *** nom de variable d'environnement non valide
italian: *** nome di variabile d'ambiente non valido

source: *** memory allocation failure
french: *** échec de l'allocation mémoire
italian: *** allocazione di memoria fallita

source: *** error setting environment variable
french: *** erreur en fixant une variable d'environnment
italian: *** errore impostazione variabile d'ambiente

source: Creating search path cache for '%s':
french: Création du cache de chemin de recherche pour '%s' :
italian: Creata cache del percorso di ricerca per '%s':

source: Current directory path name too long
french: Le nom du chemin du répertoire courant est trop long
italian: Nome del percorso della directory corrente troppo lungo

source: Remove failed
french: Echec de la suppression

source: internal error: csoundFileOpen(): invalid type: %d
french: erreur interne : csoundFileOpen() : type non valide : %d
italian: errore interno: csoundFileOpen(): tipo non valido: %d

source: After open failure(%s) will try to open %s as raw
french: Après échec de l'ouverture (%s) essai d'ouverture de %s en format brut
italian: Dopo la fallita apertura(%s) provo ad apriere %s come raw

source: Failed to open %s: %s
french: Echec de l'ouverture de %s : %s
italian: Fallita apertura di %s: %s

source: internal error: csoundCreateFileHandle(): invalid type: %d
french: erreur interne : csoundCreateFileHandle() : type non valide : %d
italian: errore interno: csoundCreateFileHandle(): tipo non valido: %d

source: instrument number out of range
french: numéro d'instrument hors limites
italian: Numero dello strumento fuori intervallo

source: unknown GEN number
french: numéro de GEN inconnu
italian: numero di GEN sconosciuto

source: ftable does not exist
french: la ftable n'existe pas
italian: ftable non esiste

source: ftable %d now deleted
french: la ftable %d est maintenant supprimée
italian: la ftable %d viene cancellata

source: insufficient gen arguments
french: nombre d'arguments de GEN insuffisant
italian: gli argomenti della gen sono insufficienti

source: Named gen "%s" not defined
french: Le GEN nommé "%s" n'est pas défini
italian: gen chiamata "%s" non definita

source: illegal gen number
french: numéro de GEN interdit
italian: numero di gen non consentito

source: deferred size for GENs 1, 2, 23, 28 or 49 only
french: taille différée seulement pour GENs 1, 2, 23, 28 et 49
italian: dimensione differita solo per GENs 1, 2, 23, 28 o 49
