Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: harm signal has positive lead
french: le signal de l'harmonizer a une conduite positive
italian: segnale harm ha direzione positiva

source: harm signal has negative lead
french: le signal de l'harmonizer a une conduite négative
italian: segnale harm ha direzione negativa

source: harmon234: out of range
french: harmon234 : hors limites
italian: harmon234: fuori intervallo

source: hdf5write: Error, first argument does not appear to be a string, exiting
french: hdf5write : erreur, le premier argument doit être une chaîne de caractères, abandon

source: hdf5write: Error, unable to identify type of argument %d
french: hdf5write : erreur, impossible d'identifier le type de l'argument %d

source: This should not happen, exiting
french: Ceci ne devrait pas arriver, abandon

source: hdf5read: Error, more input arguments than output arguments, exiting
french: hdf5read : erreur, plus d'arguments en entrée qu'en sortie, abandon

source: hdf5read: Error, more output arguments than input arguments, exiting
french: hdf5read : erreur, plus d'arguments en sortie qu'en entrée, abandon

source: hdf5read: Error, input argument %d does not appear to be a string, exiting
french: hdf5read : erreur, l'arg d'entrée %d n'est pas une chaîne de caractères, abandon

source: hdf5read: Error, input argument %d type is unknown, exiting
french: hdf5read : erreur, l'arg d'entrée %d est de type inconnu, abandon

source: hdf5read: Error, output argument %d appears to be a string, exiting
french: hdf5read : erreur, l'arg de sortie %d est une chaîne de caractères, abandon

source: hdf5read: Error, output argument %d type is unknown, exiting
french: hdf5read : erreur, l'arg de sortie %d est de type inconnu, abandon

source: hdf5read: Error, dataset does not exist or cannot be found in file
french: hdf5read : erreur, ensemble de données inexistant ou introuvable dans le fichier

source: hdf5read: Unable to read saved type of dataset, exiting
french: hdf5read : erreur, impossible de lire le type de l'ensemble de données, abandon

source: WARNING!!: Orchestra SR not compatible with HRTF processing SR of: %.0f
french: AVERTISSEMENT !! : SR de l'orchestre incompatible avec le SR du traitement HRTF de : %.0f
italian: ATTENZIONE!!: La SR dell'orchestra non ?? compatibile con la SR elaborata da HRTF di: %.0f

source: Cannot load left data file, exiting
french: impossible de charger le fichier des données de gauche, abandon
italian: Non posso leggere i dati di sinistra del file, esco

source: Cannot load right data file, exiting
french: impossible de charger le fichier des données de droite, abandon
italian: Non posso leggere i dati di destra del file, esco

source: WARNING: fades are overlapping: this could lead to noise: reduce fade size or change trajectory, fade = %d, cross=%d
french: AVERTISSEMENT : les fondus se chevauchent : ceci peut provoquer du bruit : réduisez la taille des fondus ou changez la trajectoire, fade = %d, cross=%d

source: Orchestra sampling rate is not compatible with HRTF. Should be %d...exiting.
french: Le taux d'échantillonnage de l'orchestre n'est pas compatible avec HRTF. Il devrait valoir %d... fin du traitement.
italian: La frequenza di campionamento dell'orchestra non ?? compatibile con HRTF. Dovrebbe essere %d...esco.

source: Last argument must be the string 'HRTFcompact' ...correcting.
french: Le dernier argument doit être la chaîne 'HRTFcompact' ... correction.
italian: L'ultimo argomento deve essere la stringa 'HRTFcompact' ...correggo.

source: hrtfer: not initialised
french: hrtfer : non initialisé
italian: hrtfer: non inizializzato

source: WARNING: fades are overlapping: this could lead to noise: reduce fade size or change trajectory
french: AVERTISSEMENT : les fondus se chevauchent : ceci peut provoquer du bruit : réduisez la taille des fondus ou changez la trajectoire
italian: ATTENZIONE: i fades si sovrappongono: questo pu?? portare a rumore: riducete la dimensione del fade o cambiate traettoria

source: WARNING!!: Orchestra SR not compatiblewith HRTF processing SR of: %.0f
french: AVERTISSEMENT !! : SR de l'orchestre incompatible avec le SR du traitement HRTF de : %.0f
italian: ATTENZIONE!!: La SR dell'orchestra non ?? compatibile con la SR elaborata da HRTF di: %.0f

source: fdn delay > earlies del..., fixed!
french: retard fdn > premières réflexions ..., constant !

source: warning, approaching instability, fixed with a flat late reverb!
french: avertissement, proche de l'instabilité, résolu avec une réverbération tardive plate !

source: pvsifd: fftsize should be an integral multiple of hopsize
french: pvsifd : fftsize doit être un multiple entier de hopsize
italian: pvsifd: fftsize dovrebbe essere un multiplo intero di hopsize

source: pvsifd: fftsize should be power-of-two
french: pvsifd : fftsize doit être une puissance de deux
italian: pvsifd: fftsize dovrebbe essere un potenza di due

source: pvsifd: unsupported value for iwintype
french: pvsifd : valeur non supportée pout iwintype
italian: pvsifd: valore di iwintype non supportato

source: imageload: cannot open image %s.
french: imageload : impossible d'ouvrir l'image %s.

source: imageload: file %s is not in PNG format.
french: imageload : le fichier %s n'est pas au format PNG.

source: imageload: out of memory.
french: imageload : dépassement mémoire.

source: imageload: cannot open image %s for writing.
french: imageload : impossible d'ouvrir l'image %s en écriture.

source: Cannot allocate memory.
french: Impossible d'allouer la mémoire.

source: Cannot find Jack client.
french: Client Jack introuvable.

source: jacktransport: playback head moved at %f seconds
french: jacktransport : la tête de reproduction a été positionnée à %f secondes

source: jacktransport: playing.
french: jacktransport : actif.

source: jacktransport: stopped.
french: jacktransport : arrêté.

source: jacktransport: invalid parameter.
french: jacktransport : paramètre non valide.

source: Could not create Jack client "%s" -- is Jack server "%s" running? Status: %d
french: Impossible de créer le client Jack "%s" -- le serveur Jack "%s" est-il actif ? Etat : %d

source: Created Jack client "%s" for Jack server "%s".
french: Client Jack "%s" créé pour le serveur Jack "%s".

source: Jack buffer size %d != Csound ksmps %d, exiting...
french: Taille du tampon Jack %d != Csound ksmps %d, sortie...

source: Jack sampling rate %d != Csound sr %d, exiting...
french: Taux d'échantillonnage de Jack %d != Csound sr %d, sortie...

source: Activated Jack client "%s".
french: Client Jack activé "%s".

source: Failed to activate Jack client "%s": status %d.
french: L'activation du client Jack "%s" a échoué : état %d.

source: Jacko is now driving Csound performance...
french: Jacko conduit maintenant l'exécution de Csound...

source: Jacko has quit driving Csound performance.
french: Jacko ne conduit plus l'exécution de Csound.

source: Jacko performance finished.
french: Exécution de jacko terminée.

source: Jack client deactivated.
french: Client Jack désactivé.

source: Jack ports unregistered.
french: Ports jack désenregistrés.

source: Jack client closed.
french: Client Jack fermé.

source: Failed to set Jack freewheeling mode to "%s": error %d.
french: La mise de Jack en mode roue libre "%s" a échoué : erreur %d.

source: Set Jack freewheeling mode to "%s".
french: Jack mis en mode roue libre "%s".

source: Turned Jack connections "%s".
french: Connexions Jack "%s".

source: Could not create Jack port "%s".
french: Impossible de créer le port de Jack "%s".

source: Could not create Jack connection from "%s" to "%s": status %d.
french: Impossible de créer la connexion Jack de "%s" à "%s" : état %d.

source: Failed to initialise LAME %d
french: Echec de l'initialisation de LAME %d

source: mp3out %s: failed to open file
french: mp3out : %s : l'ouverture du fichier a échoué

source: mp3out: write error %d
french: mp3out : erreur d'écriture %d

source: linuxjoystick: No such table %f
french: joystick linux : aucune table %f
italian: linuxjoystick: Nessuna tale tavola %f

source: linuxjoystick: table %d of size %d too small for data size %d
french: joystick linux : table %d de taille %d trop petite pour la taille de données %d
italian: linuxjoystick: la tavola %d di dimensione %d ?? troppo piccola per la dimensione dei dati %d

source: linuxjoystick: could not open device /dev/input/js%d for reason: %s
french: joystick linux : ouverture du périphérique /dev/input/js%d impossible pour la raison %s
italian: linuxjoystick: non riesco ad aprire il dispositivo /dev/input/js%d per il motivo: %s

source: linuxjoystick: could not open device /dev/js%d for reason: %s
french: joystick linux : ouverture du périphérique /dev/js%d impossible pour la raison %s
italian: linuxjoystick: non riesco ad aprire il dispositivo /dev/js%d per il motivo: %s

source: linuxjoystick: read %d closing joystick
french: joystick linux : le lecteur %d ferme le joystick
italian: linuxjoystick: letto %d chiusura joystick

source: unknown joystick event type %i
french: type %i d'évènement de joystick inconnu
italian: tipo di evento joystick sconosciuto%i

source: liveconv: invalid impulse response partition length
french: liveconv : longueur de partition de la réponse impulsionnelle non valide
italian: liveconv: lunghezza della partizione dell'impulse response non valida

source: liveconv: invalid length, or insufficient IR data for convolution
french: liveconv : longueur non valide, ou pas assez de données de RI pour la convolution
italian: liveconv: lunghezza non valida, o dati IR insufficienti per convolution

source: liveconv: not initialised
french: liveconv : non initialisé
italian: liveconv: non inizializzato

source: Wrong number of outputs in locsig; must be 2 or 4
french: Nombre de sorties incorrect dans locsig ; doit valoir 2 ou 4
italian: Numero sbagliato di output in locsig; deve essere 2 o 4

source: Number of outputs must be the same as the previous locsig
french: Le nombre de sorties doit être le même que celui du locsig précédent
italian: Il numero di outputs deve essere lo stesso del precedente locsig

source: could not load '%s'
french: impossible de charger '%s'
italian: impossibile caricare '%s'

source: invalid loop mode: %d
french: mode de boucle non valide : %d
italian: modo loop non valido: %d

source: loscilx: invalid number of output arguments
french: loscilx : nombre d'arguments de sortie non valide
italian: loscilx: numero di argomenti d'output non valido

source: number of output arguments inconsistent with number of sound file channels
french: nombre d'arguments de sortie en contradiction avec le nombre de canaux du fichier son
italian: numero di argomenti d'output inconsistente con il numero di canali del file audio

source: loscilx: not initialised
french: loscilx : non initialisé
italian: loscilx: non inizializzato

source: loscilxa: not initialised
french: loscilxa : non initialisé

source: Cutoff parameter must be positive
french: le paramètre de coupure doit être positif
italian: parametro Cutoff deve essere positivo

source: illegal order num. (min 1, max 10)
french: numéro d'ordre illégal (min 1, max 10)
italian: numero order illegale. (min 1, max 10)

source: No table for Mandolin
french: Aucune table pour la mandoline
italian: Nessuna tavola per Mandolin

source: No base frequency for mandolin
french: Pas de fréquence de base pour la mandoline
italian: Nessuna frequenza base per mandolin

source: metro:init phase truncation
french: metro : la phase initiale est tronquée
italian: metro: troncamento della fase iniziale

source: metro2:init phase truncation
french: metro2 : la phase initiale est tronquée

source: splitrig: incorrect table number
french: splitrig : numéro de table incorrect
italian: splitrig: numero di tavola non corretto

source: value out of range
french: valeur hors limites
italian: valore fuori intervallo

source: invalid channel number: %d
french: numéro de canal non valide : %d
italian: numero di canale non valido: %d

source: illegal msb control number at position n.%d
french: msb du numéro de contrôleur illégal à la position n.%d
italian: numero di controllo msb illegale alla posizione n.%d

source: illegal lsb control number at position n.%d
french: lsb du numéro de contrôleur illégal à la position n.%d
italian: numero di controllo lsb illegale alla posizione n.%d

source: No table for Modal4 case
french: Pas de table pour le cas de Modal4
italian: Nessuna tavola per il caso Modal4

source: No table for Marimba strike
french: Pas de table pour l'excitation du Marimba
italian: Nessuna tavola di percussione della Marimba

source: striking three times here!!!
french: trois frappes ici !!!
italian: percossa tre volte qui!!!

source: striking twice here!!
french: deux frappes ici !!
italian: percossa due volte qui!!!

source: No table for Vibraphone strike
french: Pas de table pour l'excitation du Vibraphone
italian: Nessuna tavola di percussione della Vibraphone

source: No table for Agogobell strike
french: Pas de table pour l'excitation d'Agogobell
italian: Nessuna tavola di percussione della Agogobell

source: mp3in: %s: failed to open file
french: mp3in : %s : l'ouverture du fichier a échoué
italian: mp3in: %s: fallita apertura file

source: mp3in: file sample rate (%d) != orchestra sr (%d)
french: mp3in : taux d'échantillonnage du fichier (%d) != sr de l'orchestre (%d)

source: mp3scale: %s: failed to open file
french: mp3scale : %s : l'ouverture du fichier a échoué
italian: mp3scale: %s: fallita apertura file

source: could not set priority
french: impossible de fixer la priorité
italian: non posso impostare la priorit??

source: mp3scal_load error: %s
french: erreur de mp3scal_load : %s
italian: mp3scal_load errore: %s

source: mp3scal_load error: could not open %s
french: erreur de mp3scal_load : impossible d'ouvrir %s
italian: mp3scal_load errore: non riesco ad aprire %s

source: failed to start thread
french: le démarrage du thread a échoué
italian: fallito avvio del thread

source: cannot load: player still active
french: chargement impossible : le lecteur est toujours actif
italian: non posso caricare: player ancora attivo

source: invalid handle
french: descripteur non valide

source: not init
french: pas d'initialisation

source: nlfilt: not initialised
french: nlfilt : non initialisé
italian: nlfilt: non inizializzato

source: nlfilt2: not initialised
french: nlfilt2 : non initialisé
italian: nlfilt2: non inizializzato

source: invalid p field index
french: index de p-champ non valide

source: More arguments than p fields
french: Plus d'arguments que p-champs
italian: Pi?? argomenti che p fields

source: oscbnk: not initialised
french: oscbnk : non initialisé
italian: oscbnk: non inizializzato

source: grain2: not initialised
french: grain2 : non initialisé
italian: grain2: non inizializzato

source: grain3: invalid grain duration
french: grain3 : durée de grain non valide
italian: grain3: durata grain non valida

source: grain3: invalid grain density
french: grain3 : densité de grain non valide
italian: grain3: densit?? grain non valida

source: grain3: not initialised
french: grain3 : non initialisé
italian: grain3: non inizializzato

source: grain3 needs more overlaps
french: grain3 nécessite plus de chevauchements
italian: grain3 serve pi?? overlaps

source: rnd31: not initialised
french: rnd31 : non initialisé
italian: rnd31: non inizializzato

source: function table is NULL, check that ibasfn is available
french: table de fonction NULL, vérifier que ibasfn est valable
italian: tavola funzione NULL, controllate che ibasfn sia disponibile

source: redefined table array for waveform %d
french: redéfinition de la table pour la forme d'onde %d
italian: ridefinizione della tavola array per la forma d'onda %d

source: vco2init: invalid waveform number: %f
french: vco2init : numéro de forme d'onde non valide : %f
italian: vco2init: numero di forma d'onda non valido: %f

source: vco2init: invalid base ftable number
french: vco2init : numéro de la ftable de base non valide
italian: vco2init: numero base ftable non valido

source: vco2init: invalid partial number multiplier
french: vco2init : multiplicateur du nombre d'harmoniques non valide
italian: vco2init: moltiplicatore del numero di parziali non valido

source: vco2init: invalid min table size
french: vco2init : taille min de table non valide
italian: vco2init: dimensione min della tavola non valida

source: vco2init: invalid max table size
french: vco2init : taille max de table non valide
italian: vco2init: dimensione max della tavola non valida

source: vco2init: invalid source ftable
french: vco2init : ftable source non valide
italian: vco2init: ftable sorgente non valida

source: vco2ft: table array not found for this waveform
french: vco2ft : le tableau de tables pour cette forme d'onde n'a pas été trouvé
italian: vco2ft: tavola dell'array non trovato per questa forma d'onda

source: vco2ft: not initialised
french: vco2ft : non initialisé
italian: vco2ft: non inizializzato

source: vco2: too many input arguments
french: vco2 : trop d'arguments en entrée
italian: vco2: troppi argomenti in input

source: vco2: insufficient required arguments
french: vco2 : pas assez d'arguments requis
italian: vco2: argomenti richiesti insufficienti

source: vco2: table array not found for user defined waveform
french: vco2 : le tableau de tables pour la forme d'onde définie par l'utilisateur n'a pas été trouvé
italian: vco2: tavola dell'array non trovata per la forma d'onda definita dall'utente

source: vco2: not initialised
french: vco2 : non initialisé
italian: vco2: non inizializzato

source: delayk: invalid delay time (must be >= 0)
french: delayk : durée de délai non valide (doit être >= 0)
italian: delayk: tempo del delay non valido (deve essere >= 0)

source: delayk: not initialised
french: delayk : non initialisé
italian: delayk: non inizializzato

source: vdel_k: invalid max delay time (must be >= 0)
french: vdel_k : durée de délai max non valide (doit être >= 0)
italian: vdel_k: tempo max del delay non valido (deve essere >= 0)

source: vdel_k: not initialised
french: vdel_k : non initialisé
italian: vdel_k: non inizializzato

source: vdel_k: invalid delay time (must be >= 0)
french: vdel_k : durée de délai non valide (doit être >= 0)
italian: vdel_k: tempo del delay non valido (deve essere >= 0)

source: rbjeq: invalid filter type
french: rbjeq : type de filtre non valide
italian: rbjeq: tipo di filtro non valido

source: unable to open p5glove
french: impossible d'ouvrir p5glove

source: No open glove
french: Pas de gant ouvert

source: Illegal table size %d
french: Longueur de table illégale %d

source: Unknown panning type
french: Type de panoramique inconnu
italian: Tipo di panning sconosciuto

source: partials: first input not in AMP_FREQ format
french: partials : la première entrée n'est pas au format AMP_FREQ
italian: partials: il primo input non ?? nel formato AMP_FREQ

source: partials: no phase input, tracks will contain amp & freq only
french: partials : pas d'entrée de phase, les pistes ne contiendront que amp & fréq
italian: partials: nessun input per phase, la traccia conterr?? solo amp & freq

source: partikkelsync: opcode id needs to be a non-zero integer
french: partikkelsync : l'id de l'opcode doit être un entier non nul
italian: partikkelsync: l'id dell'opcode deve essere un intero non zero

source: partikkelsync: could not find opcode id
french: partikkelsync : impossible de trouver l'id de l'opcode
italian: partikkelsync: non riesco a trovare l'id dell'opcode

source: %s: partikkel not initialized
french: %s : partikkel non initialisé
italian: %s: partikkel non inizializzato

source: %s: could not find opcode id
french: %s : impossible de trouver l'id de l'opcode
italian: %s: non riesco a trovare l'id dell'opcode

source: paulstretch: table not found
french: paulstretch : table non trouvée !
italian: paulstretch: tavola non trovata

source: No table for Clarinet
french: Aucune table pour la clarinette
italian: Nessuna tavola per Clarinet

source: No base frequency for clarinet -- assuming 50Hz
french: Pas de fréquence de base pour la clarinette -- on suppose qu'elle vaut 50 Hz
italian: Nessuna frequenza di base per clarinet -- presumo 50Hz

source: No table for Flute
french: Aucune table pour la flûte
italian: Nessuna tavola per Flute

source: No base frequency for flute -- assumed to be 50Hz
french: Pas de fréquence de base pour la flûte -- on suppose qu'elle vaut 50 Hz
italian: Nessuna frequenza di base per flute -- presumo essere 50Hz

source: frequency too low, set to minimum
french: fréquence trop basse, fixée au minimum
italian: frequenza troppo bassa, impostata al minimo

source: No table for wgbow vibrato
french: Pas de table pour le vibrato de wgbow
italian: Nessuna tavola per il vibrato di wgbow

source: unknown lowest frequency for bowed string -- assuming 50Hz
french: La fréquence la plus basse pour la corde frottée est inconnue -- on suppose qu'elle vaut 50 Hz
italian: frequenza minima per bowed string sconosciuta -- presumo 50Hz

source: DlineA not initialised
french: DlineA non initialisé
italian: DlineA non inizializzato

source: No table for Brass
french: Pas de table pour Brass
italian: Nessuna tavola per Brass

source: No base frequency for brass -- assumed to be 50Hz
french: Pas de fréquence de base pour brass -- on suppose qu'elle vaut 50 Hz
italian: Nessuna frequenza di base per brass -- presumo essere 50Hz

source: negative rates not allowed!!, correcting
french: les vitesses négatives sont interdites !!, correction

source: Envelope: value=%f target=%f rate=%f state=%d
french: Enveloppe : valeur=%f cible=%f vitesse=%f état=%d

source: Sustain level out of range!!, correcting
french: Niveau d'entretien hors limites !!, correction
italian: Livello del sustain fuori intervallo!!, correggo

source: negative times not allowed!!, correcting
french: les valeurs de temps négatives sont interdites !!, correction
italian: tempi negativi non sono permessi!!, correggo

source: illegal iprd
french: iprd illégal
italian: iprd illegale

source: illegal iocts
french: iocts illégal
italian: iocts illegale

source: illegal ifrqs
french: ifrqs illégal
italian: ifrqs illegale

source: illegal no of partials
french: nombre de partiels illégal
italian: numero di parziali illegale

source: per octave rolloff too steep
french: pente par octave trop raide

source: illegal lo-hi values
french: valeurs lo-hi illégales
italian: valori di lo-hi illegali

source: pitch: not initialised
french: pitch : non initialisé
italian: pitch: non inizializzato

source: Must have even number of arguments in mac
french: Il doit y avoir un nombre pair d'arguments dans mac
italian: Deve avere un numero pari di argomenti in mac

source: clockread: clock still running, call clockoff first
french: clockread : l'horloge est toujours active, appeler clockoff d'abord
italian: clockread: clock ?? ancora in funzione, chiamate prima clockoff

source: scratchpad index out of range
french: L'indice du scratchpad est hors limites
italian: scratchpad indece fuori intervallo

source: adsynt: wavetable not found!
french: adsynt : table d'onde non trouvée !
italian: adsynt: wavetable non trovata!

source: adsynt: freqtable not found!
french: adsynt : table de fréq non trouvée !
italian: adsynt: freqtable non trovata!

source: adsynt: partial count is greater than freqtable size!
french: adsynt : le nombre de partiels est supérieur à la taille de la table de fréq !
italian: adsynt: il conto delle parziali ?? maggiore della dimensione di freqtable!

source: adsynt: amptable not found!
french: adsynt : table d'amp non trouvée !
italian: adsynt: amptable non trovata!
