Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: pvsys: bad format, data chunk before fmt chunk
french: pvsys : mauvais format, le bloc des données est avant le bloc fmt
italian: pvsys: pessimo formato, data chunk prima di fmt chunk

source: pvsys: custom window chunk PVXW not found
french: pvsys : le bloc de fenêtre personnalisée PVXW n'a pas été trouvé
italian: pvsys: chunk della custom window PVXW non trovata

source: pvsys: error skipping unknown WAVE chunk
french: pvsys : erreur en sautant un bloc WAVE inconnu
italian: pvsys: errore nel saltare chunk WAVE sconosciuto

source: pvsys: bad format in RIFF file
french: pvsys : mauvais format dans le fichier RIFF
italian: pvsys: pessimo formato nel file RIFF

source: pvsys: error writing header
french: pvsys : erreur en écrivant l'en-tête
italian: pvsys: errore scrittura header

source: pvsys: error writing fmt chunk
french: pvsys : erreur en écrivant le bloc fmt
italian: pvsys: errore scrittura fmt chunk

source: pvsys: error writing window data.
french: pvsys : erreur en écrivant les données de la fenêtre.
italian: pvsys: errore scrittura dati window.

source: pvsys: error updating data chunk
french: pvsys : erreur de mise à jour du bloc de données
italian: pvsys: errore aggiornamento chunk data

source: pvsys: error updating riff chunk
french: pvsys : erreur de mise à jour du bloc riff
italian: pvsys: errore aggiornamento riff chunk

source: pvsys: error seeking to end of file
french: pvsys : la fin du fichier n'a pas été trouvée
italian: pvsys: errore nella ricerca della fine del file

source: pvsys: file does not exist
french: pvsys : le fichier n'existe pas
italian: pvsys: il file non esiste

source: pvsys: file not open
french: pvsys : fichier non ouvert
italian: pvsys: file non aperto

source: pvsys: bad file descriptor
french: pvsys : mauvais descripteur de fichier
italian: pvsys: pessimo descrittore del file

source: pvsys: error writing data
french: pvsys : erreur en écrivant des données
italian: pvsys: errore scrittura dati

source: pvsys: error reading data
french: pvsys : erreur en lisant des données
italian: pvsys: errore lettura dati

source: pvsys: error rewinding file
french: pvsys : erreur en revenant au début du fichier
italian: pvsys: errore nel riavvolgere il file

source: pvsys: unable to close file on termination
french: pvsys : impossible de fermer le fichier à la fin

source: invalid window type
french: type de fenêtre non valide
italian: tipo di window non valida

source: ftable for window not found
french: la ftable de la fenêtre n'a pas été trouvée
italian: non trovo la ftable per la finestra ( window)

source: Invalid window size
french: Taille de fenêtre non valide
italian: dimensione window non valida

source: pvsanal: fftsize of 32 is too small!
french: pvsanal : une taille de tfr à 32 est trop petite !
italian: pvsanal: fftsize di 32 ?? troppo piccola!

source: pvsanal: window size too small for fftsize
french: pvsanal : taille fenêtre trop petite pour la taille de tfr
italian: pvsanal: dimensione della window troppo piccola per fftsize

source: pvsanal: overlap too big for fft size
french: pvsanal : taille de chevauchement trop grande pour la taille de tfr
italian: pvsanal: overlap troppo grande per la dimensione di fft

source: pvsanal: overlap must be >= ksmps
french: pvsanal : le chevauchement doit être >= ksmps
italian: pvsanal: overlap deve essere >= ksmps

source: pvsanal: Not Initialised.
french: pvsanal : non initialisé.
italian: pvsanal: Non Inizializzato.

source: Unknown window type; replaced by rectangular
french: Type de fenêtre inconnu ; remplacé par rectangulaire
italian: Tipo sconosciuto di window; rimpiazzata da rettangolare

source: pvsynth: Not Initialised.
french: pvsynth : non initialisé.
italian: pvsynth: Non Inizializzato.

source: insufficient memory to initialise remote globals.
french: mémoire insuffisante pour initialiser les variables globales distantes
italian: memoria insufficiente per inizializzare remote globals.

source: insufficient memory to initialise outgoing socket table.
french: mémoire insuffisante pour initialiser la table de socket sortant
italian: memoria insufficiente per inizializzare la tavola dei socket uscenti.

source: insufficient memory to initialise incoming socket table.
french: mémoire insuffisante pour initialiser la table de socket entrant
italian: memoria insufficiente per inizializzare la tavola dei socket entranti.

source: insufficient memory to initialise insrfd_list.
french: mémoire insuffisante pour initialiser insrfd_list.
italian: memoria insufficiente per inizializzare insrfd_list.

source: insufficient memory to initialise chnrfd_list.
french: mémoire insuffisante pour initialiser chnrfd_list.
italian: memoria insufficiente per inizializzare chnrfd_list.

source: insufficient memory to initialise insrfd table.
french: mémoire insuffisante pour initialiser la table insrfd.
italian: memoria insufficiente per inizializzare la tavola insrfd.

source: insufficient memory to initialise chnrfd table.
french: mémoire insuffisante pour initialiser la table chnrfd.
italian: memoria insufficiente per inizializzare la tavola chnrfd.

source: insufficient memory to initialise local ip address.
french: mémoire insuffisante pour initialiser l'adresse IP locale.
italian: memoria insufficiente per inizializzare l'indirizzo locale ip.

source: unable to get local ip address.
french: impossible d'obtenir une adresse IP locale.
italian: non riesco ad ottenere l'indirizzo locale ip.

source: could not open remote port
french: impossible d'ouvrir le port distant
italian: non posso aprire la porta remote

source: ---> Could not connect
french: ---> Connexion impossible
italian: ---> Non posso conettermi

source: ---> Failed all attempts to connect.
french: ---> Toutes les tentatives de connexion ont échoué.
italian: ---> Falliti tutti i tentativi di connessione.

source: ---> Connected.
french: ---> Connecté.
italian: ---> Connesso.

source: write to socket failed
french: l'écriture sur le socket a échoué
italian: scrittura su socket fallita

source: creating socket
french: création du socket
italian: creazione socket

source: created socket
french: socket créé
italian: socket creato

source: setting socket option to reuse the address
french: réglage de l'option du socket pour réutiliser l'adresse
italian: impostazione dell'opzione del socket per riutilizzo dell'indirizzo

source: bind failed
french: la liaison a échoué
italian: collegamento fallito

source: listen failed
french: l'écoute a échoué
italian: ascolto fallito

source: accept failed
french: l'acceptation a échoué
italian: accetazione fallita

source: accepted, conn=%d
french: accepté, cnx=%d
italian: accettato, conn=%d

source: failed to initialise remote globals.
french: l'initialisation des variables globales distantes a échoué.
italian: fallita inizializzazione delle globali remote.

source: missing instr nos
french: il manque les numéros d'instr
italian: mancano i numeri degli strumenti

source: illegal instr no
french: numéro d'instr illégal
italian: numero di strumento non valido

source: insno already remote
french: insno est déjà distant
italian: insno gi?? remoto

source: Failed to open port to listen
french: L'ouverture d'un port d'écoute a échoué
italian: Fallita apertura porta in ascolto

source: *** str1: %s own:%s
french: *** strl : %s own : %s

source: insno already specific remote
french: insno est déjà distant spécifique
italian: insno ?? gi?? specificato remoto

source: missing channel nos
french: il manque les numéros de canal
italian: mancano i numeri dei canali

source: illegal channel no
french: numéro de canal illégal
italian: numero di canale non valido

source: channel already remote
french: canal déjà distant
italian: channel ?? gi?? remoto

source: channel already specific remote
french: canal déjà distant spécifique
italian: channel ?? gi?? specificato remoto

source: CLsend failed
french: CLsend a échoué
italian: CLsend fallito

source: *** This version of Csound was not compiled with remote event support ***
french: *** Cette version de Csound n'a pas été compilée avec le support des évènements distants ***
italian: *** Questa versione di Csound non ?? stata compilata con il supporto di remote event ***

source: LFO: unknown oscilator type %d
french: LFO : type d'oscillateur inconnu %d
italian: LFO: tipo di oscillatore sconosciuto %d

source: schedkwhen ignored. Instrument %d undefined
french: schedkwhen ignoré. L'instrument %d n'est pas défini
italian: schedkwhen ?? stato ignorato. Lo strumento %d non ?? definito

source: schedkwhen warning: negative kwhen reset to zero
french: schedkwhen avertissement : kwhen négatif ramené à zéro
italian: avvertimento schedkwhen: kwhen negativo resettato a zero

source: trigseq: incorrect table number
french: trigseq : numéro de table incorrect
italian: trigseq: numero di tavola non corretto

source: no infile specified in the commandline
french: pas de fichier d'entrée spécifié dans la ligne de commande
italian: nessun infile specificato alla linea di comando

source: diskinfo cannot open %s
french: diskinfo ne peut pas ouvrir %s
italian: diskinfo non posso aprire %s

source: diskinfo cannot open %s: %s
french: diskinfo ne peut pas ouvrir %s : %s
italian: diskinfo non posso aprire %s: %s

source: %s: no PEAK chunk was found, scanning file for maximum amplitude
french: %s : aucun bloc PEAK n'a été trouvé, parcours du fichier pour déterminer l'amplitude maximale
italian: %s: nessun chunk PEAK trovato, esamino il file per ampiezza massima

source: Input channel for peak exceeds number of channels in file
french: Le canal d'entrée pour le pic dépasse le nombre de canaux dans le fichier
italian: Canale di input per peak eccede il numero di canali del file

source: filepeak: error getting peak value
french: filepeak: erreur lors de l'obtention de la valeur de pic
italian: filepeak: errore nell'ottenere il valore di peak

source: illegal strset index
french: index de strset illégal
italian: indice strset illegale

source: strset index conflict at %d
french: index de strset en conflit à %d
italian: strset conflitto indice a %d

source: previous value: '%s', replaced with '%s'
french: valeur précédente : '%s', remplacée par '%s'
italian: valore precedente: '%s', rimpiazzato con '%s'

source: --strset: invalid format
french: --strset : format non valide
italian: --strset: formato non valido

source: NULL string
french: chaîne de caractères NULL
italian: stringa NULL

source: a-rate argument not allowed
french: Les arguments de taux-a sont interdits
italian: argomento a-rate non consentito

source: too many arguments
french: trop d'arguments
italian: troppi argomenti

source: insufficient arguments for format
french: arguments insuffisants pour le format
italian: argomenti insufficienti per il formato

source: output argument may not be the same as any of the input args
french: l'argument de sortie ne peut pas être le même qu'un argument d'entrée
italian: l'argomento d'output potrebbe non essere lo stesso di nessuno degli argomenti d'input

source: invalid format string
french: format de chaîne de caractères non valide
italian: formato della stringa non valido

source: too many arguments for format
french: trop d'arguments pour le format
italian: troppi argomenti per il formato

source: empty string
french: chaîne de caractères vide
italian: stringa vuota

source: invalid format
french: format non valide
italian: formato non valido

source: invalid option code: %g
french: code d'option non valide : %g
italian: codice opzione non valido: %g

source: arg1 is zero
french: arg1 vaut zéro
italian: arg1 ?? zero

source: arg2 is zero
french: arg2 vaut zéro
italian: arg2 ?? zero

source: unlike signs
french: signes différents
italian: segni differenti

source: incomplete number of input arguments
french: nombre incorrect d'arguments en entrée
italian: Numero di argomenti in input incompleto

source: Breakpoint %d not valid
french: Point charnière %d non valide
italian: Breakpoint %d non valido

source: linseg not initialised (krate)
french: linseg non initialisé (taux-k)
italian: linseg non inizializzato (krate)

source: linseg: not initialised (arate)
french: linseg : non initialisé (taux-a)
italian: linseg: non inizializzato (arate)

source: length of ADSR note too short
french: durée de la note de l'ADSR trop courte
italian: lunghezza della nota ADSR troppo breve

source: ival%d is zero
french: ival%d vaut zéro
italian: ival%d ?? zero

source: ival%d sign conflict
french: ival%d conflit de signe
italian: ival%d conflitto di segno

source: Breakpoint time %f not valid
french: Date %f du point charnière non valide
italian: Tempo del breakpoint %f non valido

source: length of XADSR note too short
french: durée de la note de l'XADSR trop courte
italian: lunghezza della nota XADSR troppo breve

source: expseg (krate): not initialised
french: expseg (taux-k) : non initialisé
italian: expseg (krate): non inizializzato

source: expseg (arate): not initialised
french: expseg (taux-a) : non initialisé
italian: expseg (arate): non inizializzato

source: p3 too short in linen
french: p3 trop court dans linen
italian: p3 troppo breve in linen

source: non-positive iatdec
french: iatdec non positif
italian: iatdec non positivo

source: ixmod out of range.
french: ixmod hors limites
italian: ixmod fuori intervallo.

source: p3 too short in envlpx
french: p3 trop court dans envlpx
italian: p3 troppo breve in envlpx

source: rise func ends with zero
french: la fonction d'attaque se termine par zéro
italian: funzione rise finisce con zero

source: envlpx rise func ends with zero
french: la fonction d'attaque de envlpx se termine zéro
italian: funzione rise di envlpx finisce con zero

source: envlpx(krate): not initialised
french: envlpx(taux-k) : non initialisé
italian: envlpx(krate): non inizializzato

source: cosseg not initialised (krate)
french: cosseg non initialisé (taux-k)
italian: cosseg non inizializzato (krate)

source: cosseg: not initialised (arate)
french: cosseg : non initialisé (taux-a)
italian: cosseg: non inizializzato (arate)

source: cossegr: not initialised (arate)
french: cosseg : non initialisé (taux-a)
italian: cossegr: non inizializzato (arate)

source: init phase truncation
french: la phase initiale est tronquée
italian: fase iniziale troncata

source: Offset %f < 0 or > tablelength
french: Décalage %f < 0 ou > longueur de la table
italian: Offset %f < 0 oppure > tablelength

source: %s: table index type inconsistent with output
french: %s : type de l'indice de table en contradiction avec la sortie
italian: %s: tipo di indice della tavola inconsistente con l'output

source: table(krate): not initialised
french: table(taux-k) : non initialisé
italian: table(krate): non inizializzato

source: table: not initialised
french: table : non initialisé
italian: table: non inizializzato

source: tablei(krate): not initialised
french: tablei(taux-k) : non initialisé
italian: tablei(krate): non inizializzato

source: table3(krate): not initialised
french: table3(taux-k) : non initialisé
italian: table3(krate): non inizializzato

source: tablei: not initialised
french: tablei : non initialisé
italian: tablei: non inizializzato

source: table3: not initialised
french: table3 : non initialisé
italian: table3: non inizializzato

source: k rate function table no. %f < 1
french: le numéro de la table de fonction de taux-k %f < 1
italian: tavola funzione a k rate no. %f < 1

source: oscil1(krate): not initialised
french: oscil1(taux-k) : non initialisé
italian: oscil1(krate): non inizializzato

source: oscil1i(krate): not initialised
french: oscil1i(taux-k) : non initialisé
italian: oscil1i(krate): non inizializzato

source: osciln: not initialised
french: osciln : non initialisé
italian: osciln: non inizializzato

source: array size not pow-of-two
french: la taille du tableau n'est pas une puissance de deux
italian: dimensione dell'array non potenza di due

source: oscil(krate): not initialised
french: oscil(taux-k) : non initialisé
italian: oscil(krate): non inizializzato

source: oscil: not initialised
french: oscil : non initialisé
italian: oscil: non inizializzato

source: oscili(krate): not initialised
french: oscili(taux-k) : non initialisé
italian: oscili(krate): non inizializzato

source: oscili: not initialised
french: oscili : non initialisé
italian: oscili: non inizializzato

source: oscil3(krate): not initialised
french: oscil3(taux-k) : non initialisé
italian: oscil3(krate): non inizializzato

source: oscil3: not initialised
french: oscil3 : non initialisé
italian: oscil3: non inizializzato

source: foscil: not initialised
french: foscil : non initialisé
italian: foscil: non inizializzato

source: foscili: not initialised
french: foscili : non initialisé
italian: foscili: non inizializzato

source: no legal base frequency
french: pas de fréquence de base légale

source: loscil: sustain defers to non-looping source
french: loscil : entretien différé à une source sans boucle

source: mono loscil cannot read from stereo ftable
french: un loscil mono ne peut pas lire à partir d'une ftable stéréo
italian: mono loscil non pu?? leggere da una ftable stereo

source: stereo loscil cannot read from mono ftable
french: un loscil stéréo ne peut pas lire à partir d'une ftable mono
italian: stereo loscil non pu?? leggere da una ftable mono

source: illegal sustain loop data
french: données de boucle d'entretien illégales
italian: dati del loop sustain illegali

source: illegal release loop data
french: données de boucle de relâchement illégales
italian: dati del loop release illegali

source: mono loscilphs cannot read from stereo ftable
french: un loscilphs mono ne peut pas lire à partir d'une ftable stéréo
italian: mono loscilphs non pu?? leggere da una ftable stereo

source: stereo loscilphs cannot read from mono ftable
french: un loscilphs stéréo ne peut pas lire à partir d'une ftable mono
italian: stereo loscilphs non pu?? leggere da una ftable mono

source: loscilphs: insufficient outputs
french: loscilph : sorties insuffisantes
italian: loscilphs: outputs insufficienti

source: ADSYN cannot load %s
french: ADSYN ne peut pas charger %s
italian: ADSYN non posso caricare %s

source: illegal code %d encountered
french: code %d illégal rencontré
italian: trovato codice illegale %d

source: %d amp tracks, %d freq tracks
french: %d pistes d'amp, %d pistes de fréq

source: partial count exceeds MAXPTLS
french: le nombre de partiels dépasse MAXPTLS
italian: il conto delle parziali eccede MAXPTLS

source: adsyn: not initialised
french: adsyn : non initialisé
italian: adsyn: non inizializzato

source: buzz: not initialised
french: buzz : non initialisé
italian: buzz: non inizializzato

source: gbuzz: not initialised
french: gbuzz : non initialisé
italian: gbuzz: non inizializzato

source: illegal stretch factor(param1) value
french: valeur illégale du facteur d'étirement (param1)
italian: valore del fattore di stretch (param1) illegale

source: illegal roughness factor(param1) value
french: valeur illégale du facteur de rugosité (param1)
italian: valore del fattore di roughness (param1) illegale

source: illegal stretch factor(param2) value
french: valeur illégale du facteur d'étirement (param2)
italian: valore del fattore di stretch(param2) illegale

source: coefficients too large (param1 + param2)
french: coefficients trop grands (param1 + param2)
italian: coefficienti troppo grandi (param1 + param2)

source: unknown method code
french: code de méthode inconnu
italian: codice del metodo sconosciuto

source: pluck: not initialised
french: pluck : non initialisé
italian: pluck: non inizializzato

source: pluck: kcps more than sample rate
french: pluck : kcps supérieur au taux d'échantillonnage
italian: pluck: kcps maggiore della frequenza di campionamento (sr)

source: Seeding from current time %<PRIu32>
french: Graine à partir de l'horloge %<PRIu32>
italian: Seme dal tempo attuale %<PRIu32>

source: LPREAD cannot load %s
french: LPREAD ne peut pas charger %s
italian: LPREAD non posso caricare %s

source: Using %s type of file.
french: Utilisation du type de fichier %s.
italian: Uso %s tipo di file.

source: pole
french: pôle

source: filter coefficient
french: coefficient du filtre
italian: coefficienti del filtro

source: lpheader overriding inputs
french: l'en-tête du fichier prend le pas sur les paramètres
italian: lpheader sovrascrittura degli inputs

source: lpfile srate != orch sr
french: taux d'échantillonnage du fichier != sr de l'orch

source: file %s bytes are in wrong order
french: dans le fichier %s les octets ne sont pas dans le bon ordre
italian: i bytes del file %s sono in ordine sbagliato

source: insufficient args and no file header
french: nombre d'arguments insuffisant et pas d'en-tête de fichier
italian: argomenti insufficienti e nessun header del file

source: Real: %f Imag: %f
french: Partie réelle : %f Partie imaginaire : %f

source: Cannot handle uneven pole count yet
french: Impossible de traiter actuellement un nombre impair de pôles
italian: Non posso ancora gestire conteggio dei poli impari

source: lpread: not initialised
french: lpread : non initialisé
italian: lpread: non inizializzato

source: lpread ktimpnt truncated to last frame
french: lpread : ktimpnt tronqué à la dernière trame
italian: lpread ktimpnt troncato all'ultimo frame

source: Interpolation failed
french: L'interpolation a échoué
italian: Fallita interpolazione

source: this opcode only works with LPC pole analysis type (-a)
french: cet opcode ne fonctionne qu'avec le type d'analyse de pôle par CPL (-a)
italian: questo opcode funziona solo con LPC pole analysis type (-a)

source: Pole file not supported for this opcode !
french: Fichier de pôles non supporté par cet opcode !
italian: File Pole non supportato da questo opcode!

source: Too few poles (> 2)
french: Pas assez de pôles (>2)

source: illegal frqratio, %5.2f
french: frqratio illégal, %5.2f
italian: frqratio illegale, %5.2f

source: lpslot number should be positive
french: le numéro de lpslot doit être positif
italian: numero di lpslot dovrebbe essere positivo

source: LPC slot is not allocated
french: le slot LPC n'est pas alloué
italian: slot LPC non allocato

source: lpinterpol works only with poles files..
french: lpinterpol ne travaille qu'avec des fichiers de pôles..
italian: lpinterpol funzione solo con file poles..

source: The poles files have different pole count
french: Les fichiers de pôles ont un nombre de pôles différent
italian: I file poles hanno diverso numero di pole

source: padding error
french: erreur de padding

source: lpinterpol: not initialised
french: lpinterpol : non initialisé
italian: lpinterpol: non inizializzato

source: illegal delay time
french: durée de délai illégale
italian: tempo delay illegale

source: delayr: invalid outarg type
french: delayr : type d'argument en sortie non valide
italian: delayr: tipo di outarg non valido

source: delayw: associated delayr not found
french: delayw : le delayr associé n'a pas été trouvé
italian: delayw: non trovo l'associato delayr

source: deltap: associated delayr not found
french: deltap : le delayr associé n'a pas été trouvé
italian: deltap: non trovo l'associato delayr

source: deltap: delayr index %.0f is out of range
french: deltap : l'index de delayr %.0f est hors limites
italian: deltap: indice di delayr %.0f ?? fuori intervallo

source: delay: not initialised
french: delay : non initialisé
italian: delay: non inizializzato

source: delayr: not initialised
french: delayr : non initialisé
italian: delayr: non inizializzato

source: delayw: not initialised
french: delayw : non initialisé
italian: delayw: non inizializzato

source: deltap: not initialised
french: deltap : non initialisé
italian: deltap: non inizializzato

source: deltapi: not initialised
french: deltapi : non initialisé
italian: deltapi: non inizializzato
