Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: adsynt2: freqtable not found!
french: adsynt2 : la table de fréq n'a pas été trouvée !
italian: adsynt2: freqtable non trovata!

source: adsynt2: partial count is greater than freqtable size!
french: adsynt2 : le nombre de partiels est supérieur à la taille de la table de fréq !
italian: adsynt2: il conto delle parziali ?? maggiore della dimensione di freqtable!

source: adsynt2: amptable not found!
french: adsynt2 : la table d'amp n'a pas été trouvée !
italian: adsynt2: amptable non trovata!

source: adsynt2: partial count is greater than amptable size!
french: adsynt2 : le nombre de partiels est supérieur à la taille de la table d'amp !
italian: adsynt2: il conto delle parziali ?? maggiore della dimensione di amptable!

source: adsynt2: not initialised
french: adsynt2 : non initialisé
italian: adsynt2: non inizializzato

source: max_k: invalid imaxflag value
french: max_k : valeur de imaxflag non valide
italian: max_k: valore di imaxflag non valido

source: hvs: No out table
french: hvs : pas de table de sortie
italian: hvs: Nessuna tavola d'out

source: hvs: No positions table
french: hvs: pas de table de positions
italian: hvs: Nessuna tavola delle posizioni

source: hvs: No snap table
french: hvs : pas de table instantanée
italian: hvs: Nessuna tavola snap

source: hvs1: a line segment must be delimited by 2 points at least
french: hvs1 : un segment de droite doit être délimité par 2 points au moins
italian: hvs1: un segmento di linea deve essere delimitato da almeno 2 punti

source: hvs: no config table
french: hvs : pas de table de configuration
italian: hvs: nessuna tavola config

source: hvs2: a square area must be delimited by 2 lines at least
french: hvs2 : une surface carrée doit être délimitée par 2 droites au moins
italian: hvs2: un'area quadrata deve essere delimitata da almeno 2 linee

source: hvs3: a square area must be delimited by 2 lines at least
french: hvs3 : une surface carrée doit être délimitée par 2 droites au moins
italian: hvs3: un'area quadrata deve essere delimitata da almeno 2 linee

source: vphaseseg: the first function is invalid or missing
french: vphaseseg : la première fonction est non valide ou manquante
italian: vphaseseg: la prima funzione ?? mancante o non valida

source: Failed to find ftable
french: ftable introuvable
italian: Fallito a trovare la ftable

source: vphaseseg: invalid num. of elements
french: vphaseseg : nombre d'éléments non valide
italian: vphaseseg: numero di elementi non valido

source: vphaseseg: function invalid or missing
french: vphaseseg : fonction non valide ou manquante
italian: vphaseseg: funzione mancante o non valida

source: vtable1: incorrect table number
french: vtable1 : numéro de table incorrect
italian: vtable1: numero di tavola non corretto

source: inrg: audio input is not enabled
french: inrg : entrée audio désactivée
italian: inrg: l'input audio non ?? abilitato

source: inrg: channel number cannot be < 1 (1 is the first channel)
french: inrg : le numéro de canal ne peut pas être < 1 (1 est le premier canal)
italian: inrg: il numero di canale non pu?? essere < 1 (1 ?? il primo canale)

source: invalid function
french: fonction non valide
italian: funzione non valida

source: lposc: no sample rate stored in function; assuming=sr
french: lposc : pas de taux d'échantillonnage dans la fonction ; on suppose = sr
italian: lposc: nessuna frequenza di campionamento fornita nella funzione; assumo=sr

source: lposcil: no sample rate stored in function; assuming=sr
french: lposcil : pas de taux d'échantillonnage dans la fonction ; on suppose = sr
italian: lposcil: nessuna frequenza di campionamento fornita nella funzione; assumo=sr

source: illegal channel
french: canal illégal
italian: canale illegale

source: illegal control number at position n.%d
french: numéro de contrôle illégal à la position n.%d
italian: numero di controllo illegale alla posizione n.%d

source: sliderXtable: illegal initvalue at position %d. When using table indexing, the init range is 0 to 1
french: sliderXtable : valeur d'initialisation illégale à la position %d. Lorsque l'on utilise une indexation de table, l'intervalle d'initialisation va de 0 à 1
italian: sliderXtable: valore di initvalue alla posizione %d illegale. Quando si usano gli indici nella tavola, l'intervallo iniziale ?? da 0 a 1

source: illegal initvalue at position n.%d
french: valeur d'initialisation illégale à la position n.%d
italian: initvalue non valido alla posizione n.%d

source: sliderXtable: zero is illegal in exponential operations
french: sliderXtable : zéro est illégal dans les opérations exponentielles
italian: sliderXtable: zero ?? illegale nelle operazioni esponenziali

source: sliderXtable: illegal initvalue at position %d. When using table indexing, the init range is 0 to 1
french: sliderXtable : valeur d'initialisation illégale à la position %d. Lorsque l'on utilise une indexation de table, l'intervalle d'initialisation va de 0 à 1
italian: sliderXtable: initvalue non valido alla posizione %d. Quando si usano gli indici della tavola, l'intervallo di init ?? tra 0 e 1

source: illegal midi channel
french: canal midi illégal
italian: canale midi non valido

source: tabmorph: invalid table number
french: tabmorph : numéro de table non valide
italian: tabmorph: numero di tavola non valido

source: tabmorph: all tables must have the same length!
french: tabmorph : toutes les tables doivent avoir la même longueur !
italian: tabmorph: le tavole devono avere tutte la stessa lunghezza!

source: vtablei: incorrect table number
french: vtablei : numéro de table incorrect
italian: vtablei: numero di tavola non corretto

source: vtablei: reading past end of table
french: vtablei : lecture au-delà de la fin de la table

source: vtable: incorrect table number
french: vtable : numéro de table incorrect
italian: vtable: numero di tavola non corretto

source: vtablek: incorrect table number
french: vtablek : numéro de table incorrect
italian: vtablek: numero di tavola non corretto

source: vtablea: incorrect table number
french: vtablea : numéro de table incorrect
italian: vtablea: numero di tavola non corretto

source: vtabi: incorrect table number
french: vtabi : numéro de table incorrect
italian: vtabi: numero di tavola non corretto

source: vtab: incorrect table number
french: vtab : numéro de table incorrect
italian: vtab: numero di tavola non corretto

source: vtablewi: incorrect table number
french: vtablewi : numéro de table incorrect
italian: vtablewi: numero di tavola non corretto

source: vtablew: incorrect table number
french: vtablew : numéro de table incorrect
italian: vtablew: numero di tavola non corretto

source: vtablewk: incorrect table number
french: vtablewk : numéro de table incorrect
italian: vtablewk: numero di tavola non corretto

source: vtablewa: incorrect table number
french: vtablewa : numéro de table incorrect
italian: vtablewa: numero di tavola non corretto

source: vtabwi: incorrect table number
french: vtabwi : numéro de table incorrect
italian: vtabwi: numero di tavola non corretto

source: vtabwa: incorrect table number
french: vtabwa : numéro de table incorrect
italian: vtabwa: numero di tavola non corretto

source: vadd_i: invalid table number %i
french: vadd_i : numéro de table %i non valide
italian: vadd_i: numero di tavola %i non valido

source: vadd_i: ifn length exceeded
french: vadd_i : la longueur de ifn a été dépassée
italian: vadd_i: lunghezza ifn eccedente

source: vadd: ifn1 length exceeded
french: vadd : la longueur de ifn1 a été dépassée
italian: vadd: lunghezza ifn1 eccedente

source: vmult_i: ifn length exceeded
french: vmult_i : la longueur de ifn a été dépassée
italian: vmult_i: lunghezza ifn eccedente

source: vmult: ifn1 length exceeded
french: vmult : la longueur de ifn1 a été dépassée
italian: vmult: lunghezza ifn1 eccedente

source: vpow_i: invalid table number %i
french: vpow_i : numéro de table %i non valide
italian: vpow_i: numero di tavola %i non valido

source: vpow_i: ifn length exceeded
french: vpow_i : la longueur de ifn a été dépassée
italian: vpow_i: lunghezza ifn eccedente

source: vpow: ifn1 length exceeded
french: vpow : la longueur de ifn1 a été dépassée
italian: vpow: lunghezza ifn1 eccedente

source: vexp_i: invalid table number %i
french: vexp_i : numéro de table %i non valide
italian: vexp_i: numero di tavola %i non valido

source: vexp_i: ifn length exceeded
french: vexp_i : la longueur de ifn a été dépassée
italian: vexp_i: lunghezza ifn eccedente

source: vexp: ifn1 length exceeded
french: vexp : la longueur de ifn1 a été dépassée
italian: vexp: lunghezza ifn1 eccedente

source: vectorsop: ifn1 invalid table number %i
french: vectorsop : ifn1 numéro de table %i non valide
italian: vectorsop: ifn1 numero di tavola %i non valido

source: vectorsop: ifn2 invalid table number %i
french: vectorsop : ifn2 numéro de table %i non valide
italian: vectorsop: ifn2 numero di tavola %i non valido

source: vcopy: ifn1 length exceeded
french: vcopy : la longueur de ifn1 a été dépassée
italian: vcopy: lunghezza ifn1 eccedente

source: vcopy: ifn2 length exceeded
french: vcopy : la longueur de ifn2 a été dépassée
italian: vcopy: lunghezza ifn2 eccedente

source: vcopy_i: ifn1 invalid table number %i
french: vcopy_i : ifn1 numéro de table %i non valide
italian: vcopy_i: ifn1 numero di tavola %i non valido

source: vcopy_i: ifn2 invalid table number %i
french: vcopy_i : ifn2 numéro de table %i non valide
italian: vcopy_i: ifn2 numero di tavola %i non valido

source: vcopy_i: ifn1 length exceeded
french: vcopy_i : la longueur de ifn1 a été dépassée
italian: vcopy_i: lunghezza ifn1 eccedente

source: vcopy_i: ifn2 length exceeded
french: vcopy_i : la longueur de ifn2 a été dépassée
italian: vcopy_i: lunghezza ifn2 eccedente

source: vaddv: ifn1 length exceeded
french: vaddv : la longueur de ifn1 a été dépassée
italian: vaddv: lunghezza ifn1 eccedente

source: vaddv: ifn2 length exceeded
french: vaddv : la longueur de ifn2 a été dépassée
italian: vaddv: lunghezza ifn2 eccedente

source: vaddv_i: ifn1 invalid table number %i
french: vaddv_i : ifn1 numéro de table %i non valide
italian: vaddv_i: ifn1 numero di tavola %i non valido

source: vaddv_i: ifn2 invalid table number %i
french: vaddv_i : ifn2 numéro de table %i non valide
italian: vaddv_i: ifn2 numero di tavola %i non valido

source: vaddv_i: ifn1 length exceeded
french: vaddv_i : la longueur de ifn1 a été dépassée
italian: vaddv_i: lunghezza ifn1 eccedente

source: vaddv_i: ifn2 length exceeded
french: vaddv_i : la longueur de ifn2 a été dépassée
italian: vaddv_i: lunghezza ifn2 eccedente

source: vsubv: ifn1 length exceeded
french: vsubv : la longueur de ifn1 a été dépassée
italian: vsubv: lunghezza ifn1 eccedente

source: vsubv: ifn2 length exceeded
french: vsubv : la longueur de ifn2 a été dépassée
italian: vsubv: lunghezza ifn2 eccedente

source: vsubv_i: ifn1 invalid table number %i
french: vsubv_i : ifn1 numéro de table %i non valide
italian: vsubv_i: ifn1 numero di tavola %i non valido

source: vsubv_i: ifn2 invalid table number %i
french: vsubv_i : ifn2 numéro de table %i non valide
italian: vsubv_i: ifn2 numero di tavola %i non valido

source: vsubv_i: ifn1 length exceeded
french: vsubv_i : la longueur de ifn1 a été dépassée
italian: vsubv_i: lunghezza ifn1 eccedente

source: vsubv_i: ifn2 length exceeded
french: vsubv_i : la longueur de ifn2 a été dépassée
italian: vsubv_i: lunghezza ifn2 eccedente

source: vmultv: ifn1 length exceeded
french: vmultv : la longueur de ifn1 a été dépassée
italian: vmultv: lunghezza ifn1 eccedente

source: vmultv: ifn2 length exceeded
french: vmultv : la longueur de ifn2 a été dépassée
italian: vmultv: lunghezza ifn2 eccedente

source: vmultv_i: ifn1 invalid table number %i
french: vmultv_i : ifn1 numéro de table %i non valide
italian: vmultv_i: ifn1 numero di tavola %i non valido

source: vmultv_i: ifn2 invalid table number %i
french: vmultv_i : ifn2 numéro de table %i non valide
italian: vmultv_i: ifn2 numero di tavola %i non valido

source: vmultv_i: ifn1 length exceeded
french: vmultv_i : la longueur de ifn1 a été dépassée
italian: vmultv_i: lunghezza ifn1 eccedente

source: vmultv_i: ifn2 length exceeded
french: vmultv_i : la longueur de ifn2 a été dépassée
italian: vmultv_i: lunghezza ifn2 eccedente

source: vdivv: ifn1 length exceeded
french: vdivv : la longueur de ifn1 a été dépassée
italian: vdivv: lunghezza ifn1 eccedente

source: vdivv: ifn2 length exceeded
french: vdivv : la longueur de ifn2 a été dépassée
italian: vdivv: lunghezza ifn2 eccedente

source: vdivv_i: ifn1 invalid table number %i
french: vdivv_i : ifn1 numéro de table %i non valide
italian: vdivv_i: ifn1 numero di tavola %i non valido

source: vdivv_i: ifn2 invalid table number %i
french: vdivv_i : ifn2 numéro de table %i non valide
italian: vdivv_i: ifn2 numero di tavola %i non valido

source: vdivv_i: ifn1 length exceeded
french: vdivv_i : la longueur de ifn1 a été dépassée
italian: vdivv_i: lunghezza ifn1 eccedente

source: vdivv_i: ifn2 length exceeded
french: vdivv_i : la longueur de ifn2 a été dépassée
italian: vdivv_i: lunghezza ifn2 eccedente

source: vpowv: ifn1 length exceeded
french: vpowv : la longueur de ifn1 a été dépassée
italian: vpowv: lunghezza ifn1 eccedente

source: vpowv: ifn2 length exceeded
french: vpowv : la longueur de ifn2 a été dépassée
italian: vpowv: lunghezza ifn2 eccedente

source: vpowv_i: ifn1 invalid table number %i
french: vpowv_i : ifn1 numéro de table %i non valide
italian: vpowv_i: ifn1 numero di tavola %i non valido

source: vpowv_i: ifn2 invalid table number %i
french: vpowv_i : ifn2 numéro de table %i non valide
italian: vpowv_i: ifn2 numero di tavola %i non valido

source: vpowv_i: ifn1 length exceeded
french: vpowv_i : la longueur de ifn1 a été dépassée
italian: vpowv_i: lunghezza ifn1 eccedente

source: vpowv_i: ifn2 length exceeded
french: vpowv_i : la longueur de ifn2 a été dépassée
italian: vpowv_i: lunghezza ifn2 eccedente

source: vexpv: ifn1 length exceeded
french: vexpv : la longueur de ifn1 a été dépassée
italian: vexpv: lunghezza ifn1 eccedente

source: vexpv: ifn2 length exceeded
french: vexpv : la longueur de ifn2 a été dépassée
italian: vexpv: lunghezza ifn2 eccedente

source: vexpv_i: ifn1 invalid table number %i
french: vexpv_i : ifn1 numéro de table %i non valide
italian: vexpv_i: ifn1 numero di tavola %i non valido

source: vexpv_i: ifn2 invalid table number %i
french: vexpv_i : ifn2 numéro de table %i non valide
italian: vexpv_i: ifn2 numero di tavola %i non valido

source: vexpv_i: ifn1 length exceeded
french: vexpv_i : la longueur de ifn1 a été dépassée
italian: vexpv_i: lunghezza ifn1 eccedente

source: vexpv_i: ifn2 length exceeded
french: vexpv_i : la longueur de ifn2 a été dépassée
italian: vexpv_i: lunghezza ifn2 eccedente

source: vmap: Error: ifn1 and ifn2 can not be the same
french: vmap : Erreur : ifn1 et ifn2 ne peuvent pas être les mêmes
italian: vmap: Errore: ifn1 e ifn2 non possono essere la stessa

source: vmap: ifn1 invalid table number %i
french: vmap : ifn1 numéro de table %i non valide
italian: vmap: ifn1 numero di tavola %i non valido

source: vmap: ifn2 invalid table number %i
french: vmap : ifn2 numéro de table %i non valide
italian: vmap: ifn2 numero di tavola %i non valido

source: vmap: ifn1 length exceeded
french: vmap : la longueur de ifn1 a été dépassée
italian: vmap: lunghezza ifn1 eccedente

source: vmap: ifn2 length exceeded
french: vmap : la longueur de ifn2 a été dépassée
italian: vmap: lunghezza ifn2 eccedente

source: vectorop: invalid num of elements
french: vectorop : nombre d'éléments non valide
italian: vectorop: numero di elementi non valido

source: vport: invalid table length or num of elements
french: vport : longueur de table ou nombre d'éléments non valides
italian: vport: lunghezza tavola o numero di elementi non valido

source: vport: invalid table
french: vport : table non valide
italian: vport: tavola non valida

source: vport: invalid init table length or num of elements
french: vport : longueur de table init ou nombre d'éléments non valides
italian: vport: lunghezza tavola init o numero di elementi non valido

source: vport: invalid init table
french: vport : table non valide
italian: vport: tavola init non valida

source: vrandh: Seeding from current time %<PRIu32>
french: vrandh : graine à partir de l'horloge %<PRIu32>
italian: vrandh: Seme dal tempo attuale %<PRIu32>

source: vrandh: Invalid table.
french: vrandh : table non valide.
italian: vrandh: tavola non valida

source: vrandh: idstoffset is greater than table length.
french: vrandh : idstoffset est supérieur à la longueur de la table.
italian: vrandh: idstoffset ?? maggiore della lunghezza della tavola.

source: randh: Table length exceeded, last elements discarded.
french: randh : longeur de la table dépassée, derniers éléments ignoré.
italian: randh: Lunghezza della tavola eccedente, gli ultimi elementi sono scartati.

source: vrandi: Seeding from current time %<PRIu32>
french: vrandi : graine à partir de l'horloge %<PRIu32>
italian: vrandi: Seme dal tempo attuale %<PRIu32>

source: vrandi: Invalid table.
french: vrandi : table non valide.
italian: vrandi: tavola non valida

source: vrandi: idstoffset is greater thantable length.
french: vrandi : idstoffset est supérieur à la longueur de la table.
italian: vrandi: idstoffset ?? maggiore della lunghezza della tavola.

source: vrandi: Table length exceeded, last elements discarded.
french: vrandi : longueur de la table dépassée, derniers éléments ignorés.
italian: vrandi: Lunghezza della tavola eccedente, gli ultimi elementi sono scartati.

source: vecdelay: invalid num of elements
french: vecdelay : nombre d'éléments non valide
italian: vecdelay: numero di elementi non valido

source: vecdly: invalid output table
french: vecdly : table de sortie non valide
italian: vecdly: tavola d'output non valida

source: vecdly: invalid input table
french: vecdly : table d'entrée non valide
italian: vecdly: tavola d'input non valida

source: vecdly: invalid delay table
french: vecdly : table de délai non valide
italian: vecdly: tavola delay non valida

source: vecdly: not initialised
french: vecdly : non initialisé
italian: vecdly: non inizializzato

source: vlinseg/vexpseg: invalid num. of elements
french: vlinseg/vexpseg : nombre d'éléments non valide
italian: vlinseg/vexpseg: numero di elementi non valido

source: tableseg: not initialised
french: tableseg : non initialisé
italian: tableseg: non inizializzato

source: tablexseg: not initialised
french: tablexseg : non initialisé
italian: tablexseg: non inizializzato

source: vdelayk: not initialised
french: vdelayk : non initialisé
italian: vdelayk: non inizializzato

source: cella: invalid num of elements
french: cella : nombre d'éléments non valide
italian: cella: numero di elementi non valido

source: cella: invalid output table
french: cella : table de sortie non valide
italian: cella: tavola d'output non valida

source: cella: invalid initial state table
french: cella : table d'état initial non valide
italian: cella: tavola dello stato iniziale non valida

source: cella: invalid rule table
french: cella : table de règle non valide
italian: cella: tavola dei ruoli non valida

source: Invalid order %d
french: Ordre non valide %d

source: grain: grain length zero
french: grain : densité de grain non valide
italian: grain: lunghezza grain zero

source: grain: not initialised
french: grain : non initialisé
italian: grain: non inizializzato

source: granule_set: Unable to find function table
french: granule_set : impossible de trouver la table de fonction
italian: granule_set: Non riesco a trovare la tavola funzione

source: granule_set: Unable to find function table for envelope
french: granule_set : impossible de trouver la table de fonction pour l'enveloppe
italian: granule_set: Non riesco a trovare la tavola funzione per l'inviluppo

source: granule_set: Too many voices
french: granule_set : trop de voix
italian: granule_set: Troppe voci

source: granule_set: iratio must be greater then 0
french: granule_set : iratio doit être supérieur à 0
italian: granule_set: iratio deve essere maggiore di 0

source: granule_set: imode must be -1, 0 or +1
french: granule_set : imode doit valoir -1, 0 ou +1
italian: granule_set: imode deve essere -1, 0 o +1

source: granule_set: Illegal ithd, must be greater than zero
french: granule_set : ithd illégal, doit être supérieur à zéro
italian: granule_set: ithd non valido, deve essere maggiore di zero

source: granule_set: ipshift must be integer between 0 and 4
french: granule_set : ipshift doit être un entier entre 0 et 4
italian: granule_set: ipshift deve essere un intero tra 0 e 4

source: granule_set: Not enough voices for the number of pitches
french: granule_set : pas assez de voix pour le nombre de hauteurs
italian: granule_set: Non ci sono abbastanza voci per il numero di altezze

source: granule_set: ipitch1 must be greater then zero
french: granule_set : ipitch1 doit être supérieur à zéro
italian: granule_set: ipitch1 deve essere maggiore di zero

source: granule_set: ipitch2 must be greater then zero
french: granule_set : ipitch2 doit être supérieur à zéro
italian: granule_set: ipitch2 deve essere maggiore di zero

source: granule_set: ipitch3 must be greater then zero
french: granule_set : ipitch3 doit être supérieur à zéro
italian: granule_set: ipitch3 deve essere maggiore di zero

source: granule_set: ipitch4 must be greater then zero
french: granule_set : ipitch4 doit être supérieur à zéro
italian: granule_set: ipitch4 deve essere maggiore di zero

source: granule_set: must be positive and less than function table length
french: granule_set : doit être positif et inférieur à la longueur de la table de fonction
italian: granule_set: deve essere positivo e minore della lunghezza della tavola funzione

source: granule_set: igskip_os must be greater then 0
french: granule_set : igskip_os doit être supérieur à 0
italian: granule_set: igskip_os deve essere maggiore di 0

source: granule_set: kgap must be greater then 0
french: granule_set : kgap doit être supérieur à 0
italian: granule_set: kgap deve essere maggiore di 0

source: granule_set: igap_os must be 0%% to 100%%
french: granule_set : igap_os doit être entre 0%% et 100%%
italian: granule_set: igap_os deve essere da 0%% a 100%%

source: granule_set: kgsize must be greater then 0
french: granule_set : kgsize doit être supérieur à 0
italian: granule_set: kgsize deve essere maggiore di 0

source: granule_set: igsize_os must be 0%% to 100%%
french: granule_set : igsize_os doit être entre 0%% et 100%%
italian: granule_set: igsize_os deve essere da 0%% a 100%%

source: granule_set: Illegal value of iatt and/or idec
french: granule_set : valeur illégale de iatt et/ou de idec
italian: granule_set: valore di iatt e/o idec non valido

source: granule_set: Illegal combination of igskip and ilength
french: granule_set : combinaison illégale de igskip et de ilength
italian: granule_set: combinazione di igskip e ilength non valida

source: granule_set: WARNING * ilength may be too short * ilength should be greater than kgsize * max up pitch shift. Also, igsize_os and igskip_os should be taken into consideration. ilength is %f Sec, kgsize is %f Sec
french: granule_set : AVERTISSEMENT * ilength est peut être trop courte * ilength doit être supérieure à kgsize * max de la transposition de hauteur vers le haut. Il faut aussi prendre en considération igsize_os et igskip_os. ilength vaut %f sec, kgsize vaut %f sec
italian: granule_set: ATTENZIONE * ilength potrebbe essere troppo corto * ilength dovrebbe essere maggiore di kgsize * max up pitch shift. Anche, igsize_os e igskip_os dovrebbero essere presi in considerazione. ilength ?? %f Sec, kgsize ?? %f Sec

source: grain4: not initialised
french: grain4 : non initialisé
italian: grain4: non inizializzato
