Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: DSSI4CS: Unable to find ladspa_descriptor(%lu) function or dssi_descriptor(%lu) function in plugin file "%s". Are you sure this is a LADSPA or DSSI plugin file ?
french: DSSI4CS : impossible de trouver la fonction ladspa_descriptor(%lu) ou la fonction dssi_descriptor(%lu) dans le fichier de greffon "%s". Etes-vous sûr que c'est un fichier de greffon LADSPA ou DSSI ?
italian: DSSI4CS: Non trovo la funzione ladspa_descriptor(%lu) o la funzione dssi_descriptor(%lu) nel file plugin "%s". Sicuri che questo sia un file plugin LADSPA o DSSI ?

source: DSSI4CS: No plugin index %lu in %s
french: DSSI4CS : pas d'indice de greffon %lu dans %s
italian: DSSI4CS: Nessun indice %lu nel plugin in %s

source: DSSI4CS: Could not instantiate plugin: %s
french: DSSI4CS : impossible d'instancier le greffon : %s
italian: DSSI4CS: Non riesco ad istanziare il plugin: %s

source: DSSI4CS: No run() funtion in: %s
french: DSSI4CS : pas de fonction run() dans : %s

source: DSSI4CS: Invalid plugin: %i (MAX= %i).
french: DSSI4CS : greffon non valide : %i (MAX = %i).
italian: DSSI4CS: plugin: %i non valido (MAX= %i).

source: DSSI4CS: number of audio input channels is greater than %d
french: DSSI4CS : nombre de canaux audio en entrée supérieur à %d
italian: DSSI4CS: il numero di canali audio d'input ?? maggiore di %d

source: DSSI4CS: number of audio output channels is greater than %d
french: DSSI4CS : nombre de canaux audio en sortie supérieur à %d
italian: DSSI4CS: il numero di canali audio d'output ?? maggiore di %d

source: DSSI4CS: dssiaudio: Invalid plugin handle.
french: DSSI4CS : dssiaudio : descripteur de greffon non valide

source: DSSI4CS: Plugin '%s' has %i audio input ports audio input discarded.
french: DSSI4CS : le greffon '%s' a %i ports audio en entrée désactivés.
italian: DSSI4CS: Plugin '%s' ha %i porte audio input audio input scartato.

source: DSSI4CS: Plugin '%s' has %i audio input ports.
french: DSSI4CS : le greffon '%s' a %i ports audio en entrée.
italian: DSSI4CS: Plugin '%s' ha %i porte audio input.

source: DSSI4CS: Plugin '%s' has %i audio output ports.
french: DSSI4CS : le greffon '%s' a %i ports audio en sortie.
italian: DSSI4CS: Plugin '%s' ha %i porte audio output.

source: DSSI4CS: Invalid plugin handle.
french: DSSI4CS : descripteur de greffon non valide

source: DSSI4CS: Audio Rate control ports not implemented yet.
french: DSSI4CS : ports de contrôle du taux audio pas encore implémentés.
italian: DSSI4CS: porte di controllo ad Audio Rate non ancora implementate.

source: DSSI4CS: Port %lu from '%s' does not exist.
french: DSSI4CS : le port %lu de '%s' n'existe pas
italian: DSSI4CS: La porta %lu da '%s' non esiste.

source: DSSI4CS: Port %lu from '%s' is an output port.
french: DSSI4CS : le port %lu de '%s' est un port de sortie.
italian: DSSI4CS: La porta %lu da '%s' ?? una porta d'output.

source: DSSI4CS: Not initialised or wrong argument types.
french: DSSI4CS : non initialisé ou types d'argument incorrects.
italian: DSSI4CS: non inizializzato or wrong argument types.

source: DSSI4CS: dssinote not implemented yet.
french: DSSI4CS : dssinote pas encore implémentée
italian: DSSI4CS: dssinote non ancora implementato.

source: DSSI4CS: dssievent not implemented yet.
french: DSSI4CS : dssievent pas encore implémentée
italian: DSSI4CS: dssievent non ancora implementato.

source: DSSI4CS: LADSPA_PATH environment variable not set.
french: DSSI4CS : variable d'environnement LADSPA_PATH pas fixée.
italian: DSSI4CS: variabile d'ambiente LADSPA_PATH non impostata.

source: DSSI4CS: DSSI_PATH environment variable not set.
french: DSSI4CS : variable d'environnement DSSI_PATH pas fixée.
italian: DSSI4CS: variabile d'ambiente DSSI_PATH non impostata.

source: Failed to load plugin "%s": %s
french: Le chargement du plugin "%s" a échoué : %s
italian: Fallito caricamento del plugin "%s": %s

source: Unable to find ladspa_descriptor() function in plugin library file "%s": %s. Are you sure this is a LADSPA plugin file ?
french: Impossible de trouver la fonction ladspa_descriptor() dans le fichier de bibliothèque de plugin "%s" : %s. Etes-vous sûr que c'est un fichier de plugin LADSPA ?
italian: Nonriesco a trovare la funzione ladspa_descriptor() nel file della libreria del plugin "%s": %s. Sicuri questo sia un file plugin LADSPA ?

source: Unable to find ladspa_descriptor() function in plugin library file "%s". Are you sure this is a LADSPA plugin file ?
french: Impossible de trouver la fonction ladspa_descriptor() dans le fichier de bibliothèque de plugin "%s". Etes-vous sûr que c'est un fichier de plugin LADSPA ?
italian: Nonriesco a trovare la funzione ladspa_descriptor() nel file della libreria del plugin "%s". Sicuri questo sia un file plugin LADSPA ?

source: Unable to find label "%s" in plugin library file "%s".
french: Impossible de trouver l'étiquette "%s" dans le fichier de bibliothèque de plugin "%s".
italian: Non riesco a trovare la label "%s" nel file della libreria del plugin "%s".

source: beadsynt: phasetable not found
french: beadsynt : table de phase non trouvée !

source: beadsynt: wavetable not found
french: beadsynt : table d'onde non trouvée !

source: beadsynt: partial count > amptable size
french: beadsynt : nombre de partiels > taille de la table d'amplidude

source: beadsynt: freqtable not found!
french: beadsynt : table de fréq non trouvée !

source: beadsynt: partial count > freqtable size
french: beadsynt : nombre de partiels > taille de la table de fréq

source: beadsynt: bandwidth table not found
french: beadsynt : table de largeur de bande trouvée !

source: beadsynt: partial count > bandwidth size
french: beadsynt : nombre de partiels > taille de la table de largeurs de bande

source: beadsynt: wavetable not found!
french: beadsynt : table d'onde non trouvée !

source: The arrays should have 1 dimension
french: Les tableaux doivent être unidimensionnels

source: Amplitudes array is too small
french: Tableau d'amplitudes trop petit

source: Frequencies array is too small
french: Tableau de fréquences trop petit

source: bandwidths array is too small
french: tableau de largeurs de bande trop petit

source: beadsynt: not initialised
french: beadsynt : non initialisé

source: tabrowcopy: incorrect table number
french: tabrowcopy : numéro de table incorrect

source: tabrowcopy: iend cannot be bigger than numcols
french: tabrowcopy : iend ne peut pas dépasser numcols

source: tabrowcopy: Destination table too small
french: tabrowcopy : table de destination trop petite

source: >>>> tabrowlin: row %.4f > maxrow %d! It will be clipped
french: >>>> tabrowlin : ligne %.4f > maxrow %d ! Elle sera coupée

source: tabrowcopy: krow cannot be negative
french: tabrowcopy : krow ne peut pas être négatif

source: tabrowcopy: tab off end
french: tabrowcopy : tab hors-limite

source: tabrowlin: incorrect table number
french: tabrowlin : numéro de table incorrect

source: tabrowlin: iend cannot be bigger than numcols
french: tabrowlin : iend ne peut pas dépasser numcols

source: tabrowlin: end must be bigger than start
french: tabrowlin : la fin doit dépasser le début

source: tabrowlin: no items to copy
french: tabrowlin : aucun élément à copier

source: krow cannot be negative
french: krow ne peut pas être négatif

source: tab off end
french: tab hors-limite

source: The input array should be a 2D array
french: Le tableau d'entrée doit être bidimensionnel

source: Asked to read too many items from a row
french: Trop d'éléments demandés en lecture depuis une ligne

source: getrowlin: krow cannot be negative
french: getrowlin : krow ne peut pas être négatif

source: getrowlin: row %.4f > maxrow %d, clipping
french: getrowlin : row %.4f > maxrow %d, coupée

source: linlin.k: Division by zero
french: linlin.k : division par zéro
italian: linlin.k: Divisione per zero

source: linlin: Division by zero
french: linlin : division par zéro

source: lincos: Division by zero
french: lincos : division par zéro

source: bpf: data length should be even (pairs of x, y)
french: bpf : la longueur des données doit être paire (couples de x, y)

source: bpf: too many pargs (max=256)
french: bpf : trop de pargs (max=256)

source: expecting a char between A and G, but got %c
french: caractère a attendu entre A et G, mais %c obtenu
italian: ci si aspetta un carattere tra A e G, ma ottengo %c

source: format not understood, note: %s, notelen: %d
french: format non compris, note : %s, longNote : %d

source: cmp: unknown operator. Expecting <, <=, >, >=, ==, !=
french: cmp : opérateur incompris. <, <=, >, >=, == ou != attendu

source: cmp (ternary comparator): operator 2 expected <
french: cmp (comparateur ternaire) : opérateur 2 attendu <

source: cmp (ternary comparator): operator 1 expected <
french: cmp (comparateur ternaire) : opérateur 1 attendu <

source: Table %d not found
french: La table %d n'a pas été trouvée

source: Table not set
french: la table n'est pas fixée

source: tab2array: cannot copy a negative number of items
french: tab2array : impossible de copier un nombre négatif d'items

source: reshapearray: neither numcols nor numrows can be negative
french: reshapearray : ni numcols ni numrows ne peut être négatif

source: Arrays of more than 2 dimensions are not supported yet
french: Les tableaux à plus de 2 dimensions ne sont pas supportés

source: reshapearray: The number of items do not match.The array has %d elements, but the new shaperesults in %d total elements
french: reshapearray : le nombre d'éléments ne correspond pas. Le tableau a %d elements, mais le nouveau format résulte en un total de %d éléments

source: reshapearray: cannot reshape
french: reshapearray : reformatage impossible

source: cannot print multidimensional string arrays
french: impossible d'afficher des tableaux de chaînes de caractères multidimensionnels

source: only 1-D and 2-D arrays supported, got %d dimensions
french: seuls les tableaux 1D et 2D sont supportés, %d dimensiions reçues

source: type not supported for printing: %s
french: type non supporté à l'affichage : %s

source: Could not handle start index: %d
french: Impossible de traiter l'index de départ : %d

source: Could not handle end index: %d
french: Impossible de traiter l'index de fin : %d

source: lastcycle: adding an extra cycle to the duration of the event
french: lastcycle: ajout d'un cycle supplémentaire à la durée de l'évènement

source: lastcycle: no extra time defined, turnoff2 will not be detected
french: lastcycle : pas de temps supplémentaire défini, turnoff2 ne sera pas détecté

source: Error while inititalizing println
french: Erreur lors de l'initialisation de println

source: Opcode %s not initialized
french: Opcode %s non initialisé

source: String argument expected, but type is %s
french: Chaîne de caractères attendue, mais le type est %s

source: println/printsk: Allocating extra memory for output string
french: println/printsk : allocation de plus de mémoire pour la chaîne de sortie

source: Allocating extra memory for output string
french: Allocation de plus de mémoire pour la chaîne de sortie

source: Array should be of 1D, but has %d dimensions
french: Le tableau devrait être 1D, mais il a %d dimensions

source: insufficient arguments for fareytable
french: arguments insuffisants pour une table de Farey
italian: argomenti insufficienti per fareytable

source: Illegal table size
french: Longueur de table illégale

source: Farey: Table no. < 1 dft=%.2f sft=%.2f
french: Farey : No de table < 1 dft=%.2f sft=%.2f
italian: Farey: Tavola no. < 1 dft=%.2f sft=%.2f

source: Farey: Filter type < 1 ftype=%.2f
french: Farey : type de filtre < 1 ftype=%.2f
italian: Farey: tipo filtro < 1 ftype=%.2f

source: Farey: Destination dft table %.2f not found.
french: Farey : Table dft de destination %.2f introuvable
italian: Farey: Tavola %.2f di destinazione dft non trovata.

source: Farey: Source sft table %.2f not found.
french: Farey : Table sft source %.2f introuvable
italian: Farey: Tavola %.2f sorgente sft non trovata.

source: Farey: Filter type < 1
french: Farey : Type de filtre < 1
italian: Farey: tipo filtro < 1

source: Table no. < 1 sft=%.2f
french: Numéro de table < 1 sft=%.2f
italian: Tavola no. < 1 sft=%.2f

source: Source sft table %.2f not found.
french: La table %.2f de la source sft n'a pas été trouvée
italian: Tavola %.2f sorgente sft non trovata.

source: Faust compilation problem: line %s
french: Problème de compilation de Faust : ligne %s

source: could not find DSP %p for deletion
french: impossible de trouver le DSP %p pour suppression

source: Faust code was not ready. Try compiling it in a separate instrument prior to running it here
french: Le code Faust n'était pas prêt. Essayez de le compiler dans un instrument séparé avant de l'exécuter ici

source: Faust code did not compile properly. Check above messages for Faust compiler errors
french: Le code Faust n'a pas été compilé proprement. Verifier ci-dessus les messages d'erreur du compilateur Faust

source: no factory available
french: aucune fabrique n'est disponible

source: factory not found %d
french: fabrique non trouvée %d

source: Faust instantiation problem
french: Problème d'instanciation de Faust

source: no dsp instances available
french: aucune iinstance de DSP n'est disponible

source: dsp instance not found %d
french: instance de DSP introuvable %d

source: wrong number of input args
french: nombre incorrect d'arguments en entrée

source: wrong number of output args
french: nombre incorrect d'arguments en sortie

source: Faust compilation problem: %s
french: Problème de compilation de Faust : %s

source: wrong number of output args: need %d had %d
french: nombre incorrect d'arguments en sortie : %d requis %d fournis

source: dsp control %s not found
french: contrôle de DSP %s introuvable

source: Filter order out of bounds: (1 <= nb < 51, 0 <= na <= 50)
french: Ordre du filtre hors limites : (1 <= nb < 51, 0 <= na <= 50)
italian: Ordine del filtro fuori dai limiti: (1 <= nb < 51, 0 <= na <= 50)

source: too many iterations in laguer
french: trop d'itérations dans laguer
italian: troppe iterazioni in laguer

source: wguide2 xfreq1 and xfreq2 arguments must be both a-rate or k and i-rate
french: wguide2 : les arguments xfreq1 et xfreq2 doivent être tous les deux de taux-a ou de taux-k et i
italian: wguide2 gli argomenti xfreq1 e xfreq2 devono essere entrambe a a-rate o k e i-rate

source: error allocating fluid engine
french: erreur à l'allocation du moteur fluid

source: fluid: unable to load %s
french: fluid : impossible d'ouvrir le fichier %s

source: result: %d Note off: c:%3d k:%3d
french: résultat : %d Note off : c:%3d k:%3d

source: Illegal Interpolation Method: Must be either 0, 1, 4, or 7.
french: Méthode d'interpolation illégale : doit valoir 0, 1, 4 ou 7.

source: No table for VibWaveato
french: Pas de table pour VibWaveato
italian: Nessuna tavola per VibWaveato

source: No table for FM4Op
french: Pas de table pour FM40p
italian: Nessuna tavola per FM4Op

source: follow - zero length!
french: follow - longueur nulle !
italian: follow - lunghezza zero!

source: Closing file '%s'...
french: Fermeture du fichier '%s'...
italian: Chiusura file '%s'...

source: invalid file handle
french: descripteur de fichier non valide

source: invalid file name
french: nom de fichier non valide
italian: nome file non valido

source: error opening file '%s'
french: erreur en ouvrant le fichier '%s'
italian: errore in apertura file '%s'

source: error opening sound file '%s'
french: erreur en ouvrant le fichier son '%s'
italian: errore in apertura sound file '%s'

source: cannot close '%s': not found in list of open files
french: impossible de fermet '%s' : il n'a pas été trouvé dans la liste des fichiers ouverts
italian: impossibile chiudere '%s': non si trova nella lista dei file aperti

source: cannot close file #%d: not a valid handle
french: impossible de fermer le fichier #%d : ce n'est pas un descripteur valide

source: file #%d (%s) is in use, will be closed when released
french: le fichier #%d (%s) est utilisé, il sera fermé à sa libération
italian: file #%d (%s) in uso, sar?? chiuso quando rilasciato

source: fouti: invalid file handle
french: fouti : descripteur de fichier non valide

source: framebuffer: Error, specified element count less than ksmps value, Exiting
french: framebuffer : erreur, nombre d'éléments spécifiés inférieur à ksmps, sortie
italian: framebuffer: Errore, l'elemento specificato conta meno del valore di ksmps, Esco

source: framebuffer: Error, only k-rate arrays allowed for a-rate var inputs, Exiting
french: framebuffer : erreur, seuls les tableaux de taux-k sont permis pour les vars de taux-a en entrée, sortie
italian: framebuffer: Errore, solo array k-rate sono permessi per variabili input a-rate, Esco

source: framebuffer: Error, only a-rate vars allowed for k-rate array inputs, Exiting
french: framebuffer : erreur, seules les vars de taux-a sont autorisées pour des tableaux de taux-k en entrée, sortie
italian: framebuffer: Errore, solo variabili a-rate sono permesse per input all'array k-rate, Esco

source: framebuffer: Error, k-rate array input must be one dimensional, Exiting
french: framebuffer : erreur, un tableau de taux-k en entrée doit être unidimensionnel , sortie
italian: framebuffer: Errore, input array k-rate deve essere unidimensionale, Esco

source: framebuffer: Error, k-rate array input element count must be less than or equal to specified framebuffer size, Exiting
french: framebuffer : erreur, le nombre d'éléments d'un tableau de taux-k en entrée doit être inférieur ou égal à la taille du framebuffer spécifiée, sortie
italian: framebuffer: Errore, il conto degli elementi dell'array input a k-rate deve essere minore o uguale alla dimensione specificata del framebuffer, Esco

source: framebuffer: Error, only a-rate var input with k-rate array output or k-rate array input with a-rate var output are valid arguments, Exiting
french: framebuffer : erreur, seules une var de taux-a en entrée avec un tableau de taux-k en sortie ou un tableau de taux-k en entrée avec une var de taux-a en sortie sont des arguments valides, sortie
italian: framebuffer: Errore, solo a-rate var input con k-rate array output o k-rate array input con a-rate var output sono argomenti validi, Esco

source: olabuffer: Error, overlap factor must be an integer
french: olabuffer : erreur, le taux de superposition doit être entier
italian: olabuffer: Errore, il fattore di overlap deve essere un intero

source: olabuffer: Error, k-rate array must be one dimensional
french: olabuffer : erreur, le tableau de taux-k doit être unidimensionnel
italian: olabuffer: Errore, array k-rate deve essere unidimensionale

source: olabuffer: Error, k-rate array size must be larger than ovelap factor
french: olabuffer : erreur, la taille du tableau de taux-k doit être supérieure au facteur de superposition
italian: olabuffer: Errore, la lunghezza dell'array k-rate deve essere maggiore del fattore di ovelap

source: olabuffer: Error, overlap factor must be an integer multiple of k-rate array size
french: olabuffer : erreur, le facteur de superposition doit être un multiple entier de la taille du tableau de taux-k
italian: olabuffer: Errore, il fattore di overlap deve essere un intero multiplo della lunghezza dell'array k-rate

source: olabuffer: Error, k-rate array size divided by overlap factor must be larger than or equal to ksmps
french: olabuffer : erreur, la taille du tableau de taux-k divisée par le facteur de superposition doit être supérieure ou égale à ksmps
italian: olabuffer: Errore, lunghezza array k-rate diviso il fattore di overlap deve essere maggiore o uguale a ksmps

source: freeverb: not initialised
french: freeverb : non initialisé
italian: freeverb: non inizializzato

source: ftconv: invalid number of channels
french: ftconv : nombre de canaux non valide
italian: ftconv: numero di canali non valido

source: ftconv: invalid impulse response partition length
french: ftconv : longueur de partition de la réponse impulsionnelle non valide
italian: ftconv: lunghezza della partizione dell'impulse response non valida

source: ftconv: invalid length, or insufficient IR data for convolution
french: ftconv : longueur non valide, ou pas assez de données de RI pour la convolution
italian: ftconv: lunghezza non valida, o dati IR insufficienti per convolution

source: ftconv: not initialised
french: ftconv : non initialisé
italian: ftconv: non inizializzato

source: Illegal zero table size
french: Longueur de table nulle illégale

source: Illegal zero table size %d
french: Longueur de table nulle illégale %d

source: ftable number does not exist
french: le numéro de ftable n'existe pas

source: Error deleting ftable %d
french: Erreur en supprimant la ftable %d
italian: Errore cancellazione ftable %d

source: ftgen string arg not allowed
french: ftgen : argument chaîne interdit
italian: ftgen argomento stringa non permesso

source: ftgen error
french: erreur de ftgen
italian: errore ftgen

source: Invalid table number: %d
french: Numéro de table non valide : %d
italian: numero di tavola non valida: %d

source: table length too long
french: taille de table trop grande
italian: dimensione della tavola troppo grande

source: ftload: error allocating ftable
french: ftload : erreur d'allocation de la ftable
italian: ftload: errore allocazione ftable

source: ftload: no table numbers
french: ftload : pas de numéro de table
italian: ftload: nessun numero di tavola

source: ftload: unable to open file
french: ftload : impossible d'ouvrir le fichier
italian: ftload: non riesco ad aprire il file

source: ftload: incorrect file
french: ftload : fichier incorrect
italian: ftload: file non corretto

source: ftsave: Bad table number. Saving is possible only for existing tables.
french: ftsave : mauvais numéro de table. La sauvegarde n'est possible que pour des tables existantes.
italian: ftsave: Numero di tavola sbagliato. E' possibile salvare solo tavole esistenti.

source: ftsave: no table numbers
french: ftsave : pas de numéros de table
italian: ftsave: nessun numero di tavola

source: ftsave: unable to open file
french: ftsave : impossible d'ouvrir le fichier
italian: ftsave: non riesco ad aprire il file

source: ftsave: failed to write file
french: ftsave : impossible d'ouvrir le fichier
italian: ftsave: fallita scrittura del file

source: Cannot load file. Error opening directory: %s
french: Impossible de charger le fichier. Erreur d'ouverture du répertoire : %s

source: Error: you must pass a directory as a string.
french: Erreur : il faut donner le nom d'un répertoire.

source: Error: second parameter to directory must be a string
french: Erreur : le second paramètre du répertoire doit être une chaîne

source: Cannot find directory. Error opening directory: %s
french: Répertoire introuvable. Erreur d'ouverture du répertoire : %s

source: fastab: incorrect table number
french: fastab : numéro de table incorrect
italian: fastab: numero di tavola non corretto

source: tabw off end
french: tabw hors-limite

source: tab off end %i
french: tab hors-limite %i

source: tab_i: incorrect table number
french: tab_i : numéro de table incorrect
italian: tab_i: numero di tavola non corretto

source: tab_i off end: table number: %d
french: tab_i hors-limite : numéro de table : %d
italian: tab_i off end: numero di tavola: %d

source: tabw_i: incorrect table number
french: tabw_i : numéro de table incorrect
italian: tabw_i: numero di tavola non corretto

source: tabw_i off end
french: tabw_i hors-limite

source: tab off end %d
french: tab hors-limite %d

source: tab_init: incorrect table number
french: tab_init : numéro de table incorrect
italian: tab_init: numero di tavola non corretto

source: adsynt2: wavetable not found!
french: adsynt2 : la table d'onde n'a pas été trouvée !
italian: adsynt2: wavetable non trovata!
