Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: sfinstr: instrument out of range
french: sfinstr : instrument hors limites
italian: sfinstr: strumento fuori intervallo

source: SoundFont file "%s" contains ROM samples ! At present time only RAM samples are allowed by sfload. Session aborted !
french: Le fichier SoundFont "%s" contient des échantillons en ROM ! Actuellement sfload n'autorise que les échantillons en RAM. Session annulée !
italian: Il file SoundFont "%s" contiene campioni ROM ! Al momento solo campioni RAM sono consentiti in sfload. Sessione abortita !

source: Sfont: cannot use globals/
french: Sfont : impossible d'utiliser des variables globales/
italian: Sfont: non posso usare le globali/

source: Sfont format not compatible
french: Sfont : format non compatible
italian: Sfont formato non compatibile

source: error... could not create sfont globals
french: erreur... impossible de créer les globales de sfont
italian: errore... non posso creare le globali sfont

source: powershape: ifullscale must be strictly positive
french: powershape : la ftable ifullscale doit être entirèrement positive
italian: powershape: ifullscale deve essere strettamente posotivo

source: Created instance 0x%x of %d instances of outlet %s
french: Création de l'instance 0x%x des %d instances de l'outlet %s

source: Removed instance 0x%x of %d instances of outleta %s
french: Suppression de l'instance 0x%x des %d instances de l'outleta %s

source: Created instance 0x%x of inlet %s
french: Création de l'instance 0x%x de l'inlet %s

source: Connected instances of outlet %s to instance 0x%x of inlet %s.
french: Instances de l'outlet %s connectées à l'instance 0x%x de l'inlet %s.

source: Removed 0x%x of %d instances of outletk %s
french: Suppression de 0x%x des %d instances de l'outletk %s

source: Connected instances of outlet %s to instance 0x%xof inlet %s.
french: Instances de l'outlet %s connectées à l'instance 0x%x de l'inlet %s.

source: Created instance 0x%x of outlet %s
french: Création de l'instance 0x%x de l'outlet %s

source: Removed 0x%x of %d instances of outletf %s
french: Suppression de 0x%x des %d instances de l'outletf %s

source: inletf: signal format must be amp-phase or amp-freq.
french: inletf : le format de signal doit être amp-phase ou amp-fréq.

source: Created instance 0x%x of %d instances of outlet %s (out arraydat: 0x%x dims: %2d size: %4d [%4d] data: 0x%x (0x%x))
french: Création de l'instance 0x%x des %d instances de l'outlet %s (out arraydat: 0x%x dims: %2d taille: %4d [%4d] données: 0x%x (0x%x))

source: Removed 0x%x of %d instances of outletv %s
french: Sppression de 0x%x des %d instances de l'outletv %s

source: Created instance 0x%x of inlet %s (in arraydat: 0x%x dims: %2d size: %4d [%4d] data: 0x%x (0x%x))
french: Instance 0x%x de l'inlet %s créée (dans arraydat : 0x%x dims: %2d taille: %4d [%4d] données: 0x%x (0x%x))

source: Connected instances of outlet %s to instance 0x%x of inlet %s
french: Instances de l'outlet %s connectées à l'instance 0x%x de l'inlet %s

source: Removed 0x%x of %d instances of outletkid %s
french: Suppression de 0x%x des %d instances de l'outletkid %s

source: Connected outlet %s to inlet %s.
french: Outlet %s connectée à l'inlet %s.

source: ftgenonce: re-using existing func: %f
french: ftgenonce : réutilisation d'une fonction existante : %f

source: ftgenonce error
french: erreur ftgenonce

source: ftgenonce: created new func: %d
french: ftgenonce : nouvelle fonction créée : %d

source: No table for Modulatr
french: Aucune table pour Modulatr
italian: Nessuna tavola per Modulatr

source: No table for Singwave
french: Aucune table pour Singwave
italian: Nessuna tavola per Singwave

source: Found Formant: %s (number %i)
french: Le formant %s (numéro %i) a été trouvé
italian: Trovata Formante: %s (numero %i)

source: This note is too high!!
french: Cette note est trop haute !!
italian: Questa nota ?? troppo alta!!

source: Setting Phoneme: %d %f
french: Fixation du phonème : %d %f
italian: Impostato Phoneme: %d %f

source: crossfade cannot be longer than loop
french: crossfade plus long que la durée de la boucle
italian: crossfade non pu?? essere pi?? lunga del loop

source: function table not found
french: table de fonction non trouvée
italian: tavola funzione non trovata

source: crossfade longer than loop duration
french: crossfade plus long que la durée de la boucle
italian: crossfade pi?? lunga della durata del loop

source: function table channel count does not match output
french: Le nombre de canaux de tables de fonction ne correspond pas à la sortie
italian: Il conto dei canali della tavola funzione non combacia con l'output

source: start time beyond end of table
french: date de début au-delà de la fin de la table
italian: tempo di start oltre la fine della tavola

source: table not long enough for loop
french: table pas assez longue pour une boucle
italian: la tavola non ?? abbastanza lunga per il loop

source: function table channels do not match opcode outputs
french: les canaux de tables de fonction ne correspondent pas aux sorties
italian: I canali della tavola funzione non combaciano con l'output dell'opcode

source: table %d invalid
french: table %d non valide
italian: tavola %d non valida

source: pvsarp: signal format must be amp-phase or amp-freq.
french: pvsarp : le format du signal doit être amp-phase ou amp-fréq.
italian: pvsarp: il formato del segnale deve essere amp-phase o amp-freq.

source: pvsarp: not initialised
french: pvsarp : non initialisé
italian: pvsarp: non inizializzato

source: signal format must be amp-phase or amp-freq.
french: le format du signal doit être amp-phase ou amp-fréq.
italian: il formato del segnale deve essere amp-phase o amp-freq.

source: pvsvoc: not initialised
french: pvsvoc : non initialisé
italian: pvsvoc: non inizializzato

source: pvsmorph: not initialised
french: pvsmorph : non initialisé
italian: pvsmorph: non inizializzato

source: SNDWARP at last sample frame
french: SNDWARP arrivé à la dernière trame

source: sndwarp: not initialised
french: sndwarp : non initialisé
italian: sndwarp: non inizializzato

source: Wrong number of outputs in sndwarpst; must be 2 or 4
french: Nombre de sorties incorrect dans sndwarpst ; doit valoir 2 ou 4
italian: Numero sbagliato di output in sndwarpst; deve essere 2 o 4

source: sndwarpst: not initialised
french: sndwarpst : non initialisé
italian: sndwarpst: non inizializzato

source: OSCraw: Closing socket
french: OSCraw : fermeture du socket
italian: OSCraw: Chiusura socket

source: Winsock2 failed to start: %d
french: Le démarrage de winsock2 a échoué : %d
italian: Fallito avvio di Winsock2: %d

source: Cannot set nonblock
french: Impossible de positionner nonblock
italian: Non posso impostare nonblock

source: creating socket
french: création du socket
italian: creazione socket

source: socket failed with error: %ld
french: échec de socket avec l'erreur : %ld

source: bind failed (%d)
french: la liaison a échoué (%d)

source: listen failed (%d)
french: l'écoute a échoué (%d)

source: accept failed (%d)
french: l'acceptation a échoué (%d)

source: read from socket failed
french: la lecture depuis le socket a échoué
italian: lettura dal socket fallita

source: output array too small
french: tableau de sortie trop petit
italian: array d'output troppo piccolo

source: sendto failed
french: sendto a échoué
italian: sendto fallito

source: string truncated in socksend
french: chaîne tronquée dans socksend
italian: stringa troncata in socksend

source: connect failed (%d)
french: la connexion a échoué (%d)
italian: connect fallito (%d)

source: Expected %d got %d
french: %d attendu, %d obtenu
italian: Atteso %d ottengo %d

source: insufficient number of arguments for OSC message types
french: arguments insuffisants pour les types de message OSC
italian: numero di argomenti insufficienti per il tipo di messaggio OSC

source: expecting a string argument
french: argument chaîne de caractères attendu
italian: ci si aspetta un argomento stringa

source: %c: data type not supported
french: %c : type de donnée non supporté
italian: %c: tipo di dato non supportato

source: OSCsend failed to send message with destination %s to %s:%d
french: OSCsend n'a pas pu envoyer un message avec destination %s vers %s :%d

source: arg array needs to be two dimensional
french: l'arg tableau doit être à bidimensionnel

source: type and dest arrays need to be unidimensional
french: les tableaux de type et de dest doivent être unidimensionnels

source: type and dest arrays need to have the same size
french: les tableaux de type et de dest doivent avoir la même taille

source: arg array not big enough
french: l'arg tableau n'est pas assez grand

source: Bundle msg exceeded max packet size, not sent
french: Le paquet msg dépasse la taille maximale, pas envoyé

source: only bundles with i and f types are supported
french: seuls les paquets avec les types i et f sont supportés

source: OSCbundle failed
french: OSCbundle a échoué

source: space: not initialised
french: space : non initialisé
italian: space: non inizializzato

source: spdist: not initialised
french: spdist : non initialisé
italian: spdist: non inizializzato

source: spat3d: not initialised
french: spat3d : non initialisé
italian: spat3d: non inizializzato

source: spat3di: not initialised
french: spat3di : non initialisé
italian: spat3di: non inizializzato

source: illegal Q value
french: valeur de Q illégale
italian: valore Q illegale

source: unknown dbout code
french: code de dbout inconnu

source: spectrum: %s window, %s out, making tables ...
french: spectrum : fenêtre %s, sortie %s, fabrication des tables ...

source: high cps %7.1f low cps %7.1f
french: cps haut %7.1f cps bas %7.1f

source: Q %4.1f uses a %d sample window each octdown
french: Q %4.1f utilise une fenêtre de %d échantillons à chaque octave descendante

source: spectrum windowed sines:
french: spectrum : sinus fenêtrées :

source: %d oct analysis window delay = %<PRIi32> samples (%d msecs)
french: le délai de la fenêtre d'analyse de l'oct %d = %<PRIi32> échantillons (%d ms)

source: octdown buffers:
french: tampons d'octaves descendantes :

source: specdisp: not initialised
french: specdisp : non initialisé
italian: specdisp: non inizializzato

source: instr %d %s, dft (%s), %d octaves (%d - %d Hz):
french: instr %d %s, tfd (%s), %d octaves (%d - %d Hz) :

source: instr %d %s, dft (%s), %d octaves (%3.1f - %3.1f Hz):
french: instr %d %s, tfd (%s), %d octaves (%3.1f - %3.1f Hz) :

source: per oct rolloff too steep
french: pente par octave trop raide

source: specptrk: %d freqs, %d%s ptls at
french: specptrk : %d fréqs, %d%s partiels à

source: odd
french: impair

source: rolloff vals:
french: valeurs de rolloff :

source: specptrk: not initialised
french: specptrk : non initialisé
italian: specptrk: non inizializzato

source: specsum: not initialised
french: specsum : non initialisé
italian: specsum: non inizializzato

source: inputs have different sizes
french: les entrées ont des tailles différentes
italian: gli inputs hanno dimensioni differenti

source: inputs have diff. time periods
french: les entrées ont des périodes temporelles différentes
italian: gli inputs hanno differenti periodi di tempo

source: inputs have different freq resolution
french: les entrées ont des résolutions en fréquence différentes
italian: gli inputs hanno differenti risoluzioni di frequenza

source: inputs have different amptypes
french: les entrées ont des types d'amplitude différents
italian: gli inputs hanno differenti amptypes

source: specaddm: not initialised
french: specaddm : non initialisé
italian: specaddm: non inizializzato

source: specdiff: local buffers not initialised
french: specdiff: tampons locaux non initialisés
italian: specdiff: local buffers non inizializzato

source: specdiff: not initialised
french: specdiff : non initialisé
italian: specdiff: non inizializzato

source: specscal: local buffer not initialised
french: specscal: tampon local non initialisé
italian: specscal: local buffer non inizializzato

source: missing fscale table
french: la table de fscale est manquante
italian: tavola fscale mancante

source: specscal: not initialised
french: specscal : non initialisé
italian: specscal: non inizializzato

source: spechist: local buffers not initialised
french: spechist : tampons locaux non initialisés
italian: spechist: local buffers non inizializzato

source: spechist: not initialised
french: spechist : non initialisé
italian: spechist: non inizializzato

source: specfilt: local buffers not initialised
french: specfilt: tampons locaux non initialisés
italian: specfilt: local buffers non inizializzato

source: missing htim ftable
french: la ftable htim est manquante
italian: tavola htim mancante

source: htim ftable must be all-positive
french: la ftable htim doit être entirèrement positive
italian: htim ftable deve essere tutta positiva

source: coef range: %6.3f - %6.3f
french: intervalle de coef : %6.3f - %6.3f
italian: intervallo coef: %6.3f - %6.3f

source: specfilt: not initialised
french: specfilt : non initialisé
italian: specfilt: non inizializzato

source: squinewave iminsweep range 4 to sr/100. Set to default %d
french: squinewave iminsweep compris entre 4 et sr/100. Mis à %d par défaut

source: fsig = : source signal is not initialised
french: fsig = : le signal source n'est pas initialisé
italian: fsig = : source signal is non inizializzato

source: Error allocating argument stack
french: Erreur lors de l'allocation de la pile d'arguments
italian: Errore nell'allocazione dell'argomento nello stack

source: the stack is already allocated
french: la pile est déjà allouée
italian: lo stack ?? gia allocato

source: no table %g
french: pas de table %q

source: stdopcod.c: error: globals already allocated
french: stdopcod.c : erreur : les variables globales sont déjà allouées
italian: stdopcod.c: errore: globali gi?? allocate

source: STK opcodes not available: define environment variable RAWWAVE_PATH (points to rawwaves directory) to use STK opcodes.
french: Opcodes STK non disponibles : il faut définir la variable d'environnement RAWWAVE_PATH (pointant sur le répertoire des rawwaves) pour utiliser les opcodes STK.

source: grain size smaller than 1 sample
french: la taille de grain est inférieure à 1 échantillon
italian: dimensione grain minore di 1 campione

source: diskgrain: invalid number of channels
french: diskgrain : nombre de canaux non valide
italian: diskgrain: numero di canali non valido

source: diskgrain: could not open file: %s
french: diskgrain : impossible d'ouvrir le fichier %s
italian: diskgrain: non riesco ad aprire il file: %s

source: diskgrain: soundfile channel numbers do not match the number of outputs
french: diskgrain : le nombre de canaux du fichier son ne correspond pas au nombre de sorties
italian: diskgrain: il numero canali del soundfile non combacia col numero degli outputs

source: diskgrain: could not read file
french: diskgrain : impossible de lire le fichier
italian: diskgrain: non posso leggere il file

source: tabsum: No table
french: tabsum : pas de table
italian: tabsum: Nessuna tavola

source: tabsum: Not initialised
french: tabsum : non initialisé
italian: tabsum: non inizializzato

source: illegal value for iolaps
french: valeur de iolaps illégale

source: fof: not initialised
french: fof : non initialisé
italian: fof: non inizializzato

source: FOF needs more overlaps
french: FOF a besoin de plus de chevauchements
italian: FOF necessita maggiore overlaps

source: Minimum frequency too low
french: Fréquence minimale trop basse
italian: Frequenza minima troppo bassa

source: Period zero
french: Période zéro

source: harmon out of range...
french: harmon : hors limites...
italian: harmon fuori intervallo...

source: harmon out of range
french: harmon : hors limites
italian: harmon fuori intervallo

source: pvoc: not initialised
french: pvoc : non initialisé
italian: pvoc: non inizializzato

source: PVOC cannot load %s
french: PVOC ne peut pas charger %s
italian: PVOC non posso caricare %s

source: CONVOLVE cannot load %s
french: CONVOLVE ne peut pas charger %s
italian: CONVOLVE non posso caricare %s

source: %s not a CONVOLVE file (magic %<PRIi32>)
french: %s n'est pas un fichier CONVOLVE (magic %<PRIi32>)
italian: %s non ?? un file CONVOLVE (magic %<PRIi32>)

source: CONVOLVE: output channels not equal to number of channels in source
french: CONVOLVE : canaux de sortie différents du nombre de canaux dans la source
italian: CONVOLVE: numero di canali output diverso dal numero di canali in source

source: CONVOLVE: channel number greater than number of channels in source
french: CONVOLVE : nombre de canaux supérieur au nombre de canaux dans la source
italian: CONVOLVE: numero di canali maggiore del numero di canali in source

source: unsupported CONVOLVE data format %<PRIi32> in %s
french: format de données CONVOLVE %<PRIi32> dans %s non supporté
italian: formato dati CONVOLVE non supportato %<PRIi32> in %s

source: convolve: not initialised
french: convolve : non initialisé
italian: convolve: non inizializzato

source: channel request %d illegal
french: demande de canal %d illégale
italian: canale richiesto %d illecito

source: pconvolve: error while impulse file
french: pconvolve : erreur du fichier de réponse impulsionnelle

source: SR zero
french: Zéro SR

source: analyzing %ld sample frames (%3.1f secs)
french: analyse de %ld trames d'échantillons (%3.1f secs)

source: PCONVOLVE: number of output channels not equal to input channels
french: PCONVOLVE : le nombre de canaux de sortie est différent de celui des canaux d'entrée
italian: PCONVOLVE: numero di canali output diverso dal numero di canali input

source: IR srate != orch's srate
french: taux d'échantillonnage IR != sr de l'orch

source: PCONVOLVE: less sound than expected!
french: PCONVOLVE: moins de son que ce qui était attendu !
italian: PCONVOLVE: meno suono di quanto aspettato!

source: bad imode value
french: valeur de imode incorrecte
italian: pessimo valore di imode

source: Min and max the same
french: Min et max sont les mêmes
italian: Min e max sono gli stessi

source: table not found in poscil
french: table introuvable dans poscil
italian: tavola non trovata in poscil

source: poscil: not initialised
french: poscil : non initialisé
italian: poscil: non inizializzato

source: poscil3: not initialised
french: poscil3 : non initialisé
italian: poscil3: non inizializzato

source: losc: no sample rate stored in function assuming=sr
french: losc : pas de taux d'échantillonnage dans la fonction, on suppose qu'il est égal à sr
italian: losc: nessuna sample rate nella funzione assumo=sr

source: illegal reson iscl value: %f
french: valeur illégale de iscl de reson : %f
italian: valore di iscl di reson illegale : %f

source: loop cannot be zero
french: une boucle ne peut pas être nulle
italian: loop non pu?? essere zero

source: loop opcode: wrong argument count
french: opcode de boucle : mauvais compteur
italian: loop opcode: conto degli argomenti sbagliato

source: vibrato@ Phase out of range
french: vibrato@ Phase hors limites
italian: vibrato@ Fase fuori intervallo

source: vibrato(krate): not initialised
french: vibrato(taux-k) : non initialisé
italian: vibrato(krate): non inizializzato

source: No table for dconv
french: Pas de table pour dconv
italian: Nessuna tavola per dconv

source: could not allocate memory
french: impossible d'allouer la mémoire
italian: non posso allocare memoria

source: vcomb: not initialised
french: vcomb : non initialisé
italian: vcomb: non inizializzato

source: valpass: not initialised
french: valpass : non initialisé
italian: valpass: non inizializzato

source: iresfn for ftmorf does not exist
french: ftmorf : iresfn n'existe pas
italian: non esiste iresfn per ftmorf

source: iftfn for ftmorf does not exist
french: iftfn pour ftmorf n'existe pas
italian: non esiste iftfn per ftmorf

source: table in iftfn for ftmorf wrong size
french: ftmorf : la table iftfn n'a pas la bonne taille
italian: tavola di dimensione sbagliata in iftfn per ftmorf

source: table in iftfn for ftmorf does not exist
french: ftmorf : la table iftfn n'existe pas
italian: non esiste la tavola in iftfn per ftmorf

source: %s: Ats file %s not read (does it exist?)
french: %s : le fichier ATS %s n'a pas été lu (existe-t-il ?)

source: %s: either %s is not an ATS file or the byte endianness is wrong
french: %s : soit %s n'est pas un fichier ATS soit l'endianness est incorrect

source: %s: %s is byte-swapped no future byte-swapping warnings will be given, byte-swapped files will not result in different audio, but they may slow down processing.
french: %s : %s est en octets inversés aucun avertissement sur l'inversion d'octets ne sera donné par la suite, les fichiers en octets inversés ne produiront pas de résultat audio différent, mais leur traitement pourra être plus lent.

source: ATSINFO: location is out of bounds: 0-8 are the only possible selections
french: ATSINFO : emplacement hors limites : les seules sélections possibles sont 0-8

source: ATSREAD: partial %i out of range, max allowed is %i
french: ATSREAD : le partiel %i est hors limites, la valeur max autorisée est %i

source: Type not implemented
french: Type non implémenté

source: ATSREAD: only positive time pointer values allowed, setting to zero
french: ATSREAD : seules les valeurs de pointeur temporel positives sont admises, fixée à zéro

source: ATSREAD: timepointer out of range, truncated to last frame
french: ATSREAD : pointeur temporel hors limites, tronqué à la dernière trame

source: ATSREAD: not initialised
french: ATSREAD : non initialisé
italian: ATSREAD: non inizializzato

source: ATSREADNZ: band %i out of range, 1-25 are the valid band values
french: ATSREADNZ : bande %i hors limite, les valeurs de bande valides sont 1-25

source: ATSREADNZ: Type either not implemented or does not contain noise
french: ATSREADNZ : soit le type n'est pas implémenté soit il ne contient pas de bruit

source: ATSREADNZ: only positive time pointer values allowed, setting to zero
french: ATSREADNZ : seules les valeurs de pointeur temporel positives sont admises, fixée à zéro

source: ATSREADNZ: timepointer out of range, truncated to last frame
french: ATSREADNZ : pointeur temporel hors limites, tronqué à la dernière trame

source: ATSREADNZ: not initialised
french: ATSREADNZ : non initialisé
italian: ATSREADNZ: non inizializzato

source: ATSADD: Function table number for synthesis waveform not valid
french: ATSADD : le numéro de la table de fonction pour la forme d'onde de synthèse n'est pas valide

source: ATSADD: Gate Function table number not valid
french: ATSADD : le numéro de la table de fonction gate n'est pas valide

source: ATSADD: Partial(s) out of range, max partial allowed is %i
french: ATSADD : partiel(s) hors limites, le partiel max autorisé est %i

source: ATSADD: Type not implemented
french: ATSADD : type non implémenté

source: ATSADD: only positive time pointer values are allowed, setting to zero
french: ATSADD : seules les valeurs de pointeur temporel positives sont admises, fixée à zéro

source: ATSADD: time pointer out of range, truncating to last frame
french: ATSADD : pointeur temporel hors limites, tronqué à la dernière trame

source: ATSADD: not initialised
french: ATSADD : non initialisé
italian: ATSADD: non inizializzato

source: ATSADDNZ: This file type contains no noise
french: ATSADDNZ : ce type de fichier ne contient pas de bruit

source: ATSADDNZ: This file type has not been implemented in this code yet.
french: ATSADDNZ : ce type de fichier n'a pas encore été implémenté dans ce code.

source: ATSADDNZ: Band(s) out of range, max band allowed is 25
french: ATSADDNZ : bande(s) hors limites, la bande maximale autorisée est 25
