Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: Score must start with orchestra section
french: Une partition doit débuter par une section d'orchestre

source: Expected score or functions section
french: Il manque une section de partition ou de fonctions

source: Tempo must be specified
french: Le tempo doit être spécifié
italian: Tempo deve essere specificato

source: Redefinition of tempo
french: Redéfinition du tempo

source: Must specify 2 or more letters of keyword
french: Il faut spécifier un mot-clé d'au moins 2 lettres

source: Must be "on" or "off"
french: Doit être "on" ou "off"

source: Invalid time signature
french: nom de fichier non valide

source: Bad key signature
french: Mauvaise armature de clé

source: Invalid field
french: descripteur de fichier non valide
italian: Campo non valido

source: Nested next-parameter passing
french: Passage de paramètre next imbriqué

source: Unrecognised keyword
french: Mot-clé non reconnu
italian: keyword (parola chiave) non riconosciuta

source: Wrong number of beats in bar
french: Mauvais nombre de pulsations dans la mesure

source: Syntax error: cannot back up
french: Erreur de syntaxe : impossible de sauvegarder

source: Improper tie
french: Liaison impropre

source: Tie between different pitches
french: Liaison entre hauteurs différentes

source: Warning: params changed on tie
french: Avertissement : paramètres changés pendant la liaison

source: Parameter number out of range
french: Le numéro du périphérique est hors limites

source: Lost previous note: not written
french: La note précédente est perdue : pas d'écriture

source: Macro expansion too long -- circular macros?
french: Expension de macro trop longue -- macros circulaires ?

source: Syntax error: no {
french: Erreur de syntaxe : no {
italian: Errore di sintassi: nessuna {

source: No instrument specified
french: Instrument non défini
italian: Nessun strumento specificato

source: Instrument not defined
french: Instrument non défini
italian: Strumento non definito

source: unresolved tie
french: liaison non résolue

source: unresolved slur
french: articulation non résolue

source: Circular note list
french: Liste de notes circulaire

source: Unexpected end of file
french: Fin de fichier inattendue
italian: Inattesa fine del file

source: Syntax error: no =
french: Erreur de syntaxe : no =
italian: Errore di sintassi: nessun =

source: Syntax error: no number
french: Erreur de syntaxe : pas de numéro
italian: Errore di sintassi: nessun numero

source: No instruments declared
french: Aucun instrument n'est déclaré
italian: Nessun strumento dichiarato

source: Expected =
french: Il manque =

source: Invalid pitch class
french: Classe de hauteur non valide
italian: pitch class non valida

source: scot processing terminated
french: traitement scot terminé
italian: processo scot terminato

source: scot: %d errors.
french: scot : %d erreurs.
italian: scot: %d errori.

source: Poorly specified global lock index: %i [max: %i]
italian: Indice del lock globale specificato male: %i [max: %i]

source: Invalid NULL parameter name for a global variable
italian: nome parametro NULL non valido per variabile globale

source: Inserting Parallelism Constructs into AST
italian: Inserimento costrutti del parallelismo in AST

source: %d: %s position %<PRIi32>
italian: %d: %s posizione %<PRIi32>

source: SECTION %d:
italian: SEZIONE %d:

source: Message:
italian: Messaggio:

source: npoles %<PRIi32>, nvals %<PRIi32>, totvals %<PRIi32>, lastfram16 = %<PRIi32>x
italian: npoles %<PRIi32>, nvals %<PRIi32>, totvals %<PRIi32>, lastfram16 = %<PRIi32>
