Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: deltapi: INF delaytime
french: deltapi : durée de délai infinie

source: deltapn: not initialised
french: deltapn : non initialisé
italian: deltapn: non inizializzato

source: deltap3: not initialised
french: deltap3 : non initialisé
italian: deltap3: non inizializzato

source: illegal loop time
french: durée de boucle illégale
italian: illegale loop time

source: comb: not initialised
french: comb : non initialisé
italian: comb: non inizializzato

source: combinv: not initialised
french: combinv : non initialisé
italian: combinv: non inizializzato

source: alpass: not initialised
french: alpass : non initialisé
italian: alpass: non inizializzato

source: revlpsiz inconsistent
french: revlpsiz incohérent
italian: revlpsiz ?? inconsistente

source: reverb: not initialised
french: reverb : non initialisé
italian: reverb: non inizializzato

source: pan: not initialised
french: pan : non initialisé
italian: pan: non inizializzato

source: printk not initialised
french: printk n'est pas initialisé
italian: printk: non inizializzato

source: time %11.5f:
french: temps %11.5f :
italian: tempo %11.5f:

source: null string
french: chaîne nulle
italian: stringa nulla

source: printks not initialised
french: printks : non initialisé
italian: printks: non inizializzato

source: Insufficient arguments in formatted printing
french: Arguments insuffisants dans l'impression formatée
italian: argomenti insufficienti per la formattazione di stampa

source: Formatting string too long: %s
french: Chaîne de formatage trop longue : %s
italian: Stringa di formattazione troppo lunga: %s

source: inz index > isizea. Not writing.
french: inz : index > isizea. Pas d'écriture.
italian: inz index > isizea. Nessuna scrittura.

source: inz index < 0. Not writing.
french: inz : index < 0. Pas d'écriture.
italian: inz index < 0. Nessuna scrittura.

source: outz index > isizea. No output
french: outz : index > isizea. Pas de sortie.
italian: outz index > isizea. Nessun output

source: outz index < 0. No output.
french: outz : index < 0. Pas de sortie.
italian: outz index < 0. Nessun output.

source: table: could not find ftable %d
french: table : ftable %d introuvable
italian: table: non riesco a trovare la ftable %d

source: table: index type inconsistent with output
french: table : type de l'indice en contradiction avec la sortie
italian: table: tipo di indice inconsistente con output

source: tablekt: index type inconsistent with output
french: tablekt : type de l'indice en contradiction avec la sortie
italian: tablekt: tipo di indice inconsistente con output

source: table: could not find ftables %d and/or %d
french: table : ftables %d et/ou %d introuvables
italian: table: non riesco a trovare le ftable %d e/o %d

source: table: could not read negative pos %d
french: table : impossible de lire à la position négative %d
italian: table: non posso leggere una posizione negative %d

source: vdelay: not initialised
french: vdelay : non initialisé
italian: vdelay: non inizializzato

source: vdelay3: not initialised
french: vdelay3 : non initialisé
italian: vdelay3: non inizializzato

source: Wrong input count in multitap
french: Mauvais nombre d'entrées dans multitap
italian: Conteggio input in multitap sbagliato

source: multitap: not initialised
french: multitap : non initialisé
italian: multitap: non inizializzato

source: High frequency diffusion not in (0, 1)
french: La diffusion de haute fréquence n'est pas dans ]0, 1[
italian: High frequency diffusion non nell'intervallo (0, 1)

source: reverbx; Combs ftable must have %d time and %d gain values
french: reverbx ; la ftable des filtres en peigne doit avoir %d valeurs de temps et %d valeurs de gain
italian: reverbx; Combs ftable deve avere valori di %d time e %d gain

source: reverbx; Alpas ftable must have %d time and %d gain values
french: reverbx ; la ftable des filtres passe-tout doit avoir %d valeurs de temps et %d valeurs de gain
italian: reverbx; Alpas ftable deve avere valori di %d time e %d gain

source: High frequency diffusion>1
french: Diffusion de haute fréquence > 1

source: High frequency diffusion<0
french: Diffusion de haute fréquence < 0

source: Non positive reverb time
french: Durée de réverbération non positive
italian: Tempo di reverb non positivo

source: reverbx: not initialised
french: reverbx : non initialisé
italian: reverbx: non inizializzato

source: Too many arguments to OSCsend
french: Trop d'arguments pour OSCsend
italian: Troppi argomenti a OSCsend

source: Failed to set multicast
french: Echec du réglage de la multidiffusion
italian: Fallita impostazione multicast

source: Time stamp is two values
french: Le timestamp comprend deux valeurs
italian: Time stamp ?? di due valori

source: ftable %.2f does not exist
french: la ftable %.2f n'existe pas
italian: ftable %.2f non esiste

source: argument %d is not an array
french: l'argument %d n'est pas un tableau
italian: l'argomento %d non ?? un array

source: Unknown OSC type %c
french: Type OSC inconnu %c
italian: Tipo OSC sconosciuto %c

source: OSC: failed to allocate globals
french: OSC : échec de l'allocation des variables globales
italian: OSC: fallita allocazione delle globali

source: OSC deinitialised
french: OSC dé-initialisé

source: cannot start OSC listener on port %s
french: impossible de démarrer l'écouteur OSC sur le port %s
italian: non posso avviare l'ascolto OSC sulla porta %s

source: OSC listener #%d started on port %s
french: Ecouteur OSC #%d démarré sur le port %s
italian: OSC ascoltatore #%d avviato sulla porta %s

source: OSC multicast listener #%d started on port %s
french: Ecouteur multidiffusion OSC #%d démarré sur le port %s
italian: OSC ascoltatore multicast #%d avviato sulla porta %s

source: OSC not running
french: OSC n'est pas actif
italian: OSC non avviato

source: invalid handle
french: descripteur non valide
italian: handle non valido

source: invalid number of arguments
french: nombre d'arguments non valide
italian: numero di argomenti non valido

source: argument list inconsistent with format string
french: liste d'arguments inconsistante avec le format chaîne
italian: lista degli argomenti incongruente con la formattazione della stringa

source: invalid type
french: type non valide
italian: tipo non valido

source: Invalid ftable no. %d
french: Numéro de ftable %d non valide.
italian: ftable num. %d non valida

source: OSC internal error
french: Erreur interne OSC
italian: Errore interno OSC

source: vosim: pulse table not found
french: vosim : table d'impulsion non trouvée !
italian: vosim: tavola pulse non trovata

source: vosim: zero kfund. 'Infinite' length event generated.
french: vosim: kfund à zéro. Evènement de longueur 'infinie' généré.
italian: vosim: kfund zero. Generato evento di lunghezza 'infinita'.

source: vosim: kfund (%f) > sr. Generating ksmps silence.
french: vosim: kfund (%f) > sr. Génération d'un silence de ksmps.
italian: vosim: kfund (%f) > sr. Generati ksmps di silenzio.

source: vosim: not initialised
french: vosim : non initialisé
italian: vosim: non inizializzato

source: bformenc is deprecated; use bformenc1 instead
french: bformenc est obsolète ; utiliser plutôt bformenc1
italian: bformenc ?? obsoleta; usa invece bformenc1

source: Wrong number of output arguments! 4, 9 or 16 needed!
french: Nombre incorrect d'arguments de sortie ! Il en faut 4, 9 ou 16 !
italian: Numero di argomenti d'output sbagliato! Ne servono 4, 9 o 16!

source: bformdec is deprecated; use bformdec1 instead
french: bformdec est obsolète ; utiliser plutôt bformdec1
italian: bformdec ?? obsoleto; usa invece bformdec1

source: Wrong number of input arguments!
french: Nombre incorrect d'arguments en entrée !
italian: Numero di argomenti di input sbagliato!

source: Wrong number of output cells! There must be 2 output cells.
french: Nombre incorrect de cellules de sortie ! Il en faut 2.
italian: Numero sbagliato di celle d'output! Devono esserci 2 celle d'output.

source: Wrong number of output cells! There must be 4 output cells.
french: Nombre incorrect de cellules de sortie ! Il en faut 4.
italian: Numero sbagliato di celle d'output! Devono esserci 4 celle d'output.

source: Wrong number of output cells! There must be 5 output cells.
french: Nombre incorrect de cellules de sortie ! Il en faut 5.
italian: Numero sbagliato di celle d'output! Devono esserci 5 celle d'output.

source: Wrong number of output cells! There must be 8 output cells.
french: Nombre incorrect de cellules de sortie ! Il en faut 8.
italian: Numero sbagliato di celle d'output! Devono esserci 8 celle d'output.

source: Not supported setup number!
french: Valeur de setup non supportée !
italian: Numero di setup non supportato!

source: The numbers of input and output arguments are not valid.
french: Nombre incorrect d'arguments en entrée et en sortie.
italian: Il numero degli argomenti di input e di output arguments non ?? valido.

source: array not initialised in ambibformenc1
french: tableau non initialisé dans ambibformenc1
italian: array non inizializzato in ambibformenc1

source: The number of input arguments is not valid.
french: Nombre incorrect d'arguments en entrée
italian: Il numero di argomenti di input non ?? valido.

source: The isetup value should be between 1 and 5.
french: La valeur de isetup doit être comprise entre 1 et 5.
italian: Il valore di isetup deve essere tra 1 e 5.

source: The output channel count does not match the isetup value.
french: Le nombre de canaux de sortie ne correspond pas à la valeur de isetup.
italian: Il conto dei canali d'output non combacia con il valore di isetup.

source: bformdec1 output array not initilised
french: tableau de sortie de bformdec1 non initialisé

source: second input array is too short
french: second tableau d'entrée trop petit

source: Error: no sizes set for array initialization
french: Erreur : aucune dimension donnée à l'initialisation du tableau
italian: Errore: nessuna impostazione della dimensione dell'array all'inizializzazione

source: Error: sizes must be > 0 for array initialization
french: Erreur : les tailles doivent être > 0 à l'initialisation d'un tableau
italian: Errore: le dimensioni devono essere > 0 per l'inizializzazione dell'array

source: error opening ASCII file %s
french: erreur à l'ouverture du fichier ASCII %s

source: Cannot set i-array at k-rate
french: Impossible de fixer un tableau-i au taux-k
italian: Non ?? possibile impostare un i-array a k-rate

source: Error: no indexes set for array set
french: Erreur : aucun indice fixé pour écrire dans le tableau
italian: Errore: nessun indice impostato per array set

source: Array dimension %d does not match for dimensions %d
french: La dimension %d du tableau ne correspond pas aux dimensions %d

source: Array index %d out of range (0,%d) for dimension %d
french: Indice %d du tableau hors limites (0, %d) pour la dimension %d
italian: Indice %d dell'array fuori intervallo (0,%d) per la dimensione %d

source: Error: no indexes set for array get
french: Erreur : aucun indice fixé pour lire dans le tableau
italian: Errore: non ?? stato impostato nessun indice per array get

source: Array dimension %d out of range for dimensions %d
french: La dimension %d du tableau est hors limites pour les dimensions %d
italian: Dimensione %d del'array fuori intervallo per le dimensioni %d

source: Dimensions do not match in array arithmetic
french: Les dimensions ne correspondent pas dans l'arithmétique des tableaux
italian: Le dimensioni non combaciano nell'aritmetica dell'array

source: array-variable not initialised
french: tableau : non initialisé
italian: array-variable non inizializzata

source: division by zero in array-var at index %d
french: division par zéro dans le tableau à l'indice %d
italian: divisione per zero in array-var all'indice %d

source: undefined power in array-var at index %d
french: puissance indéfinie dans le tableau à l'indice %d
italian: potenza non definita in array-var all'indice %d

source: division by zero in array-var
french: division par zéro dans le tableau
italian: divisione per zero in array-var

source: division by zero in array-var at index %d/%d
french: division par zéro dans le tableau à l'indice %d/%d
italian: divisione per zero in array-var all'indice %d/%d

source: array-variable not a vector
french: tableau pas un vecteur
italian: array-variable non un vettore

source: array-variable dimensions do not match
french: les dimensions du tableau ne correspondent pas
italian: array-variable le dimensioni non combaciano

source: array-variable types do not match
french: les types du tableau ne correspondent pas
italian: array-variable i tipi non combaciano

source: array-var not initialised
french: tableau non initialisée
italian: array-var non inizializzato

source: No table for copy2ftab
french: Pas de table pour copy2ftab
italian: Nessuna tavola per copy2ftab

source: Offset is out of bounds
french: Décalage hors limites

source: inconsistent start, end and increment parameters
french: paramètres début, fin et incrément inconstistants
italian: parametri di inizio, fine e incremento inconsistenti

source: inconsistent start, end parameters
french: paramètres début, fin inconsistants
italian: parametri di inizio, fine incongruenti

source: slice larger than original size
french: intervalle plus grand que la taille d'origine
italian: slice ?? maggiore della dimensione originale

source: slice increment must be positive
french: le paramètre de coupure doit être positif
italian: l'incremento di slice deve essere positivo

source: %s not found
french: %s non trouvé
italian: %s non trovato

source: map fn not found at k rate
french: fn de map introuvable au taux-k
italian: map fn non trovata a k rate

source: rfft: only one-dimensional arrays allowed
french: rfft : seuls les tableaux unidimensionnels sont permis
italian: rfft: sono permessi solo array unidimensionali

source: rifft: only one-dimensional arrays allowed
french: rifft : seuls les tableaux unidimensionnels sont permis
italian: rifft: sono permessi solo array unidimensionali

source: array sizes do not match
french: les tailles de tableau ne correspondent pas
italian: le dimensioni dell'array non combaciano

source: fft: only one-dimensional arrays allowed
french: fft : seuls les tableaux unidimensionnels sont permis
italian: fft: sono permessi solo array unidimensionali

source: fftinv: only one-dimensional arrays allowed
french: fftinv : seuls les tableaux unidimensionnels sont permis
italian: fftinv: sono permessi solo array unidimensionali

source: in array sizes do not match: %d and %d
french: dans array les tailles ne correspondent pas : %d et %d
italian: in array le dimensioni non combaciano: %d e %d

source: non-pow-of-two case not implemented yet
french: non puissance de deux pas encore implémentée
italian: caso di non potenza di due non ancora implementato

source: FFT size too small (min 64 samples)
french: Taille de TFR trop petite (min 64 échantillons)
italian: dimensione FFT troppo piccola (min 64 campioni)

source: in array not 2-dimensional
french: dans array pas de 2-dimension
italian: l'array in non ?? bidimensionale

source: requested row is out of range
french: ligne demandée hors limites
italian: la riga richiesta ?? fuori intervallo

source: requested col is out of range
french: colonne demandée hors limites
italian: la colonna richiesta ?? fuori intervallo

source: Error: index out of range
french: Erreur : index hors limites
italian: Errore: indice fuori intervallo

source: Error: New column too short
french: Erreur : nouvelle colonne trop courte

source: input array too small
french: tableau d'entrée trop petit
italian: array d'input troppo piccolo

source: dct: only one-dimensional arrays allowed
french: dct : seuls les tableaux unidimensionnels sont permis
italian: dct: sono permessi solo array unidimensionali

source: dct: non-pow-of-two sizes not yet implemented
french: dct : tailles non puissance de deux pas encore implémentées
italian: dct: dimensioni non potenza di due non ancora implementate

source: dctinv: only one-dimensional arrays allowed
french: dctinv : seul les tableaux unidimensionnels sont permis
italian: dctinv: sono permessi solo array unidimensionali

source: dctinv: non-pow-of-two sizes not yet implemented
french: dctinv : tailles non puissance de deux pas encore implémentées
italian: dctinv: dimensioni non potenza di due non ancora implementate

source: mfb: filter bank size exceeds input array length
french: mfb : la taille du banc de filtres excède la longueur du tableau en entrée

source: array inputs not in correct format
french: tableau en entrée dans un format incorrect

source: Babo: resonator dimensions are incorrect (%.1f, %.1f, %.1f)
french: Babo : les dimensions du résonateur sont incorrectes (%.1f, %.1f, %.1f)
italian: Babo: le dimensioni del risuonatore non sono corrette (%.1f, %.1f, %.1f)

source: Ends must be clamped(1), pivoting(2) or free(3)
french: Se termine mais peut être fixé(1), pivotant(2) ou libre(3)

source: rezzy instability corrected
french: L'instabilité de rezzy a été corrigée
italian: corretta l'instabilit?? di rezzy

source: vco: not initialised
french: vco : non initialisé
italian: vco: non inizializzato

source: DLineN: Delay length too big ... setting to maximum length of %d.
french: DLineN : longueur de délai trop grande ... réglée à la longueur maximale de %d.
italian: DLineN: Lunghezza del delay troppo grande ... impostata alla massima lunghezza di %d.

source: unknown lowest frequency for bowed bar -- assuming 50Hz
french: La fréquence la plus basse pour la corde frottée est inconnue -- on suppose qu'elle vaut 50 Hz
italian: frequenza minima per bowed bar sconosciuta -- presumo 50Hz

source: Bowedbar: cannot have zero modes
french: Bowedbar : ne peut pas avoir zéro modes
italian: Bowedbar: non pu?? avere zero modi

source: cell: invalid num of elements
french: cell : nombre d'éléments non valide
italian: cell: numero di elementi non valido

source: cell: invalid output table
french: cell : table de sortie non valide
italian: cell: tavola d'output non valida

source: cell: invalid initial state table
french: cell : table d'état initial non valide
italian: cell: tavola dello stato iniziale non valida

source: cell: invalid rule table
french: cell : table de règle non valide
italian: cell: tavola dei ruoli non valida

source: filter type not lowpass or highpass in clfilt
french: Le type de filtre dans clfilt n'est ni passe-bas ni passe-haut
italian: il tipo di filtro non passa basso o passa alto in clfilt

source: filter kind, %d, out of range in clfilt
french: sorte de filtre, %d, dans clfilt, hors limites
italian: tipo di filtro, %d, fuori intervallo in clfilt

source: number of poles, %f, out of range in clfilt
french: nombre de pôles, %f, dans clfilt, hors limites
italian: numero di poli, %f, fuori intervallo in clfilt

source: odd number of poles chosen in clfilt, rounded to %d
french: nombre impair de pôles choisi dans clfilt, arrondi à %d
italian: numero dispari di poli scelti in clfilt, arrotondato a %d

source: passband ripple must be positive in clfilt. Set to %f
french: l'ondulation passe-bande doit être positive dans clfilt. Fixée à %f
italian: passband ripple deve essere positivo in clfilt. Impostato a %f

source: passband ripple must be non-zero in clfilt. Set to %f
french: l'ondulation passe-bande doit être non nulle dans clfilt. Fixée à %f
italian: passband ripple non deve essere zero in clfilt. Impostato a %f

source: stopband attenuation must be negative in clfilt. Set to %f
french: l'atténuation en réjection de bande doit être négative dans clfilt. Fixée à %f
italian: stopband attenuation deve essere negativa in clfilt. Impostata a %f

source: stopband attenuation must be non-zero in clfilt. Set to %f
french: l'atténuation en réjection de bande doit être non nulle dans clfilt. Fixée à %f
italian: stopband attenuation non deve essere zero in clfilt. Impostato a %f

source: Lowpass Elliptical not implemented yet. Sorry!
french: Passe-bas elliptique pas encore implémenté. Désolé !
italian: Lowpass Elliptical non ancora implementato. Scusate!

source: code error, ikind out of range
french: erreur de code, ikind hors limites
italian: errore codice, ikind fuori intervallo

source: Highpass Elliptical not implemented yet. Sorry!
french: Passe-haut elliptique pas encore implémenté. Désolé !
italian: Highpass Elliptical non ancora implementato. Scusate!

source: code error, ihilo out of range
french: erreur de code, ihilo hors limites
italian: errore codice, ihilo fuori intervallo

source: control: failed to allocate globals
french: control : échec de l'allocation des variables globales
italian: control: fallita allocazione delle globali

source: Closing down wish(%d)
french: Fermeture de wish(%d)
italian: Chiudo wish(%d)

source: Slider %d set to %s
french: Réglette %d fixé à %s
italian: Slider %d impostato a %s

source: Unknown control %d
french: Contrôle %d inconnu
italian: Controllo conosciuto %d

source: counter: failed to allocate globals
french: counter : échec de l'allocation des variables globales

source: Failed to allocate counters
french: L'allocation de compteurs a échoué

source: Failed to open /proc/stat: %s
french: Echec de l'ouverture de /proc/stat : %s
italian: Fallita apertura /proc/stat: %s

source: failed /proc/stat read
french: La lecture de /proc/stat a échoué
italian: fallita lettura di /proc/stat

source: cross2: length must be at least 1
french: cross2 : la longueur doit valoir au moins 1
italian: cross2: length deve essere almeno 1

source: crossfm: ftable not found
french: crossfm : table non trouvée
italian: crossfm: ftable non trovata

source: **Unknown**
french: **Inconnu**
italian: **Sconosciuto**

source: cannot determine current directory: %s
french: impossible de déterminer le répertoire courant: %s
italian: non riesco a determinare la directory corrente: %s

source: readf: failed to open file
french: readf : l'ouverture du fichier a échoué
italian: readf: fallita apertura file

source: readf: read failure
french: readf : la lecture a échoué
italian: readf: lettura fallita

source: readi failed to initialise
french: readi, l'initialisation a échoué
italian: readi fallita inizializzazione

source: DSSI4CS: Failed to load %s.
french: DSSI4CS : le chargement de %s a échoué
italian: DSSI4CS: Fallito caricamento di %s.

source: Error creating global variable '$DSSI4CS'
french: Erreur lors de la création de la variable globale '$DSSI4CS'
italian: Errore nella creazione della variabile globale '$DSSI4CS'

source: DSSI4CS: Loading first instance.
french: DSSI4CS : chargement de la première instance.
italian: DSSI4CS: Caricamento della prima istanza.

source: No ladspa descriptor
french: Pas de descripteur ladspa
italian: Nessun descrittore ladspa

source: DSSI4CS: Unable to find ladspa_descriptor(%lu) function or dssi_descriptor(%lu) function in plugin file "%s": %s. Are you sure this is a LADSPA or DSSI plugin file ?
french: DSSI4CS : impossible de trouver la fonction ladspa_descriptor(%lu) ou la fonction dssi_descriptor(%lu) dans le fichier de greffon "%s" : %s. Etes-vous sûr que c'est un fichier de greffon LADSPA ou DSSI ?
italian: DSSI4CS: Non trovo la funzione ladspa_descriptor(%lu) o la funzione dssi_descriptor(%lu) nel file plugin "%s": %s. Sicuri che questo sia un file plugin LADSPA o DSSI ?
