Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: adsynt: partial count is greater than amptable size!
french: adsynt : le nombre de partiels est supérieur à la taille de la table d'amp !
italian: adsynt: il conto delle parziali ?? maggiore della dimensione di amptable!

source: adsynt: not initialised
french: adsynt : non initialisé
italian: adsynt: non inizializzato

source: hsboscil: not initialised
french: hsboscil : non initialisé
italian: hsboscil: non inizializzato

source: pitchamdf: maxcps must be > mincps !
french: pitchamdf : maxcps doit être > mincps !
italian: pitchamdf: maxcps deve essere > mincps !

source: pitchamdf: not initialised
french: pitchamdf : non initialisé
italian: pitchamdf: non inizializzato

source: phasorbnk: not initialised
french: phasorbnk : non initialisé
italian: phasorbnk: non inizializzato

source: pinkish: Invalid method code
french: pinkish : code de méthode non valide

source: pinkish: Filter method requires a-rate (noise) input
french: pinkish : la méthode de filtrage nécessite une entrée (bruit) de taux-a
italian: pinkish: Il metodo del filtro richiede un input (noise) a-rate

source: pinkish: Gardner method requires 4-%d bands. Default %<PRIi32> substituted for %d.
french: pinkish : la méthode de Gardner nécessite 4-%d bandes. La valeur par défaut %<PRIi32> a été substituée à %d.

source: Incorrect argument count in transeg
french: Nombre d'arguments incorrect dans transeg
italian: Numero di argomenti non corretto in transeg

source: Incorrect argument count in transegb
french: Nombre d'arguments incorrect dans transegb
italian: Numero di argomenti non corretto in transegb

source: Error: transeg not initialised (krate)
french: Erreur : transeg non initialisé (taux-k)
italian: Errore: transeg non inizializzato (krate)

source: transeg: not initialised (arate)
french: transeg : non initialisé (taux-a)
italian: transeg: non inizializzato (arate)

source: Incorrect argument count in transegr
french: Nombre d'arguments incorrect dans transegr
italian: Numero di argomenti non corretto in transegr

source: median: not initialised (arate)
french: median : non initialisé (taux-a)
italian: median: non inizializzato (arate)

source: median: window (%d)larger than maximum(%d); truncated
french: median : fenêtre (%d) plus grande que le maximum (%d) ; tronquée
italian: median: window (%d)pi?? larga del massimo(%d); troncata

source: median: not initialised (krate)
french: median non initialisé (taux-k)
italian: median: non inizializzato (krate)

source: Muting new instances of instr %d
french: Muting des nouvelles instances de l'instr %d
italian: Silenzio le nuove istanze dello stumento %d

source: Allowing instrument %d to start
french: L'instrument %d est autorisé à démarrer
italian: Consento allo strumento %d di iniziare

source: ptrack: FFT size out of range; using %d
french: ptrack : taille de TFR hors limites ; on utilise %d
italian: ptrack: dimensione FFT fuori intervallo; uso %d

source: ptrack: FFT size not a power of 2; using %d
french: ptrack : la taille de TFR n'est pas une puissance de 2 ; on utilise %d
italian: ptrack: dimensione FFT non potenza di 2; uso %d

source: Missing input table or too short
french: Table d'entrée manquante ou trop courte !
italian: Manca la tavola in input o ?? troppo corta

source: Missing output table or too short
french: Table de sortie manquante ou trop courte !
italian: Tavola d'output mancante o troppo corta

source: wgpluck:Could not allocate for initial shape
french: wgpluck : impossible d'allouer la forme initiale
italian: wgpluck: non posso allocare per la forma iniziale

source: psynth: first input not in TRACKS format
french: psynth : la première entrée n'est pas au format TRACKS
italian: psynth: il primo input non ?? nel formato TRACKS

source: psynth: function table not found
french: psynth : table de fonction non trouvée
italian: psynth: tavola funzione non trovata

source: Input not in TRACKS format
french: L'entrée n'est pas au format TRACKS
italian: Input non in formato TRACKS

source: trsplit: input not in TRACKS format
french: trsplit : l'entrée n'est pas au format TRACKS
italian: trsplit: input non in formato TRACKS

source: trmix: first input not in TRACKS format
french: trmix : la première entrée n'est pas au format TRACKS
italian: trmix: il primo input non ?? nel formato TRACKS

source: trmix: second input not in TRACKS format
french: trmix : la seconde entrée n'est pas au format TRACKS
italian: trmix: il secondo input non ?? nel formato TRACKS

source: trfil: input not in TRACKS format
french: trfil : l'entrée n'est pas au format TRACKS
italian: trfil: input non in formato TRACKS

source: trfil: could not find function table
french: trfil : impossible de trouver la table de fonction
italian: trfil: non riesco a trovare la tavola funzione

source: binit: first input not in TRACKS format
french: binit : la première entrée n'est pas au format TRACKS
italian: binit: il primo input non ?? nel formato TRACKS

source: PVADD ktimpnt truncated to last frame
french: PVADD ktimpnt a été tronqué à la dernière trame
italian: PVADD ktimpnt troncato all'ultimo frame

source: pvadd: not initialised
french: pvadd : non initialisé
italian: pvadd: non inizializzato

source: PVADD cannot load %s
french: PVADD ne peut pas charger %s
italian: PVADD non posso caricare %s

source: pvoc-ex file %s: FFT size %d too large for Csound
french: pvoc-ex fichier %s : la taille de TFR %d est trop grande pour Csound
italian: pvoc-ex file %s: dimensione FFT %d troppo grande per Csound

source: PV frame %d seems too small in %s
french: La trame PV %d semble trop petite dans %s
italian: PV frame %d sembra troppo piccolo in %s

source: pvoc-ex file %s is not mono
french: pvoc-ex : le fichier %s n'est pas mono
italian: pvoc-ex file %s non ?? mono

source: PVBUFREAD cannot load %s
french: PVBUFREAD ne peut pas charger %s
italian: PVBUFREAD non posso caricare %s

source: PVOC frame %ld bigger than %ld in %s
french: La trame PVOC %ld est plus grande que %ld dans %s
italian: PVOC frame %ld pi?? grande di %ld in %s

source: PVOC frame %ld seems too small in %s
french: La trame PVOC %ld semble trop petite dans %s
italian: PVOC frame %ld sembra troppo piccolo in %s

source: %d chans (not 1) in PVOC file %s
french: %d canaux (pas 1) dans le fichier PVOC %s
italian: %d chans (non 1) in PVOC file %s

source: ksmps of %d needs wdw of %d, max is %d for pv %s
french: Un ksmps de %d necécessite une fenêtre de %d, max vaut %d pour pv %s
italian: ksmps di %d necessita wdw di %d, il max ?? %d per pv %s

source: PVOC ktimpnt truncated to last frame
french: PVOC ktimpnt a été tronqué à la dernière trame
italian: PVOC ktimpnt troncato all'ultimo frame

source: pvbufread: not initialised
french: pvbufread : non initialisé
italian: pvbufread: non inizializzato

source: pvinterp: associated pvbufread not found
french: pvinterp : pas de pvbufread associé
italian: pvinterp: non trovo l'associato pvbufread

source: PVINTERP cannot load %s
french: PVINTERP ne peut pas charger %s
italian: PVINTERP non posso caricare %s

source: pvinterp: %s: frame size %d does not match pvbufread frame size %d
french: pvinterp : %s : la taille de trame %d ne correspond pas à la taille de trame %d de pvbufread
italian: pvinterp: %s: frame size %d non combacia con pvbufread frame size %d

source: pvinterp: not initialised
french: pvinterp : non initialisé
italian: pvinterp: non inizializzato

source: PVOC transpose too low
french: PVOC transpose trop bas
italian: PVOC transpose troppo basso

source: PVOC transpose too high
french: PVOC transpose trop haut
italian: PVOC transpose troppo alto

source: pvcross: associated pvbufread not found
french: pvcross : pas de pvbufread associé
italian: pvcross: non trovo l'associato pvbufread

source: PVCROSS cannot load %s
french: PVCROSS ne peut pas charger %s
italian: PVCROSS non posso caricare %s

source: pvcross: %s: frame size %d does not match pvbufread frame size %d
french: pvcross : %s : la taille de trame %d ne correspond à la taille de trame %d de pvbufread
italian: pvcross: %s: frame size %d non combacia con pvbufread frame size %d

source: PVOC debug: one frame gets through
french: PVOC debuf : une trame est passée

source: pvcross: not initialised
french: pvcross : non initialisé
italian: pvcross: non inizializzato

source: invalid number of output arguments
french: nombre d'arguments de sortie non valide
italian: numero di argomenti d'output non valido

source: function table not found
french: table de fonction non trouvée

source: filescal: failed to open file %s
french: filescal : échec de l'ouverture du fichier %s
italian: filescal: fallita apertura del file %s

source: filescal: mismatched channel numbers. %d outputs, %d inputs
french: filescal : nombres de canaux différents. %d sorties, %d entrées
italian: filescal: i numeri di canali non combaciano. %d outputs, %d inputs

source: Unsafe to have same fsig as in and out
french: Il est risqué d'avoir le même fsig en entrée et en sortie
italian: Non ?? sicuro avere lo stesso fsig come in e out

source: pvsfreeze: signal format must be amp-freq.
french: pvsfreeze : le format de signal doit être amp-fréq.
italian: pvsfreeze: il formato del segnale deve essere amp-freq.

source: Error allocating PVOC globals
french: Erreur d'allocation des variables globales de PVOC
italian: Errore allocazione globali di PVOC

source: PVREAD cannot load %s
french: PVREAD ne peut pas charger %s
italian: PVREAD non posso caricare %s

source: pvsband: not initialised
french: pvsband : non initialisé
italian: pvsband: non inizializzato

source: pvsgain: signal format must be amp-phase or amp-freq.
french: pvsgain : le format de signal doit être amp-phase ou amp-fréq.
italian: pvsgain: il formato del segnale deve essere amp-phase o amp-freq.

source: SDFT Not implemented in this case yet
french: SDFT pas encore implémentée dans ce cas
italian: SDFT Non ancore implementato in questo caso

source: pvsfwrite: could not open file %s
french: pvsfwrite : impossible d'ouvrir le fichier %s
italian: pvsfwrite: non riesco ad aprire il file %s

source: pvsfwrite: could not write data
french: pvsfwrite : impossible d'écrire les données
italian: pvsfwrite: non posso scrivere i dati

source: pvsdiskin: could not open file %s
french: pvsdiskin : impossible d'ouvrir le fichier %s
italian: pvsdiskin: non riesco ad aprire il file %s

source: could not find table number %d
french: la table %d est introuvable
italian: non riesco a trovare la tavola numero %d

source: pvsfreeze: signal format must be amp-phase or amp-freq.
french: pvsfreeze : le format de signal doit être amp-phase ou amp-fréq.
italian: pvsfreeze: il formato del segnale deve essere amp-phase o amp-freq.

source: pvsosc does not work while sliding
french: pvsosc ne travaille pas lors du glissement

source: pvsmooth: signal format must be amp-phase or amp-freq.
french: pvsmooth : le format de signal doit être amp-phase ou amp-fréq.
italian: pvsmooth: il formato del segnale deve essere amp-phase o amp-freq.

source: pvsmix: signal format must be amp-phase or amp-freq.
french: pvsmix : le format de signal doit être amp-phase ou amp-fréq.
italian: pvsmix: il formato del segnale deve essere amp-phase o amp-freq.

source: pvsmix: formats are different.
french: pvsmix : les formats sont différents
italian: pvsmix: i formati sono diversi.

source: pvsfilter: signal format must be amp-phase or amp-freq.
french: pvsfilter : le format de signal doit être amp-phase ou amp-fréq.
italian: pvsfilter: il formato del segnale deve essere amp-phase o amp-freq.

source: pvsfilter: not initialised
french: pvsfilter : non initialisé
italian: pvsfilter: non inizializzato

source: pvsfilter: formats are different.
french: pvsfilter : les formats sont différents
italian: pvsfilter: i formati sono diversi.

source: pvscale: not initialised
french: pvscale : non initialisé
italian: pvscale: non inizializzato

source: pvshift: not initialised
french: pvshift : non initialisé
italian: pvshift: non inizializzato

source: pvswarp: not initialised
french: pvswarp : non initialisé
italian: pvswarp: non inizializzato

source: pvsblur does not work sliding yet
french: pvsblur ne traite pas encore le glissement

source: pvsblur: not initialised
french: pvsblur : non initialisé
italian: pvsblur: non inizializzato

source: pvstencil: signal format must be amp-phase or amp-freq.
french: pvstencil : le format de signal doit être amp-phase ou amp-fréq.
italian: pvstencil: il formato del segnale deve essere amp-phase o amp-freq.

source: pvstencil: ftable needs to equal the number of bins
french: pvstencil : la ftable doit égaler le nombre de bins
italian: pvstencil: ftable necessita di uguale numero di bins

source: pvstencil: not initialised
french: pvstencil : non initialisé
italian: pvstencil: non inizializzato

source: pvs2tab: signal format must be amp-phase or amp-freq.
french: pvs2tab : le format du signal doit être amp-phase ou amp-fréq.
italian: pvs2tab: il formato del segnale deve essere amp-phase o amp-freq.

source: magnitude and frequency arrays not initialised, or are not the same size
french: tableaux de magnitude et de fréquence non initialisés ou de tailles différentes
italian: array per magnitude e frequency non inizializzati, oppure non sono della stessa dimensione

source: SDFT case not implemented yet
french: SDFT pas encore implémentée
italian: SDFT caso non ancore implementato

source: error... could not create global var for handle
french: erreur... impossible de créer une var globale pour le descripteur

source: error... could not read handle from global variable
french: erreur... impossible de lire le descripteur dans les variables globales

source: Invalid buffer handle
french: Descripteur de tampon non valide

source: table length too small: needed %d, got %d
french: longueur de table trop petite : %d attendu, %d obtenu
italian: lunhezza della tavola troppo piccola: servirebbe %d, ottengo %d

source: pvscent: format must be amp-phase or amp-freq.
french: pvscent : le format doit être amp-phase ou amp-fréq.
italian: pvscent: il formato deve essere amp-phase o amp-freq.

source: centroid requested fftsize = %.0f, actual = %d
french: taille de tfr requise pour le centroïde = %.0f, actuellement = %d
italian: centroid richiede fftsize = %.0f, attualmente = %d

source: PV Frames must be in AMP_FREQ format!
french: Les trames PV doivent être au format AMP_FREQ
italian: PV Frames deve essere nel formato AMP_FREQ!

source: pvsdemix : formats are different.
french: pvsdemix : les formats sont différents
italian: pvsdemix: i formati sono diversi.

source: pvsdemix : not initialised
french: pvsdemix : non initialisé
italian: pvsdemix: non inizializzato

source: pvsgendy: not initialised
french: pvsgendy : non initialisé
italian: pvsgendy: non inizializzato

source: Reflection invalid (%f)
french: Réflexion non valide (%f)
italian: Reflection non valida (%f)

source: Pickup out of range (%f)
french: Pickup hors limites (%f)
italian: Pickup fuori intervallo (%f)

source: reverbsc: sample rate is out of range
french: reverbsc : le taux d'échantillonnage est hors limites
italian: reverbsc: la sample rate ?? fuori intervallo

source: reverbsc: invalid pitch modulation factor
french: reverbsc : facteur de modulation de la hauteur non valide
italian: reverbsc: fattore di modulazione dell'altezza (pitch) non valido

source: reverbsc: not initialised
french: reverbsc : non initialisé
italian: reverbsc: non inizializzato

source: scanu: Could not find ifnnit ftable
french: scanu : la ftable ifnnit n'a pas été trouvée
italian: scanu: Non trovo la ftable ifnnit

source: scanu: Init table has bad size
french: scanu : la table d'initialisation a une taille incorrecte
italian: scanu: Tavola init ha una pessima dimensione

source: scanu: Could not find ifninit ftable
french: scanu : la ftable ifninit n'a pas été trouvée
italian: scanu: Non trovo la ftable ifninit

source: Eek ... scan synthesis id was not found
french: Eek ... l'id de synthèse par balayage n'a pas été trouvé
italian: Eek ... scan synthesis id non ?? stato trovato

source: scans: No scan synthesis net specified
french: scans : aucune synthèse par balayage n'a été spécifiée
italian: scans: Nessuna scan synthesis net specificata

source: scanu: Could not find ifnmass table
french: scanu : la table ifnmass n'a pas été trouvée
italian: scanu: Non trovo la tavola ifnmass

source: scanu: Could not find ifncentr table
french: scanu : la table ifncentr n'a pas été trouvée
italian: scanu: Non trovo la tavola ifncentr

source: scanu: Parameter tables should all have the same length
french: scanu : les tables de paramètres doivent toutes avoir la même longueur
italian: scanu: Le tavole dei parametri dovrebbero avere tutte la stessa lunghezza

source: scanu: Could not find ifndamp table
french: scanu : la table ifndamp n'a pas été trouvée
italian: scanu: Non trovo la tavola ifndamp

source: scanu: Could not find ifnstiff table
french: scanu : la table ifnstiff n'a pas été trouvée

source: scanu: Spring matrix is too small
french: scanu : la matrice du ressort est trop petite
italian: scanu: La matrice Spring ?? troppo piccola

source: scanu: Could not find ifnvel table
french: scanu : la table ifnvel n'a pas été trouvée
italian: scanu: Non trovo la tavola ifnvel

source: Mass displacement
french: Déplacement de masse
italian: Posizionamento delle Masse

source: Scansynth window
french: Fenêtre de synthèse par balayage

source: scanu: invalid id table
french: scanu : id de table non valide
italian: scanu: id della tavola non valido

source: scanu: not initialised
french: scanu : non initialisé
italian: scanu: non inizializzato

source: scans: Could not find the ifntraj table
french: scans : la table ifntraj n'a pas été trouvée
italian: scans: Non trovo la tavola ifntraj

source: vermp: Trajectory table includes values out of range
french: vermp : la table de trajectoire contient des valeurs hors limites
italian: vermp: La tavola della traiettoria ha valori fuori intervallo

source: scanux: Could not find ifnnit ftable
french: scanux : la ftable ifnnit n'a pas été trouvée
italian: scanux: Non trovo la ftable ifnnit

source: scanux: Init table has bad size
french: scanux : la table d'initialisation a une taille incorrecte
italian: scanux: Tavola init ha una pessima dimensione

source: scanux: Could not find ifninit ftable
french: scanux : la ftable ifninit n'a pas été trouvée
italian: scanux: Non trovo la ftable ifninit

source: xscans: No scan synthesis net specified
french: xscans : aucune synthèse par balayage n'a été spécifiée
italian: xscans: Nessuna scan synthesis net specificata

source: scanux: Could not find ifnmass table
french: scanux : la table ifnmass n'a pas été trouvée
italian: scanux: Non trovo la tavola ifnmass

source: scanux: Could not find ifncentr table
french: scanux : la table ifncentr n'a pas été trouvée
italian: scanux: Non trovo la tavola ifncentr

source: scanux: Parameter tables should all have the same length
french: scanux : les tables de paramètres doivent toutes avoir la même longueur
italian: scanux: Le tavole dei parametri dovrebbero avere tutte la stessa lunghezza

source: scanux: Could not find ifndamp table
french: scanux : la table ifndamp n'a pas été trouvée
italian: scanux: Non trovo la tavola ifndamp

source: scanux: Could not find ifnstiff table
french: scanux : la table ifnstiff n'a pas été trouvée
italian: scanux: Non trovo la tavola ifnstiff

source: scanux: Spring matrix is too small
french: scanux : la matrice du ressort est trop petite
italian: scanux: La matrice Spring ?? troppo piccola

source: SCANU cannot load %s
french: SCANU ne peut pas charger %s
italian: SCANU non posso caricare %s

source: %d: Looking for (%d) %s Found %.12s
french: %d : (%d) %s recherché, %.12s trouvé
italian: %d: Cercando (%d) %s Trovato %.12s

source: Not a valid matrix
french: Matrice non valide
italian: Non ?? una matrice valida

source: (%d,%d) is out of range
french: (%d, %d) est hors limites
italian: (%d,%d) ?? fuori intervallo

source: scanux: Could not find ifnvel table
french: scanux : la table ifnvel n'a pas été trouvée
italian: scanux: Non trovo la tavola ifnvel

source: xscanu: invalid id table
french: xscanu : id de table non valide
italian: xscanu: id della tavola non valido

source: xscanu: not initialised
french: xscanu : non initialisé
italian: xscanu: non inizializzato

source: scsn: Trajectory table includes values out of range
french: scsn : la table de trajectoire contient des valeurs hors limites
italian: scsn: La tavola della traiettoria ha valori fuori intervallo

source: seqtime: incorrect table number
french: seqtime : numéro de table incorrect
italian: seqtime: numero di tavola non corretto

source: seqtim: incorrect table number
french: seqtim : numéro de table incorrect
italian: seqtim: numero di tavola non corretto

source: No ports available
french: Aucun port n'est disponible
italian: nessuna porta disponibile

source: serial: failed to allocate globals
french: serial : échec de l'allocation des variables globales
italian: serial: fallita allocazione delle globali

source: %s not available.
french: '%s' n'est pas disponible.
italian: %s non disponibile

source: Number of serial handles exhausted
french: Nombre de références série épuisé

source: Nothing to close
french: Rien à fermer
italian: Niente da chiudere

source: failed to open serial line
french: l'ouverture d'une ligne série a échoué

source: arduinoStart already running
french: arduinoStart s'exécute déjà

source: arduino: failed to allocate globals
french: arduino : échec de l'allocation des variables globales

source: Failed to allocate
french: L'allocation a échoué

source: arduinoStart not running
french: arduinoStart n'est pas actif

source: out of range
french: hors limites

source: arduino not running
french: arduino n'est pas actif

source: sfload: cannot open SoundFont file "%s" (error %s)
french: sfload : impossible d'ouvrir le fichier SoundFont "%s" (erreur %s)
italian: sfload: non posso aprire il file SoundFont "%s" (errore %s)

source: sfont: failed to read file
french: sfont : impossible de lire le fichier
italian: sfont: fallita lettura file

source: sfload: could not open globals
french: sfload : impossible d'utiliser des variables globales
italian: sfload: non posso aprire le globali

source: Extending soundfonts
french: Extension de soundfonts
italian: Estensione soundfonts

source: invalid soundfont
french: soundfont non valide

source: Preset list of "%s"
french: List de Preset de "%s"
italian: Lista preset di "%s"

source: Assigning all Presets of "%s" starting from %d (preset handle number)
french: Assignation de tous les préréglages de "%s" à partir de %d (numéro du descripteur de préréglage)

source: All presets have been assigned to preset handles from %d to %d
french: Tous les préréglages ont été assignés aux descripteurs de préréglage allant de %d à %d

source: Instrument list of "%s"
french: Liste d'instruments de "%s"
italian: Lista strumenti di "%s"

source: sfpreset: preset handle too big (%d), max: %d
french: sfpreset : descripteur de préréglage trop grand (%d), max : %d

source: sfpreset: cannot find any preset having prog number %d and bank number %d in SoundFont file "%s"
french: sfpreset : impossible de trouver un préréglage ayant le numéro de prog %d et le numéro de banque %d dans le fichier SoundFont "%s"
italian: sfpreset: non riesco a trovare un preset che abbia numero di prog %d e numero di bank %d nel file SoundFont "%s"

source: sfplay: invalid or out-of-range preset number
french: sfplay : numéro de préréglage non valide ou hors limites
italian: sfplay: numero di preset non valido o fuori intervallo

source: sfplaym: invalid or out-of-range preset number
french: sfplaym : numéro de préréglage non valide ou hors limites
italian: sfplaym: numero di preset non valido o fuori intervallo
