Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: illegal table length
french: longueur de table illégale
italian: lunghezza della tavola illegale

source: ftable %d relocating due to size change currently active instruments may find this disturbing
french: ftable %d réallouée à cause du changement de taille. les instruments actifs peuvent en être perturbés
italian: ftable %d ricollocata per cambiamento di dimensioni gli strumenti attivi potrebbero esserne disturbati

source: using extended arguments
french: utilisation d'arguments étendus
italian: uso di argomenti estesi

source: no coefs present
french: aucun coefficient n'est présent
italian: non ci sono coefficienti

source: illegal x interval
french: intervalle x interdit
italian: intervallo di x non consentito

source: insufficient arguments
french: pas assez d'arguments
italian: argomenti insufficienti

source: unknown srctable number
french: numéro de srctable inconnu
italian: numero di srctable sconosciuto

source: table size too large
french: taille de table trop grande
italian: dimensione della tavola troppo grande

source: gen call has negative segment size:
french: l'appel de GEN a une taille de segment négative :
italian: la gen chiamata ha dimensione del segmento negativa

source: illegal input vals for gen call, beginning:
french: appel de GEN avec des valeurs illégales en entrée, début :
italian: La gen chiamata ha valori in input non consentiti, inizio:

source: negative segsiz
french: segsiz négatif
italian: segsize negativo

source: nh partials < 1
french: nombre d'harmoniques nh < 1
italian: parziale nh < 1

source: illegal xint value
french: valeur xint illégale
italian: valore di xint non consentito

source: illegal xamp value
french: valeur xamp illégale
italian: valore di xamp non consentito

source: uneven number of args
french: nombre impair d'arguments
italian: numero di argomenti irregolare

source: gen call has illegal x-ordinate values:
french: l'appel gen a des valeurs d'abscisse x illégales
italian: la gen chiamata ha valori di ordinata x non consentiti

source: wrong number of args
french: nombre d'arguments incorrect
italian: numero di argomenti sbagliato

source: a range given exceeds table length
french: un intervalle donné excède la longueur de la table
italian: un intervallo dato supera la lunghezza della tavola

source: an input function does not exist
french: une fonction d'entrée n'existe pas
italian: una funzione in input non esiste

source: No such window type!
french: Pas de fenêtre de cette sorte !
italian: Non c'?? una tale finestra (window)!

source: Wrong number of input arguments
french: Nombre incorrect d'arguments en entrée
italian: Numero di argomenti in input sbagliato

source: unknown distribution
french: distribution inconnue
italian: distrbuzione sconosciuta

source: error opening ASCII file
french: erreur à l'ouverture du fichier ASCII
italian: errore in apertura del file ASCII

source: %ld elements in %s
french: %ld éléments dans %s
italian: %ld elementi in %s

source: Number(s) after table full in GEN23, starting %f
french: Nombre(s) alors que la table est pleine dans GEN23, %f démarre
italian: Numero/i in eccesso dopo aver riempito la GEN23, inizio %f

source: table size must be the same of source table
french: la taille de la table doit être la même que celle de la table source
italian: il formato della tavola deve essere la stessa della tavola di derivazione (source)

source: x coordinates must all be in increasing order:
french: les coordonnées x doivent être toutes en ordre croissant
italian: le coordinate x devono essere tutte in ordine crescente

source: x coordinate greater than function size:
french: coordonnée x supérieure à la taille de la fonction
italian: coordinata x maggiore della dimensione della tavola

source: illegal input val (y <= 0) for gen call, beginning:
french: valeur d'entrée interdite (y <= 0) dans l'appel GEN, début :
italian: valore di input non valido (y <= 0) per la gen chiamata, inizio:

source: GEN28 requires zero table length
french: GEN28 nécessite une longueur de table nulle
italian: GEN28 richiede lunghezza della tavola zero

source: could not open space file
french: impossible d'ouvrir le fichier de spatialisation
italian: Impossibile aprire il file spazializzazione

source: Time values must be in increasing order
french: Les valeurs de temps doivent être en ordre croissant
italian: I valori di tempo devono essere in ordine crescente

source: GEN30: source ftable not found
french: GEN30 : la ftable source n'a pas été trouvée
italian: GEN30: source ftable non trovata

source: GEN31: source ftable not found
french: GEN31 : la ftable source n'a pas été trouvée
italian: GEN31: source ftable non trovata

source: GEN32: source ftable %d not found
french: GEN32 : la ftable source %d n'a pas été trouvée
italian: GEN32: source ftable %d non trovata

source: GEN33: source ftable not found
french: GEN33 : la ftable source n'a pas été trouvée
italian: GEN33: source ftable non trovata

source: unknown source table number
french: numéro de table source inconnu
italian: numero di tavola sorgente sconosciuto

source: Gen41: negative probability not allowed
french: Gen41 : probabilité négative interdite
italian: Gen41: non ?? consentita una probabilit?? negativa

source: replacing previous ftable %d
french: remplacement de la ftable précédente %d
italian: sostituisco la precedente ftable %d

source: Invalid ftable no. %f
french: Numéro de ftable non valide. %f
italian: ftable num. %f non valida

source: deferred-size ftable %f illegal here
french: taille différée de la ftable %f interdite ici
italian: la dimensione differita della ftable %f non ?? valida qui

source: Deferred-size ftable %f load not available at perf time.
french: La taille différée au chargement de la ftable %f n'est pas disponible à l'exécution.
italian: Caricamento della ftable %f a dimensione differita non disponibile al momento d'esecuzione

source: non-deferred ftable %d needs size %d
french: la table non différée %d nécessite une taille %d
italian: ftable %d con dimensione non differita necessita di dimensione %d

source: invalid sample format: %d
french: format d'échantillon non valide : %d
italian: formato campione non valido: %d

source: channel %d illegal
french: le canal %d est illégal
italian: canale %d non consentito

source: deferred alloc for %s
french: allocation différée pour %s
italian: allocazione differita per %s

source: Failed to open file %s
french: L'ouverture du fichier %s a échoué
italian: Fallita apertura del file %s

source: deferred size, but filesize unknown
french: taille différée, mais taille de fichier inconnu
italian: dimensione differita, ma dimensione del file sconosciuta

source: defer length %d
french: longueur différée %d
italian: lunghezza differita %d

source: GEN1: input file truncated by ftable size
french: GEN1 : le fichier en entrée a été tronqué à la taille de la ftable
italian: GEN1: file di input troncato dalla dimensione della ftable

source: looping endpoint %d exceeds ftsize %d
french: la fin de boucle (%d) dépasse la taille de la table (%d)
italian: il punto finale del loop %d supera ftsize %d

source: GEN1 read error
french: GEN1 erreur de lecture
italian: GEN1 errore in lettura

source: GEN1: file truncated by ftable size
french: GEN1 : le fichier a été tronqué à la taille de la table
italian: GEN1: file aiff troncato dalla dimensione della ftable

source: audio samps %d exceeds ftsize %d
french: les échantillons audio %d dépassent la taille de la table (%d)
italian: campioni audio %d superano ftsize %d

source: wrong number of ftable arguments
french: nombre d'arguments incorrect pour la ftable
italian: numero sbagliato di argomenti della ftable

source: Failed to load PVOC-EX file
french: Le chargement du fichier PVOC-EX a échoué
italian: Caricamento del file PVOC-EX fallito

source: illegal channel number
french: numéro de canal illégal
italian: numero di canale non consentito

source: ftable size too small
french: taille de ftable trop petite
italian: dimensione della ftable troppo piccola

source: Not enough memory
french: Pas assez de mémoire
italian: emoria insufficiente

source: GEN51: invalid number of p-fields (too few grades)
french: GEN51 : nombre de p-champs non valide (pas assez de degrés)
italian: GEN51: numero di p-fields non valido (troppi pochi gradi)

source: number of channels inconsistent with number of args
french: nombre de canaux en contradiction avec le nombre d'arguments
italian: numero di canali incongruente con il numero di argomenti

source: GEN53: invalid number of gen arguments
french: GEN53 : nombre d'arguments de GEN non valide
italian: GEN53: numero di argomenti della gen non valido

source: GEN53: invalid table length
french: GEN53 : longueur de table non valide
italian: GEN53: lunghezza della tavola non valida

source: GEN53: invalid source table number
french: GEN53 : numéro de la table source non valide
italian: GEN53: numero di source table non valido

source: GEN53: mode must be in the range 0 to 15
french: GEN53 : le mode doit être compris entre 0 et 15
italian: GEN53: mode dev'essere nell'intervallo tra 0 e 15

source: GEN53: invalid source table length:
french: GEN53 : longueur de la table source non valide
italian: GEN53: lunghezza della source table non valida

source: GEN53: invalid window table
french: GEN53 : table de fenêtre non valide
italian: GEN53: window table non valida

source: GEN 53: impulse response input,
french: GEN53 : réponse impulsionnelle en entrée,

source: GEN 53: frequency response input,
french: GEN53 : réponse fréquentielle en entrée,

source: Deferred load of '%s' failed
french: Le chargement différé de '%s' a échoué
italian: fallito caricamento differito di '%s'

source: activating instr %s at %<PRIi64>
french: activation de l'instrument %s à %<PRIi64>
italian: strumento %s attivato a %<PRIi64>

source: activating instr %d at %<PRIi64>
french: activation de l'instrument %d à %<PRIi64>
italian: strumento %d attivato a %<PRIi64>

source: Instrument %s muted
french: Instrument %s muet
italian: Strumento %s silenziato

source: Instrument %d muted
french: Instrument %d muet
italian: Strumento %d silenziato

source: cannot allocate last note because it exceeds 100%% of cpu time
french: impossible d'allouer la dernière note car elle dépasse 100%% du temps cpu
italian: impossibile allocare l'ultima nota perch?? supera il 100%% di tempo di cpu

source: cannot allocate last note because it exceeds instr maxalloc
french: impossible d'allouer la dernière note car le nombre maximum d'allocations d'instr est atteint
italian: impossibile allocare l'ultima nota perch?? supera maxalloc dello strumento

source: new alloc for instr %s:
french: nouvelle allocation de l'instr %s :
italian: nuova allocazione per lo strumento %s:

source: new alloc for instr %d:
french: nouvelle allocation de l'instr %d :
italian: nuova allocazione per lo strumento %d:

source: instr %s uses %d p-fields but is given %d
french: l'instr %s utilise %d p-champs alors qu'il n'en a reçu que %d
italian: lo strumento %s usa %d p-fields ma gliene sono stati dati %d

source: instr %d uses %d p-fields but is given %d
french: l'instr %d utilise %d p-champs alors qu'il n'en a reçu que %d
italian: lo strumento %d usa %d p-fields ma gliene sono stati dati %d

source: instr %s now active:
french: instr %s activé :
italian: strumento %s ora attivo:

source: instr %d now active:
french: instr %d activé :
italian: strumento %d ora attivo:

source: MIDI activating instr %s
french: Activation de l'instr %s par le MIDI
italian: strumento %s attivato da MIDI

source: MIDI activating instr %d
french: Activation de l'instr %d par le MIDI
italian: strumento %d attivato da MIDI

source: new MIDI alloc for instr %s:
french: nouvelle allocation MIDI pour l'instr %s :
italian: nuova allocazione MIDI per lo strumento %s:

source: new MIDI alloc for instr %d:
french: nouvelle allocation MIDI pour l'instr %d :
italian: nuova allocazione MIDI per lo strumento %d:

source: MIDI note overlaps with key %d on same channel
french: la note MIDI chevauche la touche %d sur le même canal
italian: La nota MIDI si sovrappone alla key %d sullo stesso canale

source: removed instance of instr %s
french: une instance de l'instrument %s a été enlevée
italian: rimossa l'istanza dello strumento %s

source: removed instance of instr %d
french: une instance de l'instrument %d a été enlevée
italian: rimossa l'istanza dello strumento %d

source: instance not valid
french: instance non valide
italian: istanza non valida

source: inactive allocs returned to freespace
french: les allocation inactives ont été rendues à l'espace libre
italian: liberate le allocazioni inattive

source: could not find playing instr %f
french: impossible de trouver l'instr actif %f
italian: non trovo lo strumento attivo %f

source: INIT ERROR:
french: ERREUR D'INITIALISATION :
italian: ERRORE di INIZIALIZZAZIONE:

source: InitError in wrong mode %d
french: Erreur d'initialisation dans le mauvais mode %d

source: INIT ERROR in instr %d (opcode %s) line %d:
french: ERREUR D'INITIALISATION dans l'instr %d (opcode %s) ligne %d :

source: INIT ERROR in instr %d (subinstr %d) line %d:
french: ERREUR D'INITIALISATION dans l'instr %d (subinstr %d) ligne %d :

source: PerfError in wrong mode %d
french: Erreur d'exécution dans le mauvais mode %d

source: PERF ERROR in instr %d (opcode %s) line %d:
french: ERREUR D'EXECUTION dans l'instr %d (opcode %s) ligne %d :

source: PERF ERROR in instr %d (subinstr %d) line %d:
french: ERREUR D'EXECUTION dans l'instr %d (subinstr %d) ligne %d :

source: note aborted
french: note interrompue
italian: nota cancellata

source: subinstr: number of output args greater than nchnls
french: subinstr : nombre d'arguments de sortie supérieur à nchnls
italian: subinstr: numero di argomenti dell'output maggiore del numero dei canali

source: subinstr: too many p-fields
french: subinstr : trop de p-champs
italian: subinstr: troppi p-fields

source: Cannot find instr %d (UDO %s)
french: Impossible de trouver l'instr %d (UDO %s)

source: %s: invalid local ksmps value: %d
french: %s : valeur locale de ksmps non valide : %d

source: %s: not initialised
french: %s : non initialisé
italian: %s: non inizializzato

source: setksmps: invalid ksmps value: %d, original: %d
french: setksmps : valeur de ksmps non valide : %d, valeur originale : %d
italian: setksmps: valore di ksmps non valido: %d, originale: %d

source: subinstr: not initialised
french: subinstr : non initialisé
italian: subinstr: non inizializzato

source: instr %d allocated at %p lclbas %p, opds %p
french: instr %d alloué à %p lclbas %p, opds %p
italian: strumento %d allocato a %p lclbas %p, opds %p

source: op (%s) allocated at %p
french: op (%s) alloué à %p
italian: op (%s) allocato a %p

source: null iopadr
french: iopadr null
italian: iopadr nullo

source: null opadr
french: opadr null
italian: opadr nullo

source: FIXME: Unhandled out-arg type: %d
french: A CORRIGER : type d'arg en sortie non supporté : %d
italian: FIXME: tipo di out-arg non gestito: %d

source: FIXME: instance unexpected arg: %d
french: A CORRIGER : argument inattendu : %d
italian: FIXME: arg inatteso in istanza: %d

source: inconsistent opds total
french: total d'opds non cohérent
italian: totale opds inconsistente

source: Instrument %s is still active
french: L'instrument %s est toujours actif
italian: Strumento %s ancora attivo

source: Instrument %d is still active
french: L'instrument %d est toujours actif
italian: Strumento %d ancora attivo

source: -L stdin fcntl failed
french: -L stdin fcntl a échoué
italian: -L stdin fcntl fallito

source: Cannot open %s
french: Impossible d'ouvrir %s
italian: Impossibile aprire %s

source: Failed to set file status
french: Echec de la fixation de l'état du fichier
italian: Fallita impostazione dello stato del file

source: LineBuffer Overflow - Input Data has been Lost
french: Dépassement du Tampon de Ligne - Les données en entrée sont perdues
italian: LineBuffer Overflow - I dati in input sono stati persi

source: unknown opcode %c
french: opcode %c inconnu
italian: opcode sconosciuto %c

source: dot carry has no reference
french: le point de report de valeur (carry) n'a pas de référence
italian: il punto per riporto valore (carry) non ha riferimenti

source: cannot carry string p-field
french: impossible de reporter un p-champ chaîne de caractères
italian: impossibile riportare un p-field stringa

source: too few pfields (%d)
french: pas assez de p-champs (%d)
italian: troppi pochi pfields (%d)

source: -L with negative p2 illegal
french: -L avec un p2 négatif est illégal
italian: -L con p2 negativo illecito

source: too many pfields
french: trop de p-champs
italian: troppi pfields

source: illegal RT scoreline: %s %*s
french: ligne de partition RT illégale : %s %*s
italian: linea di score RT illecita: %s %*s

source: event: param 1 must be "a", "i", "q", "f", "d", or "e"
french: event : le paramètre 1 doit être "a", "i", "q", "f", "d" ou "e"
italian: event: parametro 1 deve essere "a", "i", "q", "f", "d", oppure "e"

source: event: string name is allowed only for "i", "d", and "q" events
french: event : un identifiant sous forme de chaîne n'est permis qu'avec les évènements "i", "d" et "q"
italian: event: nome stringa permesso solo per eventi "i", "d", e "q"

source: WARNING: Cannot Find Instrument %d
french: AVERTISSEMENT : impossible de trouver l'instrument %d

source: event: error creating '%c' event
french: event : erreur en créant l'évènement '%c'
italian: event: errore nella creazione dell'evento '%c'

source: event_i: error creating '%c' event
french: event_i: erreur en créant l'évènement '%c'
italian: event_i: errore nella creazione dell'evento '%c'

source: instance: error creating event
french: instance : erreur en créant l'évènement
italian: istanza: errore nella creazione dell'evento

source: memory allocate failure for %zd
french: échec de l'allocation de mémoire pour %zd
italian: allocazione di memoria fallita per %zd

source: failed to open file %s
french: L'ouverture du fichier %s a échoué
italian: Fallita apertura del file %s

source: failed to read file %s
french: impossible de lire le fichier %s
italian: fallita lettura file %s

source: Ill-formed CV file
french: Fichier CV non conforme
italian: file CV non conforme

source: Ill-formed LPC file
french: Fichier LPC non conforme
italian: file LPC non conforme

source: cannot load %s
french: impossible de charger %s
italian: impossibile caricare %s

source: cannot load %s, or SADIR undefined
french: impossible de charger %s, ou SADIR n'est pas défini
italian: impossibile caricare %s, oppure SADIR non definita

source: error processing file %s
french: erreur en traitant le fichier %s
italian: errore nel processamento del file %s

source: file %s (%ld bytes) loaded into memory
french: le fichier %s (%ld octets) a été chargé en mémoire
italian: file %s (%ld bytes) caricato in memoria

source: PVOCEX_LoadFile(): error:
french: PVOCEX_LoadFile() : erreur :
italian: PVOCEX_LoadFile(): errore:

source: Empty or NULL file name
french: Nom de fichier vide ou NULL
italian: nome di file vuoto o NULL

source: unable to open pvocex file %s: %s
french: impossible d'ouvrir le fichier pvocex %s : %s
italian: non riesco ad aprire il file pvocex %s: %s

source: pvoc-ex file %s is not 32bit floats
french: le fichier pvoc-ex %s n'est pas au format floats sur 32 bit
italian: il file pvoc-ex %s non ?? 32bit floats

source: pvoc-ex file %s not in AMP_FREQ format
french: le fichier pvoc-ex %s n'est pas au format AMP_FREQ
italian: il file pvoc-ex %s non ?? nel formato AMP_FREQ

source: pvoc-ex file %s is empty!
french: le fichier pvoc-ex %s est vide !
italian: il file pvoc-ex %s ?? vuoto!

source: error reading pvoc-ex file %s
french: erreur de lecture sur le fichier pvoc-ex %s
italian: errore in lettura del file pvoc-ex %s

source: error reading pvoc-ex file %s after %d frames
french: erreur de lecture sur le fichier pvoc-ex %s après %d trames
italian: errore in lettura del file pvoc-ex %s dopo %d frames

source: %s's srate = %8.0f, orch's srate = %8.0f
french: srate de %s = %8.0f, srate de l'orchestre = %8.0f

source: file %s (%<PRIi32> bytes) loaded into memory
french: le fichier %s (%<PRIi32> octets) a été chargé en mémoire
italian: file %s (%<PRIi32> bytes) caricato in memoria

source: csoundLoadSoundFile(): failed to open '%s' %s
french: csoundLoadSoundFile() : échec de l'ouverture de '%s' %s
italian: csoundLoadSoundFile(): fallita l'apertura di '%s' %s

source: csoundLoadSoundFile(): error reading '%s'
french: csoundLoadSoundFile() : erreur de lecture sur '%s'
italian: csoundLoadSoundFile(): errore in lettura di '%s'

source: File
french: Fichier

source: channel(s)
french: voix
italian: canale/i

source: sample frames
french: trames d'échantillons

source: loaded into memory
french: chargé en mémoire
italian: caricato in memoria

source: k-period aligned audio buffering
french: mise en tampon audio alignée sur la période k
italian: audio buffering allineato al k-period

source: audio buffered in %d sample-frame blocks
french: mise en tampon audio par blocs de %d trames d'échantillons
italian: audio bufferizzato in blocchi di %d sample-frame

source: Elapsed time at %s: real: %.3fs, CPU: %.3fs
french: Temps écoulé à %s : valeur réelle : %.3fs, CPU : %.3fs
italian: Tempo impiegato %s: reale: %.3fs, CPU: %.3fs

source: illegal istartempo value
french: valeur illégale du tempo de départ
italian: valore di istartempo non consentito

source: Beat mode not in force
french: Le mode beat n'est pas en vigueur
italian: Modo beat non attivato

source: header init errors
french: Erreurs dans l'initialisation de l'en-tête
italian: l'header ha errori in inizializzazione

source: orch now loaded
french: l'orchestre est maintenant chargé
italian: orchestra ora caricata

source: using Cscore processing
french: utilisation du traitement Cscore
italian: uso il processamento di Cscore

source: cannot create cscore.out
french: impossible de créer cscore.out
italian: impossibile creare cscore.out

source: cannot reopen cscore.out
french: impossible de réouvrir cscore.out
italian: impossibile raprire cscore.out

source: cannot reopen cscore.srt
french: impossible de réouvrir cscore.srt
italian: impossibile raprire cscore.srt

source: sorting cscore.out ..
french: tri de cscore.out ..
italian: ordino cscore.out ..

source: ... done
french: ... fait
italian: ... fatto

source: playing from cscore.srt
french: exécution à partir de cscore.srt
italian: suono da cscore.srt

source: %c beep!
french: %c signal sonore !

source: end of score. overall amps:
french: fin de la partition. amplitudes maximales :
italian: fine della score. ampiezza totale:

source: overall samples out of range:
french: Nombre d'échantillons hors limites :
italian: numero di campioni fuori dall'intervallo (range):

source: %d errors in performance
french: %d erreurs dans l'exécution
italian: %d errori nell'esecuzione

source: end of performance
french: fin de l'exécution
italian: fine dell'esecuzione

source: no sound written to disk
french: aucun son n'a été écrit sur le disque
italian: nessun suono scritto sul disco

source: number of samples out of range:
french: nombre d'échantillons hors limites :
italian: numero di campioni fuori dall'intervallo:

source: end of section %d sect peak amps:
french: fin de la section %d amplitudes maximales de la section :
italian: fine della sezione %d picchi d'ampiezza della sezione:

source: end of lplay event list peak amps:
french: fin de la liste d'évènements lplay amplitudes maximales :
italian: fine lista eventi di lplay picco d'ampiezza:

source: - note deleted. instr %s undefined
french: - note affacée. instr %s non défini
italian: - nota cancellata. strumento %s non definito
