Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: Setting instrument %s %s
french: Lancement de l'instrument %s %s
italian: Fisso lo strumento %s %s

source: off
french: arrêt

source: on
french: marche

source: - note deleted. instr %d(%d) undefined
french: - note affacée. instr %d(%d) non défini
italian: - nota cancellata. strumento %d(%d) non definito

source: Setting instrument %d %s
french: Lancement de l'instrument %d %s
italian: Fisso lo strumento %d %s

source: - note deleted. i%d (%s) had %d init errors
french: - note affacée. i%d (%s) a eu %d erreurs d'initialisation
italian: - nota cancellata. i%d (%s) ha %d errori di inizializzazione

source: - note deleted. i%d had %d init errors
french: - note affacée. i%d a eu %d erreurs d'initialisation
italian: - nota cancellata. i%d ha %d errori di inizializzazione

source: time advanced %5.3f beats by score request
french: le temps a avancé de %5.3f pulsations à la demande de la partition
italian: avanzamento del tempo di %5.3f beats su richiesta della score

source: T%7.3f - note deleted.
french: T%7.3f - note affacée.
italian: T%7.3f - nota cancellata.

source: instr %s had %d init errors
french: l'instr %s a eu %d erreurs d'initialisation
italian: lo strumento %s ha %d errori di inizializzazione

source: instr %d had %d init errors
french: l'instr %d a eu %d erreurs d'initialisation
italian: lo strumento %d ha %d errori di inizializzazione

source: terminating.
french: terminaison.
italian: finito.

source: error in score. illegal opcode %c (ASCII %d)
french: erreur dans la partition. L'opcode %c (ASCII %d) est illégal
italian: errore nella score. opcode illecito %c (ASCII %d)

source: insert_score_event(): invalid named instrument
french: insert_score_event() : instrument nommé non valide
italian: insert_score_event(): nome dello strumento non valido

source: insert_score_event(): invalid instrument number or name %d
french: insert_score_event() : numéro ou nom d'instrument non valide %d
italian: insert_score_event(): numero o nome dello strumento non valido %d

source: insert_score_event(): unknown opcode: %c
french: insert_score_event() : opcode inconnu : %c
italian: insert_score_event(): opcode sconosciuto: %c

source: insert_score_event(): insufficient p-fields
french: insert_score_event() : pas assez de p-champs
italian: insert_score_event(): p-fields insufficienti

source: cannot rewind score: no score in memory
french: impossible de remonter la partition : pas de partition en mémoire
italian: non posso riavvolgere la score: nessuna score in memoria

source: WARNING: instr %s not found
french: AVERTISSEMENT : instr %s non trouvé

source: Cannot Find Instrument %d
french: Impossible de trouver l'instrument %d
italian: Impossibile trovare lo strumento %d

source: instr %s not found
french: instr %s non trouvé
italian: strumento %s non trovato

source: cannot find the specified instrument or opcode
french: impossible de trouver l'instrument ou l'opcode spécifié
italian: impossibile trovare lo strumento o l'opcode specificato

source: ** found CS_UDO_DIR=%s
french: ** trouvé CS_USO_DIR=%s
italian: ** trovato CS_UDO_DIR=%s

source: parser: failed to open input file %s
french: parser : l'ouverture du fichier d'entrée %s a échoué
italian: parser: fallita apertura del file di input %s

source: Unmatched #ifdef or #ifndef
french: #ifdef ou #ifndef non apparié

source: Parsing successful!
french: Analyse réussie !
italian: Analisi effettuata con successo!

source: Parsing failed due to invalid input!
french: Echec de l'analyse à cause d'une entrée non valide !
italian: Analisi fallita a causa di input non valido!

source: Parsing failed due to memory exhaustion!
french: Echec de l'analyse par manque de méloire !
italian: Analisi fallita per esaurimento memoria!

source: Parsing failed due to %d syntax error%s!
french: Echec de l'analyse, %d erreurs de syntaxe %s !
italian: Analisi fallita a causa di %d errori di sintassi %s !

source: Parsing failed due to %d semantic error%s!
french: Echec de l'analyse, %d erreurs sémantiques %s !
italian: Analisi fallita a causa di %d errori semantici %s !

source: Parsing failed due to syntax errors
french: Echec de l'analyse à cause d'erreurs de syntaxe
italian: Analisi fallita a causa di errori di sintassi

source: Parsing failed due to no input!
french: Echec de l'analyse par manque d'entrée !
italian: Analisi fallita a causa di nessun input!

source: Stopping on parser failure
french: Arrêt sur échec du parseur

source: ERROR: illegal character %c(%.2x) in scoreline:
french: ERREUR : caractère illégal %c(%.2x) dans la ligne de partition :
italian: ERRORE: carattere illecito %c(%.2x) alla linea di score:

source: remainder of line flushed
french: le reste de la ligne a été ignoré
italian: resto della linea ignorato

source: ERROR: too many pfields:
french: ERREUR : trop de p-champs
italian: ERRORE: troppi pfields:

source: sort: illegal opcode %c(%.2x)
french: sort : opcode illégal %c(%.2x)
italian: sort: opcode illecito %c(%.2x)

source: sread: text space overrun, increase MARGIN
french: sread : dépassement de l'espace de texte, augmenter MARGIN
italian: sread: lo spazio del testo eccede, incremento del MARGINE

source: score error:
french: erreur de partition :
italian: errore nella score:

source: section %d: at position %d%s
french: section %d : position %d%s
italian: sezione %d: alla posizione %d%s

source: Internal error in print_input_backtrace()
french: Erreur interne dans print_input_backtrace()
italian: Errore interno in print_input_backtrace()

source: included from line %d of macro %s%s
french: inclus depuis la ligne %d de la macro %s%s
italian: incluso dalla linea %d della macro %s%s

source: called from line %d of macro %s%s
french: appelé depuis la ligne %d de la macro %s%s
italian: chiamata dalla linea %d della macro %s%s

source: in line %d of macro %s%s
french: dans la ligne %d de la macro %s%s
italian: alla linea %d della macro %s%s

source: Internal error op=%c
french: Erreur interne op=%c
italian: Errore interno op=%c

source: Clockbase = %f
french: Base de l'horloge = %f

source: m Named section >>>%s<<<
french: m section nommée >>>%s<<<
italian: m Sezione con nome >>>%s<<<

source: Name %s not found
french: Nom %s non trouvé
italian: Nome %s non trovato

source: Warp_factor = %f
french: Facteur de déformation = %f

source: sread is confused on legal opcodes %c(%.2x)
french: sread hésite sur des opcodes légaux %c(%.2x)
italian: sread ?? confuso sugli opcodes leciti %c(%.2x)

source: No previous event for ^
french: Pas d'évènement précédent pour ^
italian: Non c'?? l'evento precedente per ^

source: illegal space following %s, zero substituted
french: espace illégal après %s, remplacé par zéro
italian: spazio illecito seguente %s, sostituito con zero

source: ignoring '%s' in '%c' event
french: '%s' a été ignoré dans l'évènement '%c'
italian: ignorato '%s' nell'evento '%c'

source: ! invalid in p1, p2, or p3
french: ! non valide dans p1, p2 ou p3
italian: ! non valido in p1, p2, or p3

source: remainder of line flushed
french: le reste de la ligne a été ignoré
italian: resto della linea ignorato

source: illegal character after !: '%c'
french: caractère illégal après !: '%c'
italian: carattere illecito dopo !: '%c'

source: WARNING: instr %s not found, assuming insno = -1
french: AVERTISSEMENT : instr %s non trouvé, on suppose que insno = -1
italian: ATTENZIONE: strumento %s non trovato, insno = -1

source: sread: illegal use of carry, 0 substituted
french: sread : utilisation illégale du report, remplacé par 0
italian: sread: uso illecito del riporto, sostituito 0

source: illegal opcode %c
french: opcode %c illégal
italian: opcode illecito %c

source: illegal placement of number in [] expression
french: placement illégal d'un nombre dans l'expression []
italian: piazzamento illecito di numero in espressione []

source: illegal placement of operator ~ in [] expression
french: placement illégal de l'opérateur ~ dans l'expression []
italian: piazzamento illecito dell'operatore ~ in espressione []

source: illegal placement of operator @ or @@ in [] expression
french: placement illégal des opérateurs @ ou @@ dans l'expression []
italian: piazzamento illecito dell'operatore @ o @@ in espressione []

source: unexpected char %c
french: caractère %c inattendu
italian: carattere inatteso %c

source: illegally placed string
french: sread : chaîne placée illégalement
italian: stringa piazzata illecitamente

source: unmatched quote
french: guillemet non apparié
italian: virgolette senza corrispondenza

source: sread: illegal number format:
french: sread : format de nombre illégal :
italian: sread: formato numerico illecito:

source: zero substituted.
french: remplacé par zéro.
italian: sostituito zero.

source: swrite: unexpected opcode %c, section %d line %d
french: swrite : opcode inattendu %c, sect %d ligne %d
italian: swrite: opcode %c inatteso, sezione %d alla linea %d

source: swrite: output, sect%d line%d p%d makes illegal reference to
french: swrite : la sortie, sect %d ligne %d p%d fait illégalement référence à
italian: swrite: output, sez%d linea%d p%d fa illecito riferimento a

source: Zero substituted
french: Remplacé par zéro
italian: sostituito zero

source: swrite: output, sect%d line%d p%d has illegal ramp symbol
french: swrite : sortie, sect %d ligne %d p%d a un symbole de rampe illégal
italian: swrite: output, sez%d linea%d p%d ha illecito simbolo ramp

source: swrite: output, sect%d line%d p%d ramp has illegal forward or backward ref
french: swrite : sortie, sect %d ligne %d p%d, la rampe a une réf avant ou arrière illégale
italian: swrite: output, sez%d linea%d p%d ramp fa riferimento a precedente o successivo illecito

source: swrite: output, sect%d line%d p%d has illegal expramp symbol
french: swrite : sortie, sect %d ligne %d p%d a un symbole de rampe exponentielle illégal
italian: swrite: output, sez%d linea%d p%d ha simbolo expramp illecito

source: swrite: output, sect%d line%d p%d expramp has illegal forward or backward ref
french: swrite : sortie, sect %d ligne %d p%d, la rampe exponentielle a une réf avant ou arrière illégale
italian: swrite: output, sez%d linea%d p%d expramp fa riferimento illecito a precedente o sucessivo

source: swrite: output, sect%d line%d p%d has illegally terminated string
french: swrite : sortie, sect %d ligne %d p%d a une chaîne terminée illégalement
italian: swrite: output, sez%d linea%d p%d ha stringa terminante illecitamente

source: swrite: output, sect%d line%d p%d has illegal number
french: swrite : sortie, sect %d ligne %d p%d a un numéro illégal
italian: swrite: output, sez%d linea%d p%d ha numero illecito

source: String truncated
french: Chaîne tronquée
italian: Stringa troncata

source: Type confusion for %s (%d,%d), replacing
french: Confusion de type pour %s (%d,%d), remplacement

source: invalid input argument types found for opcode %s: %s
french: types d'arguments en entrée non valides pour l'opcode %s: %s
italian: tipo di argomento di input non valido per l'opcode %s: %s

source: invalid output argument types found for opcode %s: %s
french: types d'argument en sortie non valides pour l'opcode %s: %s
italian: tipo di argomento di output non valido per l'opcode %s: %s

source: invalid input type for opcode %s
french: type d'entrée non valide pour l'opcode %s
italian: tipo di input non valido per l'opcode %s

source: invalid output type for opcode %s
french: type de sortie non valide pour l'opcode %s
italian: tipo di output non valido per l'opcode %s

source: invalid name for opcode
french: nom d'opcode non valide
italian: nome dell'opcode non valido

source: cannot redefine %s
french: impossible de redéfinir %s
italian: Impossibile ridefinire %s

source: WARNING: redefined opcode: %s
french: AVERTISSEMENT : opcode redéfini : %s
italian: ATTENZIONE: opcode ridefinito: %s

source: error:
french: erreur :
italian: errore:

source: twarp: illegal opcode
french: twarp : opcode illégal
italian: twarp: opcode illecito

source: twarp: t has extra or disordered beat value
french: twarp : t a une valeur de pulsation en trop ou désordonnée
italian: twarp: t con valore di beat extra o disordinato

source: twarp: t has non-positive tempo
french: twarp : t a un tempo non positif
italian: twarp: t con tempo non positivo

source: %d MIDI sources in system
french: %d sources MIDI dans le système
italian: %d fonti MIDI nel sistema

source: receiving from all sources
french: réception de toutes les sources
italian: ricevo da tutte le fonti

source: connecting midi device %d: %s
french: connexion du périphérique midi %d : %s
italian: connessione dispositivo midi %d: %s

source: MIDI device number %d is out-of-range, not connected
french: Le périphérique MIDI numéro %d est hors limites, pas de connexion
italian: numero %d di dispositivo MIDI fuori intervallo, non connesso

source: output not implemented yet in CoreMIDI
french: sortie pas encore implémentée dans CoreMIDI
italian: output non ancora implementato in CoreMIDI

source: rtmidi: CoreMIDI module enabled
french: rtmidi : module CoreMIDI activé
italian: rtmidi: modulo CoreMIDI abilitato

source: WSAStartup failed!
french: Le démarrage de WSA a échoué
italian: WSAStartup fallito!

source: Error creating socket
french: Erreur lors de la création du socket
italian: Errore nella creazione del socket

source: Error binding socket to interface: %s
french: Erreur lors de la liaison du socket à l'interface : %s
italian: Errore nel vincolare socket all'interfaccia: %s

source: Error adding membership to interface: %s
french: Erreur lors d'une adhésion à l'interface : %s
italian: Errore nell'aggiungere membro all'interfaccia: %s

source: ipMIDI real time MIDI plugin for Csound
french: greffon temps réel ipMIDI pour Csound
italian: ipMIDI plugin MIDI in tempo reale per Csound

source: ipmidi: ipMIDI module enabled
french: ipmidi : module ipMIDI activé
italian: ipmidi: modulo ipMIDI abilitato

source: error: no input file name
french: erreur : pas de nom de fichier d'entrée
italian: errore: manca il nome del file di input

source: Failed to initialise real time audio input
french: L'initialisation de l'entrée audio en temps réel a échoué
italian: Fallita inizializzazione dell'input audio in tempo reale

source: isfinit: cannot open %s -- %s
french: isfinit : impossible d'ouvrir %s -- %s
italian: isfinit: impossibile aprire %s -- %s

source: isfinit: cannot open %s
french: isfinit : impossible d'ouvrir %s
italian: isfinit: impossibile aprire %s

source: audio_in %s has sr = %d, orch sr = %d
french: l'entrée audio %s a sr = %d, l'orchestre a sr = %d
italian: audio_in %s ha sr = %d, orch sr = %d

source: audio_in %s has %d chnls, orch %d chnls_i
french: l'entrée audio_in %s a %d voix, l'orchestre a %d voix
italian: audio_in %s ha %d chnls, orch %d chnls_i

source: reading %d sample blks of %lu-bit floats from %s
french: lecture de %d blocs d'échantillons de flottants sur %lu-bit depuis %s
italian: lettura di %d blocchi-campione di %lu-bit floats da %s

source: reading %d-byte blks of %s from %s (%s)
french: lecture de blocs de %d octets de %s à partir de %s (%s)
italian: lettura blocchi di %d-byte di %s da %s (%s)

source: Output file type changed to %s for use in pipe
french: Type du fichier de sortie changé en %s pour utilisation dans un pipe
italian: Tipo di file output cambiato in %s per usarlo nella pipe

source: Failed to initialise real time audio output
french: L'initialisation de la sortie audio en temps réel a échoué
italian: Fallita inizializzazione dell'output audio in tempo reale

source: sfinit: cannot open fd %d %s
french: sfinit : impossible d'ouvrir fd %d %s
italian: sfinit: impossibile aprire fd %d %s

source: sfinit: cannot open %s
french: sfinit : impossible d'ouvrir %s
italian: sfinit: impossibile aprire %s

source: sfinit: cannot open %s %s
french: sfinit : impossible d'ouvrir %s %s
italian: sfinit: impossibile aprire %s %s

source: writing %d sample blks of %lu-bit floats to %s
french: écriture de %d blocs d'échantillons de flottants sur %lu-bit vers %s
italian: scrittura di %d blocchi-campione di %lu-bit floats su %s

source: writing %d-byte blks of %s to %s
french: écriture de blocs de %2$s de %1$d octets vers %3$s
italian: scrittura blocchi di %d-byte di %s su %s

source: sample blks of
french: blocs d'échantillons de
italian: blocchi campione di

source: -bit floats written to
french: -bit flottants écrits vers
italian: -bit floats scritti su

source: %<PRIi32> %d sample blks of %s written to %s
french: %<PRIi32> %d blocs d'échantillons de %s écrits vers %s
italian: %<PRIi32> %d blocchi-campione di %s scritti su %s

source: soundfile write returned bytecount of %d, not %d
french: l'écriture du fichier son a retourné un compte de %d octets au lieu de %d
italian: il soundfile scritto restituisce conteggio byte di %d, non %d

source: (disk may be full... closing the file ...)
french: (disque peut-être plein... fermeture du fichier ...)
italian: (forse disco pieno... chiusura file ...)

source: ... closed
french: ... fermé
italian: ... chiuso

source: not writing to sound disk
french: pas d'écriture vers un sound disk
italian: nessuna scrittura su sound disk

source: channel request %d illegal
french: demande de canal %d illégale
italian: canale richiesto %d illecito

source: undetermined file length, will attempt requested duration
french: longueur de fichier indéterminée, essai avec la durée demandée
italian: lunghezza indeterminata del file, tenter?? la durata richiesta

source: full requested duration not available
french: la durée totale demandée n'est pas disponible
italian: durata totale richista non disponobile

source: analysing %ld sample frames (%3.1f secs)
french: analyse de %ld trames d'échantillons (%3.1f sec)
italian: analis di %ld sample frames (%3.1f secs)

source: from timepoint %3.1f
french: à partir de la position temporelle %3.1f
italian: dal timepoint %3.1f

source: soundfile read error
french: erreur de lecture du fichier son
italian: errore in lettura del soundfile

source: soundin cannot open %s: %s
french: soundin ne peut pas ouvrir %s : %s
italian: soundin non pu?? aprire %s: %s

source: -s %d overriding soundfile sr %d
french: -s %d prend le pas sur le sr %d du fichier son
italian: -s %d sovrascrive soundfile sr %d

source: error: req chan %d, file %s has only %d
french: erreur : canal %d demandé alors que le fichier %s n'en a que %d
italian: errore: richiesto canale %d, file %s ne ha solo %d

source: monaural
french: mono
italian: mono

source: stereo
french: stéréo

source: quad
french: quadro

source: %d-channels
french: %d voix
italian: %d-canali

source: , reading %s channels
french: , lecture de %s voix
italian: , lettura di %s canali

source: both
french: les deux
italian: entrambe

source: all
french: tous
italian: tutti

source: , reading channel %d
french: , lecture du canal %d
italian: , lettura canale %d

source: opening %s infile %s
french: ouverture de %s, fichier d'entrée %s
italian: apertura %s infile %s

source: soundin: invalid skip time
french: soundin : temps de décalage dans le fichier non valide
italian: soundin: skip time non valido

source: soundin seek error
french: soundin : erreur seek
italian: errore ricerca di soundin

source: 0dBFS level = %.1f
french: Niveau 0dBFS = %.1f

source: unknown
french: inconnu
italian: sconosciuto

source: unsigned bytes
french: octets non signés

source: signed chars
french: caractères signés

source: alaw bytes
french: octets alaw

source: ulaw bytes
french: octets ulaw

source: shorts
french: entiers courts

source: longs
french: entiers longs

source: floats
french: flottants

source: double floats
french: doubles flottants

source: 24bit ints
french: entiers sur 24 bit

source: vorbis encoding
french: encodage vorbis
italian: codifica vorbis

source: *** unexpected end of MIDI file
french: *** terminaison anormale du fichier MIDI
italian: *** fine inaspettata del file MIDI

source: *** unexpected end of MIDI track
french: *** terminaison anormale de piste MIDI
italian: *** fine inaspettata della traccia MIDI

source: *** invalid dynamic length data in MIDI file
french: *** données de longueur dynamique non valides dans le fichier MIDI
italian: *** lunghezza dati dinamici non valida nel file MIDI

source: *** unexpected event 0x%02X
french: *** évènement anormal 0x%02X
italian: *** evento inatteso 0x%02X

source: *** invalid MIDI file data
french: *** données de fichier MIDI non valides
italian: *** file dati MIDI non valido

source: *** unexpected end of system exclusive message
french: *** terminaison anormale d'un message system exclusive
italian: *** fine inaspettata di system exclusive message

source: *** invalid system exclusive message in MIDI file
french: *** message system exclusive non valide dans le fichier MIDI
italian: *** system exclusive message non valido nel MIDI file

source: Copyright info:
french: Information de Copyright :

source: Track name:
french: Nom de piste :
italian: Nome traccia:

source: Instrument name:
french: Nom d'instrument :
italian: Nome strumento:

source: Song lyric:
french: Parole de chanson :
italian: Testo della canzone:

source: *** invalid tempo
french: *** tempo non valide
italian: *** tempo non valido

source: *** invalid end of track event
french: *** terminaison d'un évènement de piste non valide
italian: *** fine non valida di evento traccia

source: *** trailing garbage at end of MIDI track
french: *** données incohérentes en fin de piste MIDI
italian: *** rimasugli spuri alla fine della traccia MIDI

source: *** unknown MIDI message: 0x%02X
french: *** message MIDI inconnu : 0x%02X
italian: *** messaggio MIDI sconosciuto: 0x%02X

source: *** invalid MIDI track header
french: *** en-tête de piste MIDI non valide
italian: *** header della traccia MIDI non valido

source: *** error opening MIDI file '%s': %s
french: *** erreur à l'ouverture du fichier MIDI '%s' : %s
italian: *** errore in apertura del file MIDI '%s': %s

source: Reading MIDI file '%s'...
french: Lecture du fichier MIDI '%s'...
italian: Lettura del file MIDI '%s'...

source: *** invalid MIDI file header
french: *** en-tête de fichier MIDI non valide
italian: *** header del file MIDI non valido

source: *** MIDI file format %d is not supported
french: *** le format de fichier MIDI %d n'est pas supporté
italian: *** il formato del file MIDI %d non ?? supportato

source: *** invalid number of tracks
french: *** nombre de pistes non valide
italian: *** numero di tracce non valido

source: WARNING: format 0 MIDI file with multiple tracks
french: AVERTISSEMENT : fichier MIDI 0 avec plusieurs pistes
italian: ATTENZIONE: formato del file MIDI 0 con tracce multiple

source: *** invalid time code: %d
french: *** time code non valide : %d
italian: *** time code non valido: %d

source: *** invalid mute track list format
french: *** format non valide de liste de pistes muettes
italian: *** formato lista delle tracce silenziate non valido

source: Track %2d
french: Piste %2d
italian: Traccia %2d

source: Track %2d is muted
french: La piste %2d est muette
italian: Traccia %2d ?? silenziata

source: done.
french: fait.
italian: fatto.

source: end of midi track in '%s'
french: fin de la piste midi dans '%s'
italian: fine della traccia midi in '%s'

source: %d forced decays, %d extra noteoffs
french: %d chutes forcées, %d extra noteoffs
italian: %d decays forzati, %d extra noteoffs

source: *** buffer overflow while reading MIDI file events
french: *** dépassement de tampon en lisant les évènements du fichier MIDI
italian: *** buffer overflow durante la lettura degli eventi del file MIDI

source: Failed to load MIDI file.
french: Le chargement du fichier MIDI a échoué.
italian: Caricamento del file MIDI fallito

source: Cannot rewind MIDI score
french: Impossible de reprendre la partition MIDI
italian: Non posso riavvolgere la score MIDI
