Repository: csound/csound
Catalog: po/*.po
Languages: french, italian

source: could not connect to JACK server
french: impossible de se connecter au serveur JACK
italian: Non riesco a connettermi al server JACK

source: invalid number of channels
french: nombre de canaux non valide
italian: numero di canali non valido

source: invalid number of input channels
french: nombre de canaux d'entrée non valide
italian: numero di canali di input non valido

source: invalid sample rate
french: taux d'échantillonnage non valide
italian: frequenza di campionamento non valida

source: sample rate %d does not match JACK sample rate %d
french: taux d'échantillonnage %d pas conforme à celui de JACK %d
italian: la frequenza di campionamento %d non corrisponde a quella di JACK %d

source: invalid period size (-b)
french: taille de période non valide (-b)
italian: period size (-b) non valida

source: invalid buffer size (-B)
french: taille de tampon non valide (-B)
italian: buffer size non valida (-B)

source: buffer size (-B) is too small
french: taille de tampon (-B) trop petite
italian: buffer size (-B) ?? troppo piccolo

source: error setting sample rate callback
french: erreur en fixant le callback du taux d'échantillonnage
italian: errore impostazione della frequenza di campionamento del callback

source: error setting buffer size callback
french: erreur en fixant le callback de la taille du tampon
italian: errore impostazione dimensione del buffer callback

source: error setting freewheel callback
french: erreur en fixant le callback du freewheel
italian: errore impostazione freewheel callback

source: error setting xrun callback
french: erreur en fixant le callback de xrun
italian: errore impostazione xrun callback

source: error setting process callback
french: erreur en fixant le callback de xrun
italian: errore impostazione processo callback

source: error activating JACK client
french: erreur à l'activation du client JACK
italian: errore attivazione JACK client

source: connecting channel %d to %s
french: connexion du canal %d à %s
italian: connessione canale %d a %s

source: failed to autoconnect input channel %d (needs manual connection)
french: échec de la connexion automatique du canal d'entrée %d (il faut une connexion manuelle)

source: jack port %d not valid failed to autoconnect input channel %d (needs manual connection)
french: port jack %d non valide échec de la connexion automatique du canal d'entrée %d (il faut une connexion manuelle)

source: input ports not connected
french: ports d'entrée non connectés

source: failed to autoconnect output channel %d (needs manual connection)
french: échec de la connexion automatique du canal de sortie %d (il faut une connexion manuelle)
italian: fallita autoconnessione del canale d'output %d (?? necessaria la connessione manuale)

source: jack port %d not valid failed to autoconnect output channel %d (needs manual connection)
french: port jack %d non valide échec de la connexion automatique du canal de sortie %d (il faut une connexion manuelle)

source: output ports not connected
french: ports de sortie non connectés

source: input and output parameters are not consistent
french: les paramètres d'entrée et de sortie ne sont pas consistants
italian: parametri di input e di output incompatibili

source: period size (-b) must be an integer multiple of ksmps
french: la taille de la période (-b) doit être un multiple entier de ksmps
italian: period size (-b) deve essere un multiplo intero di ksmps

source: sample rate must be an integer
french: le taux d'échantillonnage doit être entier
italian: la frequenza di campionamento deve essere un intero

source: JACK sample rate changed
french: le taux d'échantillonnage de JACK a changé
italian: frequenza di campionamento di JACK cambiata

source: no connection to JACK server
french: pas de connexion au serveur JACK
italian: nessuna connessione al server JACK

source: *** rtjack: connection to JACK server was lost, reconnecting...
french: *** rtjack : la connexion au serveur JACK a été perdue, reconnexion...
italian: *** rtjack: connessione al server JACK persa, riconnessione...

source: rtjack: input audio timeout
french: rtjack : dépassement de temps sur l'entrée audio
italian: rtjack: timeout dell'input audio

source: rtjack: xrun in real time audio
french: rtjack : xrun en audio temps réel

source: JACK real-time audio module for Csound
french: Module audio en temps réel JACK pour Csound
italian: modulo JACK audio in tempo reale per Csound

source: *** rtjack: error allocating globals
french: *** rtjack : erreur d'allocation des variables globales
italian: *** rtjack: errore allocazione globali

source: JACK client name (default: csound6)
french: Nom du client JACK (par défaut : csound6)

source: JACK input port name prefix (default: input)
french: Préfixe du nom du port d'entrée de JACK (par défaut : input)
italian: prefisso nome porta d'input JACK (default: input)

source: JACK output port name prefix (default: output)
french: Préfixe du nom du port de sortie de JACK (par défaut : output)
italian: prefisso nome porta d'output JACK (default: output)

source: Deprecated
french: Obsolète
italian: Obsoleto

source: JACK MIDI module for Csound
french: Module JACK MIDI pour Csound
italian: modulo JACK MIDI per Csound

source: *** rtjack MIDI: error allocating globals
french: *** rtjack MIDI : erreur d'allocation des variables globales
italian: *** rtjack MIDI: errore allocazione globali

source: JACK MIDI client name prefix (default: csound6-midi)
french: Préfixe du nom du client JACK MIDI (par défaut : csound6_midi)

source: JACK MIDI input port name(default: port)
french: Nom du port d'entrée JACK MIDI (par défaut : port)
italian: JACK MIDI nome porta d'input (default: port)

source: JACK MIDI output port name (default: port)
french: Préfixe du nom du port de sortie de JACK (par défaut : output)
italian: JACK MIDI nome porta d'output (default: port)

source: Jack MIDI module: buffer overflow
french: Module MIDI Jack : dépassement de tampon
italian: modulo Jack MIDI: buffer overflow

source: Jack MIDI module: failed to create client for input
french: Module MIDI Jack : échec de la création du client en entrée
italian: modulo Jack MIDI: fallita creazione del cliente per l'input

source: Jack MIDI module: failed to register input port
french: Module MIDI Jack : échec de l'enregistrement du port d'entrée
italian: modulo Jack MIDI: fallita registrazione della porta d' input

source: Jack MIDI module: failed to set input process callback
french: Module MIDI Jack : échec de la fixation du callbackdu processus d'entrée
italian: modulo Jack MIDI: fallita impostazione del processo di callback dell'input

source: Jack MIDI module: failed to activate input
french: Module MIDI Jack : échec de l'activation de l'entrée
italian: modulo Jack MIDI: fallita l'attivazione dell'input

source: Jack MIDI module: failed to connect to: %s
french: Module MIDI Jack : échec de la connexion à : %s
italian: modulo Jack MIDI: fallita la connessione a: %s

source: Jack MIDI module: out buffer overflow
french: Module MIDI Jack : dépassement du tampon de sortie
italian: modulo Jack MIDI: buffer overflow dell'out

source: Jack MIDI module: failed to create client for output
french: Module MIDI Jack : échec de la création du client en sortie
italian: modulo Jack MIDI: fallita creazione del cliente per l'output

source: Jack MIDI module: failed to register output port
french: Module MIDI Jack : échec de l'enregistrement du port de sortie
italian: modulo Jack MIDI: fallita registrazione della porta d'output

source: Jack MIDI module: failed to activate output
french: Module MIDI Jack : échec de l'activation de la sortie
italian: modulo Jack MIDI: fallita attivazione dell'output

source: Jack MIDI out module: failed to connect to: %s
french: Module MIDI Jack : échec de la connexion à : %s
italian: modulo out Jack MIDI: fallita connessione a: %s

source: rtaudio: JACK module enabled
french: rtaudio : module JACK activé
italian: rtaudio: modulo JACK abilitato

source: rtmidi: JACK module enabled
french: rtmidi : module JACK activé
italian: rtmidi: modulo JACK abilitato

source: *** PortAudio: error:
french: *** PortAudio : erreur :
italian: *** PortAudio: errore:

source: %s device number %d is out of range
french: Le numéro %2$d du périphérique %1$s est hors limites
italian: %s dispositivo numero %d fuori range

source: output
french: sortie

source: input
french: entrée

source: PortAudio: selected %s device '%s'
french: PortAudio : %s périphérique sélectionné '%s'
italian: PortAudio: selezionato %s dispositivo '%s'

source: PortAudio: failed to obtain device info.
french: PortAudio : l'obtention d'information sur le périphérique a échoué.
italian: PortAudio: fallito ottenimento info dispositivo.

source: Must specify a device number, not a name
french: Il faut spécifier un numéro de périphérique, pas un nom
italian: Si deve specificare un numero di dispositivo, non un nome

source: No sound device is available
french: Aucun périphérique de son n'est disponible
italian: Nessun dispositivo di suono disponibile

source: Inconsistent full-duplex buffer sizes
french: Tailles de tampon full-duplex contradictoires
italian: Dimensione buffer full-duplex incompatibile

source: Inconsistent full-duplex sample rates
french: Taux d'échantillonnage full-duplex contradictoires
italian: Frequenza di campionamento full-duplex incompatibile

source: WARNING: buffer size should be an integer multiple of ksmps in full-duplex mode
french: AVERTISSEMENT : la taille de tampon doit être un multiple entier de ksmps en mode full-duplex
italian: ATTENZIONE: la dimensione del buffer deve essere un multiplo intero di ksmps in full-duplex mode

source: closing device
french: fermeture du périphérique
italian: chiusura dispositivo

source: PortAudio: using ALSA device '%s'
french: PortAudio : utilisation du périphérique ALSA '%s'
italian: PortAudio: uso del dispositivo ALSA '%s'

source: rtaudio: PortAudio module enabled ...
french: rtaudio : module PortAudio activé ...
italian: rtaudio: modulo PortAudio abilitato ...

source: using blocking interface
french: utilisation de l'interface bloquante
italian: uso dell'interfaccia a blocchi

source: using callback interface
french: utilisation de l'interface de callback
italian: uso dell'interfaccia callback

source: PulseAudio client RT IO module for Csoundby Victor Lazzarini
french: Module client d'E/S TR PulseAudio pour Csound par Victor Lazzarini
italian: PulseAudio cliente RT IO per Csound di Victor Lazzarini

source: *** rtpulse: error allocating globals
french: *** rtpulse : erreur d'allocation des variables globales
italian: *** rtpulse: errore allocazione globali

source: PulseAudio output server: default
french: Serveur PulseAudio de sortie : par défaut
italian: PulseAudio server output: default

source: PulseAudio output server %s
french: Serveur PulseAudio de sortie %s
italian: PulseAudio server output %s

source: pulseaudio output open
french: Sortie PulseAudio ouverte
italian: pulseaudio aperto l'output

source: Pulse audio module error: %s
french: Erreur du module PulseAudio : %s
italian: Pulse errore modulo audio: %s

source: PulseAudio input server: default
french: Serveur PulseAudio en entrée : par défaut
italian: PulseAudio server input: default

source: PulseAudio input server %s
french: Serveur PulseAudio en entrée %s
italian: PulseAudio server input %s

source: rtaudio: pulseaudio module enabled
french: rtaudio : module pulseaudio activé
italian: rtaudio: modulo pulseaudio abilitato

source: winmm: error:
french: winmm : erreur :
italian: winmm: errore:

source: too many buffers
french: trop de tampons
italian: troppi buffers

source: failed to prepare buffers
french: la préparation des tampons a échoué
italian: fallita preparazione dei buffers

source: invalid sample format: must be -s, -l, or -f
french: format d'échantillon non valide : doit être -s, -l ou -f
italian: formato campione non valido: deve essere -s, -l, o -f

source: The available output devices are:
french: Les périphériques de sortie disponibles sont :
italian: I dispositivi di output disponibili sono:

source: No output device is available
french: Aucun périphérique de sortie n'est disponible
italian: nessun dispositivo di output disponibile

source: Device number is out of range
french: Le numéro du périphérique est hors limites
italian: Numero dispositivo fuori range

source: winmm: opening output device %d (%s)
french: winmm : ouverture du périphérique de sortie %d (%s)
italian: winmm: apertura dispositivo di output %d (%s)

source: The available input devices are:
french: Les périphériques d'entrée disponibles sont :
italian: I dispositivi di input disponibili sono:

source: no input device is available
french: aucun périphérique d'entrée n'est disponible
italian: nessun dispositivo di input disponibile

source: device number is out of range
french: le numéro du périphérique est hors limites
italian: Numero dispositivo fuori range

source: winmm: opening input device %d (%s)
french: winmm : ouverture du périphérique d'entrée %d (%s)
italian: winmm: apertura dispositivo di input %d (%s)

source: failed to open device
french: l'ouverture du périphérique a échoué
italian: fallita apertura del dispositivo

source: rtmidi: no input devices are available
french: rtmidi : aucun périphérique d'entrée n'est disponible
italian: rtmidi: nessun dispositivo di input disponibile

source: rtmidi: must specify a device number, not a name
french: rtmidi : il faut spécifier un numéro de périphérique, pas un nom
italian: rtmidi: si deve specificare un numero di dispositivo, non un nome

source: The available MIDI input devices are:
french: Les périphérique d'entrée MIDI disponibles sont :
italian: I dispositivi di input MIDI disponibili sono:

source: rtmidi: input device number is out of range
french: rtmidi : le numéro du périphérique d'entrée est hors limites
italian: rtmidi: numero del dispositivo di input fuori range

source: rtmidi: memory allocation failure
french: rtmidi : échec de l'allocation mémoire
italian: rtmidi: allocazione di memoria fallita

source: Opening MIDI input device %d (%s)
french: Ouverture du périphérique d'entrée MIDI %d (%s)
italian: Apertura del dispositivo di input MIDI %d (%s)

source: rtmidi: could not open input device
french: rtmidi : impossible d'ouvrir le périphérique d'entrée
italian: rtmidi: non posso aprire il dispositivo d'input

source: rtmidi: no output devices are available
french: rtmidi : aucun périphérique de sortie n'est disponible
italian: rtmidi: nessun dispositivo d'output disponibile

source: The available MIDI output devices are:
french: Les périphériques de sortie MIDI disponibles sont :
italian: I dispositivi d'output MIDI disponibili sono:

source: rtmidi: output device number is out of range
french: rtmidi : le numéro du périphérique de sortie est hors limites
italian: rtmidi: il numero del dispositivo d'output ?? fuori intervallo

source: Opening MIDI output device %d (%s)
french: Ouverture du périphérique de sortie MIDI %d (%s)
italian: Apertura del dispositivo d'output MIDI %d (%s)

source: rtmidi: could not open output device
french: rtmidi : impossible d'ouvrir le périphérique de sortie
italian: rtmidi: non riesco ad aprire il dispositivo d'output

source: Windows MME real time audio and MIDI module for Csound by Istvan Varga
french: Module Windows MME audio en temps réel et MIDI pour Csound par Istvan Varga
italian: modulo Windows MME per audio in tempo reale per Csound di Istvan Varga

source: could not allocate global structure
french: impossible d'allouer la structure globale
italian: non riesco ad allocare la struttura globale

source: rtaudio: WinMM module enabled
french: rtaudio : module WinMM activé
italian: rtaudio: modulo WinMM abilitato

source: rtmidi: WinMM module enabled
french: rtmidi : module WinMM activé
italian: rtmidi: modulo WinMM abilitato

source: virtual_keyboard.cpp: error allocating FLTK flags
french: virtual_keyboard.cpp : erreur lors de l'allocation des options FLTK

source: Error registering opcode '%s'
french: Erreur en enregistrant l'opcode '%s'

source: Invalid snapshot. Perhaps you modified orchestra widget code after you saved the snapshot bank.
french: Instantané non valide. Peut-être avez-vous modifié le code d'un widget de l'orchestre après avoir sauvegardé la banque d'instantanés.

source: No name for FLbutbank
french: Pas de nom pour FLbutbank

source: FLsetsnap: invalid table
french: FLsetsnap : table non valide

source: setsnap saving
french: setsnap enregistre

source: Saving could overwrite the old file. Are you sure to save ?
french: La sauvegarde écrasera l'ancien fichier. Etes-vous sûr ?

source: Warning
french: Avertissement

source: Saving could overwrite the old file. Are you sure you want to save ?
french: La sauvegarde écrasera l'ancien fichier Etes-vous certain de vouloir sauvegarder ?

source: No
french: Non

source: Yes
french: Oui

source: FLsavesnap: cannot open file
french: FLsavesnap : impossible d'ouvrir le fichier

source: FLloadsnap: cannot open file
french: FLloadsnap : impossible d'ouvrir le fichier

source: unmatched widget, probably due to a modified orchestra. Modifying an orchestra makes it incompatible with old snapshot files
french: widget non apparié, probablement à cause d'une modification de l'orchestre.La modification d'un orchestre le rend incompatible avec les anciens fichiers d'instantanés

source: end of widget thread
french: fin du thread de widget

source: FLrun was already called
french: FLrun a déjà été appelé

source: FL_run: memory allocation failure
french: FL_run : échec de l'allocation mémoire

source: Error: Unable to fork process
french: Erreur : Impossible de lancer le processus

source: FLpanel_end: invalid stack pointer: verify its placement
french: FLpanel_end : pointeur de pile non valide : vérifier sa position

source: FLpanel_end: invalid stack count: verify FLpanel/FLpanel_end count and placement
french: FLpanel_end : compte de la pile non valide : vérifier le nombre de FLpanel/FLpanel_end et leurs positions

source: FLscroll_end: invalid stack pointer: verify its placement
french: FLscroll_end : pointeur de pile non valide : vérifier sa position

source: FLscroll_end: invalid stack count: verify FLscroll/FLscroll_end count and placement
french: FLscroll_end : compte de la pile non valide : vérifier le nombre de FLscroll/FLscroll_end et leurs positions

source: FLtabs_end: invalid stack count: verify FLtabs/FLtabs_end count and placement
french: FLtabs_end : pointeur de pile non valide : vérifier le nombre de FLtabs/FLtabs_end et leurs positions

source: FLgroup_end: invalid stack pointer: verify its placement
french: FLgroup_end : pointeur de pile non valide : vérifier sa position

source: FLgroup_end: invalid stack count: verify FLgroup/FLgroup_end count and placement
french: FLgroup_end : compte de la pile non valide : verifier le nombre de FLgroup/FLgroup_end et leurs positions

source: FLpack_end: invalid stack pointer: verify its placement
french: FLpack_end : pointeur de pile non valide : vérifier sa position

source: FLpack_end: invalid stack count: verify FLpack/FLpack_end count and placement
french: FLpack_end : compte de la pile non valide : vérifier le nombre de FLpack/FLpack_end et leurs positions

source: System error: value() method called from non-valuator object
french: Erreur système : méthode value() appelée depuis un objet non-valueur

source: FLvalue cannot be set by FLsetVal.
french: FLvalue ne peut pas être rempli par FLsetVal.

source: (fl_setWidgetValuei): not fully implemented yet; exp=%d
french: (fl_setWidgetValuei) : pas encore totalement implémenté ; exp=%d

source: FLvalue cannot be set by FLsetVal
french: FLvalue ne peut pas être rempli par FLsetVal

source: (fl_setWidgetValue_set): not fully implemented yet; exp=%d
french: (fl_setWidgetValue_set) : pas encore totalement implémenté ; exp=%d

source: FLslider exponential, using non-labeled slider
french: FLslider exponentiel, utilisation d'une règlette sans étiquette

source: FLslider: invalid slider type
french: FLslider : type de règlette non valide

source: FLslider: zero is illegal in exponential operations
french: FLslider : zéro est interdit dans les opérations exponentielles

source: invalid ZAK space allocation
french: espace d'allocation ZAK non valide

source: FLslidBnk: zero is illegal in exponential operations
french: FLslidBnk : zéro est interdit dans les opérations exponentielles

source: FLjoy X axe: zero is illegal in exponential operations
french: FLjoy axe X : zéro est interdit dans les opérations exponentielles

source: FLknob: invalid knob type
french: FLknob : type de bouton rotatif non valide

source: FLknob: zero is illegal in exponential operations
french: FLknob : zéro est interdit dans les opérations exponentielles

source: FLbutton "%s" ignoring snapshot capture retrieve
french: FLbutton "%s" ignore les instantanés de capture et de restitution

source: FLbutton: invalid button type
french: FLbutton : type de bouton non valide

source: FLcloseButton: invalid stack pointer: verify its placement
french: FLcloseButton : pointeur de pile non valide : vérifier sa position

source: Command Found: %s
french: Commande trouvée : %s

source: About
french: A propos

source: FLbuttonBank: invalid button type
french: FLbuttonBank : type de bouton non valide

source: FLcount "%s" ignoring snapshot capture retrieve
french: FLcount "%s" ignore les instantanés de capture et de restitution

source: FLroller: invalid roller type
french: FLroller : type de molette non valide

source: FLhvsBox: a square area must be delimited by 2 lines at least
french: FLhvsBox : une surface carrée doit être délimitée par au moins 2 lignes

source: FLkeyIn: invalid table number
french: FLkeyIn : numéro de table non valide

source: FLkeyIn: table too short!
french: FLkeyIn : table trop courte !

source: FLvslidBnk: zero is illegal in exponential operations
french: FLvslidBnk : zéro est illégal dans les opérations exponentielles

source: FLsliderBank: zero is illegal in exponential operations
french: FLsliderBank : zéro est illégal dans les opérations exponentielles

source: FLslidBnk2: FLslider exponential, using non-labeled slider
french: FLslidBnk2 : FLslider exponentiel, utilisant une règlette sans étiquette

source: FLsldBnkSet: invalid table number
french: FLsldBnkSet : numéro de table non valide

source: FLslidBnkSet: table too short!
french: FLslidBnkSetk : table trop courte !

source: FLsldBnkSet: invalid outable number
french: FLsldBnkSet : numéro de outable non valide

source: FLslidBnkSet: too many sliders to reset!
french: FLslidBnkSet : trop de règlettes à réinitialiser !

source: FLslidBnkSet: function mapping not available
french: FLslidBnkSet : type de fonction (lin. ou exp.) non disponible

source: FLslidBnk2Setk: value out of range: function mapping requires a 0 to 1 range for input
french: FLslidBnk2Setk : valeur hors limites : le mappage de fonction nécessite en entrée l'intervalle de 0 à 1

source: FLsldBnkSetk: invalid table number
french: FLslidBnkSetk : numéro de table non valide

source: FLslidBnkSetk: table too short!
french: FLslidBnkSetk : table trop courte !

source: FLsldBnkSetk: invalid outable number
french: FLslidBnkSetk : numéro de outable non valide

source: FLslidBnkSetk: too many sliders to reset!
french: FLslidBnkSetk : trop de règlettes à réinitialiser !

source: FLslidBnkSetk: invalid table number
french: FLslidBnkSetk : numéro de table non valide

source: FLslidBnkSetk: invalid outable number
french: FLslidBnkSetk : numéro de outable non valide

source: FLxyin: none of X limits can be zero in exponential mode!
french: FLxyin : aucune des limites de X ne peut être zéro en mode exponentiel !

source: FLxyin: none of Y limits can be zero in exponential mode!
french: FLxyin : aucune des limites de Y ne peut être zéro en mode exponentiel !
